{"feed":{"data":[{"message":"I have translated this talk about a couple of months ago, and no one has been able to review it. Can someone please help me out?\n","updated_time":"2016-04-20T18:01:24+0000","id":"43410681471_10153444204251472"},{"message":"BIG THANKS to the team for translating \"Doing the Impossible, Cutting through Fear\" into 40+ languages! Now it needs review in Afrikaans, Burmese, Esperanto, Italian, Japanese, Korean, Latvian, Norwegian, Portuguese, Telugu, and approval in Czech and Slovak.\n\nCAN YOU HELP? It still needs translation into German, Danish, Icelandic, Finnish, Hebrew, Malay, Indonesian, Chinese (Taiwan, Yue), Thai, Lao, Tagalog, Filipino, Cebuano, Hindi, Gujarati, Punjabi, Marathi, Kannada, Sinhala, Ukrainian, Belarusian, Albanian, Bosnian, Bulgarian, Slovenian, Estonian, Lithuanian, Latgalian, Macedonian, Maltese, Pashto, Kurdish, Azerbaijani, Turkmen, Kazakh, Uzbek, Tajik, Kyrgyz, Mongolian, Tatar, Swahili, Amharic, Igbo, Hausa, Kakha, Welsh, Gaelic, Basque, Catalan, and Silesian. Can you please help?\n\nA HUGE THANK YOU to each of you for all your help in changing the world by translating and spreading ideas worth spreading!\n\n","updated_time":"2016-04-19T17:56:20+0000","id":"43410681471_10153445197296472"},{"message":"Hello, I translated this video English to Korean. Could you review this? It is my first TED ed translation. Thank you :)\n\nThe immortal cells of Henrietta Lacks - Robin Bulleri\n\n","updated_time":"2016-04-19T16:28:34+0000","id":"43410681471_10153303416371472"},{"message":"Hi! Can anyone review the english or italian subtitles of this talk? Thanks! \n","updated_time":"2016-04-17T19:06:27+0000","id":"43410681471_10153444894606472"},{"message":"Hello everyone,\n\nI just finished translating this TED talk (English to Japanese), and it would be greatly appreciated if someone could review it. Thanks!\n\n","updated_time":"2016-04-17T19:06:17+0000","id":"43410681471_10153445974426472"},{"message":"3 weeks ago, my city, Brussels, was hit by brutal ISIS terrorist attacks. In search of nuanced voices about Islam, I discovered mvslim.com, a website run by young Belgian muslims. They had made a list of 10 TED and TEDxTalks by inspiring muslims. They were all available for subtitling, except for one. I transcribed it together with my friend, TED OTP Arabic Language coordinator Anwar Dafa-Alla. I would like to encourage you to discover this gem and to let Noor Tagouri shine by translating her talk. ","updated_time":"2016-04-16T13:27:50+0000","id":"43410681471_10153439315571472"},{"message":"Thank you to all the translators who are working on or who have already posted translations to my TED talk \"How to get back to work after a career break.\" I am indebted to all of you and appreciate your hard work very much.  Sincerely, Carol Fishman Cohen, CEO, iRelaunch ","updated_time":"2016-04-15T20:36:08+0000","id":"43410681471_10153440455071472"},{"message":"Hi everyone!!! So glad to be part of this group!!!!!! I translate this talk. http:\/\/www.amara.org\/es\/videos\/JbI4Hws2d8sD\/url\/1634806\/ it is the very first one. Who can review this talks for me? See u.","updated_time":"2016-04-14T06:43:24+0000","id":"43410681471_10153439940756472"},{"message":"I translated the video into simplified Chinese. Who can help me to review? Thank you","updated_time":"2016-04-12T15:32:00+0000","id":"43410681471_10153436994311472"},{"story":"Dimitra Isiliel Papageorgiou edited a doc in the group: I Translate TEDTalks.","updated_time":"2016-04-12T13:08:29+0000","id":"43410681471_10150522301776472"},{"message":"Hello! A month ago I finished the Chinese, Simplified translation of Ivan Coyote: Why we need gender-neutral bathrooms, it had been reviewed by another contributor Huazhe Xie, and was published about two weeks ago. But the TED webpage seems to have a glitch or a bug, making the mistake of saying that I am the reviewer, while Xie is the translator. Could you please look into this small issue and make our roles correct? Thank you very much!\n\nLink:","updated_time":"2016-04-11T11:27:31+0000","id":"43410681471_10153433989091472"},{"message":"Hello everyone!\nI am looking for someone who could approve this review. However I forgot to correct the description. Could somebody send it back to me o correct it before approving it? Thank you very much\n\n","updated_time":"2016-04-11T11:27:20+0000","id":"43410681471_10153434506396472"},{"message":"Hi, everyone! Quick question: Does anyone know what happens when you submit your subtitles after your time to do the task has expired? This happened to me today; I submitted the subtitles I think 1 or 2 minutes late, and I'm wondering if the task will be assigned to someone else and all my work will be for nothing :( Thanks!","updated_time":"2016-04-10T17:50:38+0000","id":"43410681471_10153432846356472"},{"message":"Before you submit your work in Amara, you should translate the title and description of the talk. See how this is done in the new tutorial: ","updated_time":"2016-04-10T17:49:02+0000","id":"43410681471_10153432885926472"},{"message":"Hello fellow TED translators,\nCan anyone please review the English subtitle in this video.. This is my speech with my heart and soul.  I would like to share this message with my family and friends in Japan as soon as I can. \nThank you so much,\nMari \n\n","updated_time":"2016-04-10T01:56:43+0000","id":"43410681471_10153427006016472"},{"message":"One of our fellow translators asked what to do if a TEDx video becomes a TED.com video.  The TEDx video is pending review and the TED.com video has just been started by another person. What to do in this case?\n\nI think I have seen this question popped up somewhere before but I'm not so sure. Sorry for asking this again.","updated_time":"2016-04-08T19:32:33+0000","id":"43410681471_10153426275976472"},{"message":"I just translated this handy talk into Burmese and it would be very useful for all translators on Amara and thank you very much fro providing such a prafocal lessons , OTP !","updated_time":"2016-04-08T01:40:40+0000","id":"43410681471_10153426357836472"},{"message":"Today I completed and submitted subtitling in Urdu of \" Inside the mind of master procrastinator\" by Tim Urban. Please let me know who is reviewing this Talk.","updated_time":"2016-04-07T11:42:06+0000","id":"43410681471_10153425755901472"},{"message":"Hello friends, I translated in Urdu the following TED Talk: A Simple Way to Break a Bad Habit by Judson Brewer.Can anyone update me with the review status.","updated_time":"2016-04-07T11:39:34+0000","id":"43410681471_10153425779031472"},{"message":"Dear TED fellow translators, I really need your help with this. I have a problem syncing timing for the final subtitle in a video like this. Can anyone help?","updated_time":"2016-04-05T15:58:06+0000","id":"43410681471_10153420450966472"},{"message":"Hey fellow translators. I translated a talk a WHILE ago. I submitted it for reviewing but the video says: \"This language contains subtitles that are still waiting to be moderated. Check back later.\" Is this nornal? Can reviewers still review the video?","updated_time":"2016-04-05T11:01:57+0000","id":"43410681471_10153405702141472"},{"message":"BIG THANKS to everyone for translating \"Doing the Impossible, Cutting through Fear\" into 40+ languages. It needs review in Afrikaans, Burmese, Esperanto, Italian, Japanese, Korean, Latvian, Norwegian, Portuguese, Telugu, and needs approval in Czech and Slovak please.\n\nCAN YOU HELP? It still needs translation into German, Danish, Icelandic, Finnish, Hebrew, Indonesian, Thai, Lao, Tagalog, Filipino, Cebuano, Hindi, Gujarati, Punjabi, Marathi, Kannada, Sinhala, Ukrainian, Belarusian, Albanian, Bosnian, Bulgarian, Slovenian, Estonian, Lithuanian, Latgalian, Macedonian, Maltese, Kurdish, Azerbaijani, Turkmen, Kazakh, Uzbek, Tajik, Mongolian, Swahili, Amharic, Igbo, Welsh, Gaelic, Basque, Catalan, and Silesian. Can you please help?\n\nBIG THANK YOU to each of you for your help in changing the world by translating and spreading ideas worth spreading!","updated_time":"2016-04-05T08:54:53+0000","id":"43410681471_10153416040041472"},{"message":"Please help with the English TEDxTalk by Rob Streevelaar TEDxMoscow\n\n","updated_time":"2016-04-04T08:41:35+0000","id":"43410681471_10153418732981472"},{"message":"Hello, There's a talk that waits for the review. The guy shares an idea on a computer game that encourages kids to go out and play it outside instead of spending hours in front of their computers. Give a try. It's not a long talk (Polish to English)\n","updated_time":"2016-04-03T13:06:45+0000","id":"43410681471_10153414781506472"},{"message":"What softwares do you use to create or edit subtitles and translations? What do you like about it? Why do you prefer to use it instead of using Amara? \nThanks!!!","updated_time":"2016-04-01T21:35:51+0000","id":"43410681471_10153379293486472"},{"message":"Hi team! Check out this awesome message TED speaker Siyanda Mohutsiwa requested to be passed along to our wonderful OTP tribe. :) Let's help Siyanda get her talk translated into many languages, in particular French, Portuguese, Arabic, and Swahili, which are spoken by many people in Africa.\n---------------------------------------------------------------------------------------\nMy talk was supposed to be about a hashtag, but somehow it became a talk about hope! When I gave this speech in Amsterdam, at the end of it, an older African man came to find me, and he had tears in his eyes—a man the age of my father! He told me he had once been a refugee, moving from Congo to the Netherlands. He told me that my talk had reignited in him a love of Africa and had softened the anger he had towards men like Kabila and Mobutu who had all but destroyed life for ordinary people in his region. To me this was most moving. \n\nWhen the talk went up on TED after I gave it in Vancouver for a larger audience, I got emails from all over Africa expressing the same feeling: hope. But here’s the thing—not that many people will see it. The vast majority of Africans have no access to this stuff. But I believe in my heart, whoever I can reach with my message—the message of some kid in Botswana who just wants to share the message of a hopeful tomorrow to a continent filled with those who see no reason to believe, I might reach someone. I might reach future leaders who just might see this speech and carry in their hearts this compassion—a compassion that we desperately need and which we unknowingly have in all our cultures (all over the world!) and maybe, these leaders of tomorrow, will make a change that we so desperately need.\n\nBut the other thing is: not everyone speaks English in Africa. And although I have real plans to learn French and Swahili and Portuguese and one day Arabic, I have full faith in you all to help me spread my message with the elegance with which you have done others, as soon as you can. I would deeply appreciate that, and I know one day, so will the Francophones and Luophones and babui ba Swahili and the Arabians who make up this great big continent I call home.\n---------------------------------------------------------------------------------------","updated_time":"2016-04-01T19:18:02+0000","id":"43410681471_10153413411076472"},{"message":"Hi everyone,\n\nHave you watched Angelica Dass’ TEDTalk, The beauty of human skin in every color? Angelica first gave this talk at TEDxMadrid; the talk was translated into English, and she was invited to speak at TED2016.\n\nYour help is needed to bring the talk from English into Catalan, Galician and Basque, and help share it with the community where Angelica’s project started. Your contribution is very valuable and greatly appreciated.\n\nSi quereis echar una mano a la difusion de este proyecto nacido en España y ahora global que hace pensar en el color de piel de una manera diferente y ayuda a eliminar barreras y prejuicios, darnos  una mano con la traduccion en catalan gallego y euskera.\nmuchas gracias a todos - Antonella Broglia, TEDxMadrid organizer","updated_time":"2016-04-01T16:36:45+0000","id":"43410681471_10153412489546472"},{"message":"Hi everyone,\nQuick question:  on Amara, is it possible to displace the subtitles a little? I am transcribing a TEDx of someone using Sign Language and some of the subtitles are overlapping the hands of the person from time to time. Is it possible to place the subtitles at the top?\nIt would be a shame that Deaf people who can understand the Sign Language used would not have access to it.\nThanks :)\n\nHere's the talk if someone's interested in it :)\n","updated_time":"2016-04-01T15:00:22+0000","id":"43410681471_10153412468556472"},{"message":"Hello,\nThe following talk needs approval. :)\n","updated_time":"2016-04-01T12:07:35+0000","id":"43410681471_10153303232701472"},{"message":"Hi :-)\nCould anyone approve my subtitles. \nThank you \n","updated_time":"2016-03-31T16:06:06+0000","id":"43410681471_10153409350311472"},{"story":"Dimitra Isiliel Papageorgiou edited a doc in the group: I Translate TEDTalks.","updated_time":"2016-03-31T11:14:38+0000","id":"43410681471_10150539010401472"},{"message":"Hey everyone,\n\nToday's TEDTalk - Lisa Nip: How humans will evolve to survive in space - comes from TEDxBeaconStreet. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/8ApQ8bofIW8I\/info\/how-humans-will-evolve-to-survive-in-space\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/x1FDjF5AsEiB\/info\/how-humans-will-evolve-to-survive-in-space-lisa-nip-tedxbeaconstreet\/","updated_time":"2016-03-30T15:33:12+0000","id":"43410681471_10153406361841472"},{"message":"Hi fellow translators, \nI am part of a TEDx team (TEDxCuauhtémoc) and we are really interested in finding anyone willing to help us with the english translation review of the present video. \nIt is a nice talk of a young Mexican scientist and how science can save communities from violence. \nAny help would be highly appreciated. \nThanks in advance\n","updated_time":"2016-03-30T03:05:52+0000","id":"43410681471_10153327901681472"},{"message":"Hello everyone! I just started participating to the project. I picked up a video where the task was \"translate\" but in fact the subtitles have already been translated 10 months ago and in the commentaries I found out that it was sent back because of the lenght of each caption (more a revision task for my understanding). What would you suggest me to do? Refuse the task maybe? Thank you very much for your help!! :-)","updated_time":"2016-03-29T19:59:56+0000","id":"43410681471_10153403706171472"},{"message":"Hi. :) I translated some subtitles a while ago and they passed review six weeks ago, but haven't yet been approved. Does anyone know how long this process takes? Thanks!","updated_time":"2016-03-29T15:45:49+0000","id":"43410681471_10153402957011472"},{"message":"Hi team! \nHere is the link to my first translation (from italian into french), it passed the review, but the reviewer left some mistakes tha I noticed afterward (typing mistakes), i really don't want to publish it this way... \ncan an experienced translator correct it before final approval? \nI can also give you the exact time of the subtitles in which i noticed mistakes if you want.\nI would be really greatfull if someone could do it, because unfortunatly I can't modify anything anymore myself ... \n\nThanks a lot and I'm looking forward to hearing you feedbacks!","updated_time":"2016-03-29T11:52:44+0000","id":"43410681471_10153397628886472"},{"message":"https:\/\/amara.org\/fr\/videos\/aw2Jy3y6rldq\/fr\/1264811\/\n\nHi,\nI just finished to translate this video from Italian into French, it needs to be reviewed. Someone interested?\n\nThanks!","updated_time":"2016-03-29T09:23:59+0000","id":"43410681471_10153364729311472"},{"message":"Honesty, determination, and believing in yourself:\n","updated_time":"2016-03-28T13:04:48+0000","id":"43410681471_10153398038941472"},{"message":"Hi guys! \n\nI have completed subtitles translation (from English to French (Canadian) for this talk: https:\/\/s3.amazonaws.com\/ted.conferences\/talk\/transcript\/2015Z\/None\/ThomasPeschak_2015Z-transcript.mp4. It now needs reviewing! \n\nThanks! :)","updated_time":"2016-03-28T13:04:44+0000","id":"43410681471_10153398398681472"},{"message":"Hi team! I have a problem, my (french) first subtitles passed the review (it still needs approval), and re-reading it once again, I noticed some mistakes (typing mistakes) that the reviewer didn't see.. I really want to change it before its validated for good, but I can't do it myself...\nSo do you know if its still possible for someone to correct it before the final validation?","updated_time":"2016-03-27T21:58:14+0000","id":"43410681471_10153393747691472"},{"message":"Great food for thought, this highly relevant talk on environmental and energy issues. Please consider for translation.","updated_time":"2016-03-27T16:41:26+0000","id":"43410681471_10153396837496472"},{"message":"Hi team! I really need this video to be review (original version : italian, french subtitles), I'm looking forward to hearing your feedback... Thanks a lot!","updated_time":"2016-03-26T14:53:10+0000","id":"43410681471_10153392498811472"},{"message":"Hello, I have just finished the Simplified Chinese translation of this TED Talk about undersea corals and climate change, and I'm quite sure there's a mistake in the original English transcription of this talk. At 8:53, the speaker talked about a passage between South America and Antarctica, which is named the Great Passage in the transcription. However, the correct name of that passage is the Drake Passage. The speaker talked extremely fast and it is really easy to mishear the words. Is it possible for the admin to correct this? Thank you very much, and also please review my translation!","updated_time":"2016-03-25T17:21:14+0000","id":"43410681471_10153389261701472"},{"message":"This is first ever talk that I have ever attendied in my country !  How can I update my TED profile as an event that I personally attended ? #TEDxInyaLake","updated_time":"2016-03-24T14:37:12+0000","id":"43410681471_10153382792541472"},{"message":"A talk about a woman who gave up her job as a teacher to become a truck driver. Translated from Polish to English. Please review it. Thanks!\n","updated_time":"2016-03-23T12:59:32+0000","id":"43410681471_10153351593841472"},{"message":"Hi all - I'm working on Meron Gribetz's talk (translation) on his invention - and I would so much appreciate if anyone familiar with neuroscience can share your knowledge by putting what he describes as \"morror-neuron subsystem\" in lay terms, or kindly point toward some reliable artticle, so that i can convey that meaning accuratelty into my language. Thank you in advance! ☺️\n\nhttps:\/\/www.youtube.com\/watch?v=F5Nrw_7oeJg&feature=youtu.be&t=7m20s","updated_time":"2016-03-23T09:01:59+0000","id":"43410681471_10153377538871472"},{"message":"Hi everyone,\n\nToday's TED Talk of the day - Carol Fishman Cohen: How to get back to work after a career break - comes from TEDxBeaconStreet. Both videos are available for translation:\n\nTEDTalk: http:\/\/amara.org\/en\/videos\/DXE05T90UJUP\/info\/how-to-get-back-to-work-after-a-career-break\/\n\nTEDxTalk: http:\/\/amara.org\/en\/videos\/Dpms4j6B34Fv\/info\/how-to-get-back-to-work-after-a-career-break-carol-fishman-cohen-tedxbeaconstreet\/\n\nEnjoy the talk!","updated_time":"2016-03-22T18:40:19+0000","id":"43410681471_10153379772761472"},{"message":"Hey team!\nI need your help! I recently transcribed the TEDxMaastricht talk \"Doing the impossible, cutting through fear”. It's reviewed and approved in English and is available for translation. http:\/\/youtu.be\/v7tqyim1qhw\n\nBut I NEED YOUR HELP! I'm requesting you to please translate my talk in as many languages as possible starting with Chinese (Simplified \/Traditional), Japanese, Korean, Thai, Arabic, Urdu, Hindi, Bengali, Punjabi, Gujarati, Nepali, Tamil, Telugu, Indonesian, Javanese, German, Dutch, Danish, Norwegian, Swedish, Icelandic, Finnish, Spanish, Italian, French, Brazilian Portuguese, Russian, Ukrainian, Czech, Hungarian, Bulgarian, Hebrew, and any other languages you work in!\n\nThe past few weeks I've had a crash course in translating and transcribing and I'm blown away! Thank YOU for all the work you do for the TED community in making the work of speakers available to the world! Your gift of translation helps spread ideas and touch lives in a huge way to so many people who would otherwise be shut out from the free education that TED \/TEDx talks provide. The world relies on community and the TED communityand my fellow speakers are lucky to have all of you and YOUR gift of communication! I hope you’ll have fun translating my talk – its aim is to be a universal message that people CAN cut through fear and do the impossible in THEIR lives! \n\nThank you for helping spread ideas worth spreading and thank you for helping me take my simple message to the rest of the world!! I'm looking forward to seeing your translations! Please let me know if you need any clarifications on anything! \n\nAll the best,\n\nDan Meyer\n","updated_time":"2016-03-21T13:16:27+0000","id":"43410681471_10153367557976472"},{"message":"Hello, I gave a TEDx talk at Paris Saclay. The talk was originally in English. I have translated the talk into French, and would like to put in the subtitles, but have had some difficulty entering the appropriate space on the Amara site. I would like to know if there is someone willing and able to do the technical work to put the subtitles in. The talk has already been transcribed. Please contact me at ann.p.adamovic\u0040gmail.com and I will send you the translation. I thank you in advance. Sincerely, Ann Papoulis Adamovicic","updated_time":"2016-03-21T12:00:42+0000","id":"43410681471_10153375310621472"},{"message":"Please check this amazing talk (from Polish to English) about acoustics, sound and its impact on human health. The guy, audio brander and sound designer, also talks about frequency, vibrations and compares our hearing range with that of animals'. Please review this talk! Thank you.\n","updated_time":"2016-03-21T08:34:18+0000","id":"43410681471_10153374803901472"},{"message":"Hi guys, I have a question about Amara tasks. My understanding is if you don't complete a task within 30 days, you will lose it and it will become unassigned so anyone else can take it. Then what's happening when you see a task flagged as \"overdue\" past your deadline and it is still in your task list? How long can you keep the task as overdue?","updated_time":"2016-03-18T14:37:46+0000","id":"43410681471_10153365997771472"},{"message":"http:\/\/www.ted.com\/talks\/tim_urban_inside_the_mind_of_a_master_procrastinator : I can't find this talk on Amara to translate ! Not available yet ?","updated_time":"2016-03-16T15:37:21+0000","id":"43410681471_10153361932181472"},{"message":"I finished translating this into Spanish from English. Could someone please review it?\n\n","updated_time":"2016-03-16T11:57:18+0000","id":"43410681471_10153360910271472"},{"message":"Hello, some translation works here waiting for approval. You are all overstretched I know, but please, can you have a look ?\n\nhttp:\/\/www.amara.org\/en\/videos\/JJDrTfR8ytdu\/en\nhttp:\/\/www.amara.org\/en\/videos\/6tixArWBjK6p\/en\nhttp:\/\/www.amara.org\/en\/videos\/WBkP7s9EegM8\/en\nhttp:\/\/www.amara.org\/en\/videos\/YkgIcCqwzK6l\/en\n\nthanks a lot\nclaire","updated_time":"2016-03-16T11:57:10+0000","id":"43410681471_10153361134936472"},{"message":"Hello! I just finished translating my first video from Spanish to English, would someone be so kind as to review it? Thanks! ","updated_time":"2016-03-16T11:57:07+0000","id":"43410681471_10153361210501472"},{"message":"English review needed. Just completed my translation of this nice talk. The talk is about a woman who suffered several strokes, which made her to have to learn to talk and speak from the very beginning. Her condition is described as Aphasia. Please review this talk to find out how she managed to make a recovery.\n\n","updated_time":"2016-03-16T11:56:53+0000","id":"43410681471_10153362073621472"},{"message":"Dear all,\nWe're organising a full day of TEDx talk transcription and translation in France on Saturday, March 19th. As Amara is online you're all welcome to participate online as well! \nThe event was named TraducthON, like a Hackathon for translation ;)\n\nIt will heppen in several locations in France, Paris with TEDxVaugirardRoad, Clermont-Ferrand with TEDxClermont and in Guadeloupe with TEDxPointeàPitre. Others are joining in.\nThere will be talks already transcribed, we have talks translated in english already, waiting for other languages, everything is open.\n\nYou want to join? You'll find in the comments the link to the google form. Hope to see some of you on the 19th, the more the merrier!","updated_time":"2016-03-16T09:07:29+0000","id":"43410681471_10153345298181472"},{"message":"Hey all! I recently transcribed this video called \"The false narrative of deception: Carys Massarella, can someone please review it? \n\n","updated_time":"2016-03-15T21:57:06+0000","id":"43410681471_10153360907956472"},{"message":"Hi team!\n\nTED speaker and co-founder of Airbnb, Joe Gebbia, needs our support. He is hoping we can help translate his talk in as many languages as possible, starting with Spanish, Chinese (Simplified and Traditional), Japanese, Korean, German, French, Italian, and Brazilian Portuguese. Here is a note from Joe which he asked to be passed on to you:\n\nDear Translators,\n\nThank you for the work you do for the TED community, in making the work of the speakers accessible to the world. I've gotten a crash course in who you are and what you've accomplished, and I'm blown away. The gift you're giving is touching so many people who would otherwise be shut out from the free education TED provides. As someone who also relies on community in our organization, TED is lucky to have you. And so are my fellow speakers. I hope you have fun with my talk – its aim is to be a universal message about trust. So thank you for bringing that message to the universe.\n\nJoe","updated_time":"2016-03-15T16:42:47+0000","id":"43410681471_10153358718356472"},{"message":":) (Y) ","updated_time":"2016-03-15T14:28:53+0000","id":"43410681471_10153358941716472"},{"message":"Needs review :-) English to Italian\n\n","updated_time":"2016-03-15T12:24:39+0000","id":"43410681471_10153359950506472"},{"message":"Hi everyone! I just finished the translation of this video, from Italian to French, it needs to be review and approve! Thanks a lot! :)\n\n","updated_time":"2016-03-15T08:09:24+0000","id":"43410681471_10153358397966472"},{"message":"Hello team, do you know if there's a place on TED or Amara to rate each other work at translation ? Most of the time I pick up a \"Review subtitle\" task, I found the talk have been translated using Google Translate or the like. Each and every sentences make no sense or they are the complete opposite of what has been said. Any idea how to improve that ?","updated_time":"2016-03-14T08:36:27+0000","id":"43410681471_10153349619936472"},{"message":"(Yet another) proof that the quality of your translations matters: http:\/\/www.lingholic.com\/how-to-learn-languages-through-ted-talks","updated_time":"2016-03-14T07:53:03+0000","id":"43410681471_10153357451106472"},{"message":"Funny and more: “How to speak Woman | Alexandra Petri | TEDxBaltimore”\n","updated_time":"2016-03-14T00:47:09+0000","id":"43410681471_10153356868641472"},{"message":"Hello! My name is Billy and I work at Marina Abramovic Institute. I am passing along a message on her behalf:\n\nDear TEDTalk Translator Community,\n\nMy name is Marina Abramovic and I am a performance artist. I presented my TED Talk last March at the Vancouver conference and it was released just last month. I am overwhelmed already by the amount of support I have received. \n\nAs of today, it is in need of being translated in several languages including Greek, Hindi and German. I would be extremely grateful for some help in translating these subtitles to make it available for as many people as possible. Thank you so much for the work that you do.\n\nLove,\nMarina Abramovic","updated_time":"2016-03-11T23:46:58+0000","id":"43410681471_10153247596591472"},{"message":"Hey! :) I was wondering, why is it that when I look at the tasks for a video, even when there are no subtitles available on my language (Spanish), the task still doesn't appear? When I click on \"view tasks for this video\", it says \"Sorry, there are no tasks here\", even though I'm sure there are no Spanish subtitles (not even as a work in progress). Is Amara not allowing me to do subtitles for TED videos? (I don't seem to have problems with TEDx videos) :\/ Thanks for your help.","updated_time":"2016-03-11T21:10:32+0000","id":"43410681471_10153351640146472"},{"message":"Hi translators,\n\nThe Thursday TEDTalk of the day - Mileha Soneji: Simple hacks for life with Parkinson's - comes from TEDxDelft. Both videos are available for translation:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/m0kR0EIKKBmL\/info\/simple-hacks-for-life-with-parkinsons\/?tab=video\n\nTEDxTalk: http:\/\/amara.org\/en\/videos\/KCN9GZagFWKK\/info\/simple-hacks-for-life-with-parkinsons-mileha-soneji-tedxdelft\/?tab=video\n\nEnjoy the talk!","updated_time":"2016-03-11T09:51:09+0000","id":"43410681471_10153349644366472"},{"message":"Hello Guys, how are you?\ncan anyone or an English LC review this talk, i need it to translate it to Kurdish, unless i have the English Transcription,i cannot Translate it. \nhttp:\/\/www.amara.org\/en\/teams\/ted\/tasks\/?team_video=246187\nThank you.","updated_time":"2016-03-10T15:07:15+0000","id":"43410681471_10153342544071472"},{"message":"Hi everyone, \n\nCould anyone approve my translation please?\nThank you :-)\n\n","updated_time":"2016-03-10T13:24:12+0000","id":"43410681471_10153347205171472"},{"message":"Hi translators,\n\nThe Wednesday TEDTalk of the day - Laura Robinson: The secrets I find on the mysterious ocean floor - comes from TEDxBrussels. Both videos (original TEDx and edited TEDTalk) are available for translation:\n\nTEDTalk: http:\/\/amara.org\/en\/videos\/dlIVPz04Jxv9\/info\/the-secrets-i-find-on-the-mysterious-ocean-floor\/?tab=video\n\nTEDxTalk: https:\/\/amara.org\/en\/videos\/deBW5lEFvYdc\/info\/the-secrets-i-find-on-the-mysterious-ocean-floor-laura-robinson-tedxbrussels\/?tab=video\n\nEnjoy the talk!","updated_time":"2016-03-10T10:03:48+0000","id":"43410681471_10153346776936472"},{"message":"Hello, \nI am about to finish my first translation to Spanish in Amara: \"Durable healthcare: redesigning a system to work for everyone | Mark Arnoldy | TEDxMileHigh\", but I think that the english description is weird and does not properly explain the talk's subject.\nCould I modify the description in my language or I just have to translate the existing description?\nThank you for your help\n👍","updated_time":"2016-03-09T14:26:24+0000","id":"43410681471_10153343503141472"},{"message":"Hi guys, I'm translating this talk and have a quick question!\n\nWhen Ivan says at 00:10:27 \"What about people with disabilities\nor who need assistance in there?\", what exactly does she mean \"in there\"? \n\nMy guess is \"in the toilet” but I could be wrong. I appreciate any help you can offer!\n\n","updated_time":"2016-03-08T12:41:22+0000","id":"43410681471_10153339048366472"},{"message":"Hello, \nReview needed from English to Italian. :)","updated_time":"2016-03-07T10:49:01+0000","id":"43410681471_10153338677881472"},{"message":"Hello, The talk ( about forests) is ready for a review. Thanks in advance\n","updated_time":"2016-03-07T09:26:16+0000","id":"43410681471_10153340066271472"},{"message":"Highly recommended for translation: http:\/\/www.amara.org\/es\/videos\/W3GNEWq2N6zp\/info\/stories-that-matter-from-where-love-is-illegal-robin-hammond-tedxuniversityofnicosia\/\n\nSee also: http:\/\/www.npr.org\/sections\/goatsandsoda\/2016\/03\/04\/466427039\/when-falling-in-love-can-put-your-life-in-danger","updated_time":"2016-03-05T22:44:46+0000","id":"43410681471_10153337447821472"},{"message":"Hello everyone,\nI've just finished transcribing this video. It's in English, but since it was recorded at a uni in France, the speaker also used French in a few places. Unfortunately, I hardly speak any French. So, I'd be grateful if anyone who is fluent in both English and French help review and make necessary additions to the subtitles. \nThanks a lot. \n","updated_time":"2016-03-05T11:28:38+0000","id":"43410681471_10153336559341472"},{"message":"Revision needed! From English to Italian :-)\n","updated_time":"2016-03-04T13:36:48+0000","id":"43410681471_10153333831876472"},{"message":"Hi \u0040ll\n\nI'd like to suggest that we include a \"recommendation\" in the OTPedia, about this little space between the subtitles. Turns out that it causes a \"wink\" on the screen that is very uncomfortable to the eyes.\n\nKrystian Aparta\nis that possible?\n\nCheers!!","updated_time":"2016-03-04T07:14:12+0000","id":"43410681471_10153330037441472"},{"message":"This is a talk about transgender issues. The speaker talked much about the dilemmas and problems trans people have to face. I just finished this translation from English to Chinese Simplified. Please review and thx a lot! :)","updated_time":"2016-03-03T09:45:14+0000","id":"43410681471_10153330367436472"},{"message":"Hello!  Anyone here to review and accept Greek into English TedXacademy2015 videos???","updated_time":"2016-03-03T09:45:06+0000","id":"43410681471_10153330593261472"},{"message":"I want to know if anyone here doing Turkish translation of TED talks.","updated_time":"2016-03-02T18:57:50+0000","id":"43410681471_10153309274111472"},{"message":"Hoi, hoe kopieer je ook al weer de tijdlijn van het origineel, zodat je niet alles hoeft te synchroniseren=","updated_time":"2016-03-01T11:00:57+0000","id":"43410681471_10153320642416472"},{"message":"Hi, TED reviewers! I just finished my first subtitle for TED! If you have time please help me review it below. And it's an inspiring short story about dreams!\n\n","updated_time":"2016-03-01T06:28:25+0000","id":"43410681471_10153323974086472"},{"message":"Hello, everyone. It is my first TED translation piece from English to Chinese simplified. Please help review and many thanks!\n","updated_time":"2016-03-01T06:28:10+0000","id":"43410681471_10153325689206472"},{"message":"Hi everyone! I've just finished translating this extremely critical talk about ethnic prejudice on Muslim women, from English to Chinese Simplified. Please review and thanks a lot! :)","updated_time":"2016-02-27T09:18:41+0000","id":"43410681471_10153319843386472"},{"message":"Hi translators,\n\nToday's TEDTalk - Ivan Coyote: Why we need gender-neutral bathrooms - comes from TEDxVancouver. Both videos are available for translation:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/wkxo8Gnngu3J\/info\/why-we-need-gender-neutral-bathrooms\/?tab=video\n\nTEDxTalk: http:\/\/amara.org\/en\/videos\/Sujq0Xj5xyJI\/info\/why-we-need-gender-neutral-bathrooms-ivan-coyote-tedxvancouver\/?tab=video\n\nEnjoy the talk.","updated_time":"2016-02-26T19:30:47+0000","id":"43410681471_10153319153856472"},{"message":"This talk needs the review (Eng-It). Great talk, btw :-)\n","updated_time":"2016-02-26T17:34:47+0000","id":"43410681471_10153318959636472"},{"message":"If you have not joined yet so I would like to invite you to be member a fast growing group of translators and who are looking for translators:\nhttps:\/\/www.facebook.com\/groups\/324595034315152\/","updated_time":"2016-02-26T12:53:32+0000","id":"43410681471_10153314279186472"},{"message":"Could anybody please approve it? Just a reminder. Thank you in advance.\n","updated_time":"2016-02-26T12:53:21+0000","id":"43410681471_10153318578206472"},{"message":"Hey everyone! Great talk on creativity! Needs review for the French (Canada) subtitles :) Anyone interested?","updated_time":"2016-02-25T14:51:18+0000","id":"43410681471_10153316736096472"},{"message":"My second translation of the week! Feeling so content and joyous when doing these tasks. Please review and thanks a lot :)","updated_time":"2016-02-21T15:42:52+0000","id":"43410681471_10153309213571472"},{"message":"Hello, another talk has been translated (Polish to English). The talk is about optical fibers, photons, entanglement - some physics there. Please review it.\n","updated_time":"2016-02-21T15:42:48+0000","id":"43410681471_10153309250121472"},{"message":"My first TED translation is finally done and waiting for review.\nIt's from English to Hungarian.\n","updated_time":"2016-02-21T11:30:18+0000","id":"43410681471_10153308056131472"},{"message":"Do we have, by any chance, an Afrikaans speaker amongst us? If so, please PM me. Thank you. :-)","updated_time":"2016-02-21T04:27:33+0000","id":"43410681471_10153306720511472"},{"message":"Hi, I'm looking to organise a TEDx event in Stoke-on-Trent in July'17. Please stop by our site and like our page. We'll reciprocate. \n\nhttps:\/\/m.facebook.com\/TEDxStoke2017\/","updated_time":"2016-02-20T16:28:04+0000","id":"43410681471_10153307471661472"},{"message":"Hi I would like to know if some CATALAN reviewer cold review and approve the following talks I translated several weeks ago. As I said both tasks were translated from ENGLISH into CATALAN. I show you the links to the talk below, I hope you can help me, and I would really appreciate it. Thank you in advance :)\n\nHarry Cliff: Have we reached the end of physics?:\nhttps:\/\/www.amara.org\/es\/videos\/1JWLM3DIX0p1\/info\/have-we-reached-the-end-of-physics\/\n\nRaymond Wang: How germs travel on planes:\nhttps:\/\/www.amara.org\/es\/videos\/EOdHVpsfrJDH\/info\/how-germs-travel-on-planes-and-how-we-can-stop-them\/","updated_time":"2016-02-20T16:06:11+0000","id":"43410681471_10153307284306472"},{"message":"Hello. Is there any Italian reviewer or LC to review and approve this talk, which has been translated from Portuguese, Brazilian into Italian? Thanks in advance!\nhttp:\/\/www.amara.org\/pt-br\/videos\/xjMyWuiiVv1t\/info\/uma-nova-narrativa-empresarial-e-um-lucro-que-pode-ser-admiravel-andrea-fortes-no-tedxlacador\/","updated_time":"2016-02-20T11:14:51+0000","id":"43410681471_10153307086141472"},{"message":"Hi everyone! It is my first time translating a TED talk using the amara tool and I am facing some difficulties. I am translating from English into Spanish and I have already finished but I have a number of red errors that I cannot solve. These red errors are related to the length of the subtitle and even when I delete the whole sentence and I write just only one word, I still have the red error. Is there any possibility of resetting all my work and start over? Any help would be hightly appreciated. Thanks","updated_time":"2016-02-19T23:00:00+0000","id":"43410681471_10153290140031472"},{"message":"Hello! Quick question: Does anyone know why some talks do not appear on the TED webpage? It kind of worries me because I've done the subtitles for three talks (though they still need approval), and none of the videos appear on the TED website, so I'm afraid I won't be credited anywhere lol :\/ It's important for me because I'm a professional translator and I intend to have this on my resume as work experience. Thanks in advance :)","updated_time":"2016-02-19T16:15:01+0000","id":"43410681471_10153304347906472"},{"message":"It's been three weeks since I did this translation into English. Can someone please help me out reviewing it?\n\n","updated_time":"2016-02-19T11:15:21+0000","id":"43410681471_10153305155286472"},{"message":"I've just submitted my translation into English of this talk. If anyone would be so kind as to review it...! :) Thanks!!\n\n","updated_time":"2016-02-18T16:57:47+0000","id":"43410681471_10153303800841472"},{"message":"Hi everybody! Can anyone help us with the revision of the english subtitles of this talks?\n\nPablo Fernandez: http:\/\/www.amara.org\/en\/videos\/l7PEBTghPs8P\/info\/lo-imposible-esta-en-la-mente-de-los-comodos-pablo-fernandez-tedxmardelplata\/\nGeorgina Sposetti: http:\/\/amara.org\/en\/videos\/hKdpcpqYanSd\/en\/1007418\/\nDaniel Abadie: http:\/\/www.amara.org\/en\/videos\/ZKkDSyfAtblI\/en\/998189\/\n\nThanks!","updated_time":"2016-02-18T12:50:38+0000","id":"43410681471_10153303495721472"},{"message":"Hello! I have just finished translating this TED MED talk from English to Chinese Simplified. Could anyone please help and review it? Thank you very much :)","updated_time":"2016-02-18T10:04:31+0000","id":"43410681471_10153300212041472"},{"message":"This German TEDxTalk from TEDxGraz (\"Eat and stay young\") has now English subtitles and I recommend it for translation. \n","updated_time":"2016-02-18T09:31:17+0000","id":"43410681471_10153303311466472"},{"message":"If you know German or maybe you would like improve your basic knowledge of German, please join us on our new FB page \"TED in Deutsch\" (TED in German). Like it and share it. :-)\nhttps:\/\/www.facebook.com\/TED-auf-Deutsch-743261749108531","updated_time":"2016-02-18T09:28:23+0000","id":"43410681471_10153303308651472"},{"message":"Needs review! :-) Thank you\n","updated_time":"2016-02-17T21:45:37+0000","id":"43410681471_10153302489031472"},{"message":"Hey translators,\n\nToday's TEDTalk - Celeste Headlee: 10 ways to have a better conversation - comes from TEDxCreativeCoast. Both videos are available for translation:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/70CraLO9JJmq\/info\/10-ways-to-have-a-better-conversation\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/gD0uAHLsyGkD\/info\/10-ways-to-have-a-better-conversation-celeste-headlee-tedxcreativecoast\/\n\nEnjoy the talk!","updated_time":"2016-02-16T17:51:31+0000","id":"43410681471_10153300533321472"},{"message":"Hello! I'm translating my first TEDx Talk (from Spanish into English) and I'm wondering if I should also translate the title and the description of the video, as well as those images that appear right before the talk starts (saying things like \"Imagine, discover\"...\"TEDx... Independently organized TED event\" and so on). I'd appreciate any guidance since I didn't find much information on the OTPedia. Thank you!!","updated_time":"2016-02-16T17:28:02+0000","id":"43410681471_10153300312361472"},{"message":"Hi TEDxers! Can anyone review this english subtitles please? \n\nhttp:\/\/amara.org\/en\/videos\/l7PEBTghPs8P\/en\/991436\/\n\nThanks!","updated_time":"2016-02-16T14:03:07+0000","id":"43410681471_10153300232501472"},{"message":"how to let the people access to my photo ?","updated_time":"2016-02-16T10:33:13+0000","id":"43410681471_10153299417836472"},{"message":"Hello! Needs review! :-)\n","updated_time":"2016-02-16T10:33:08+0000","id":"43410681471_10153300093491472"},{"message":"Happy TED 2016! Anybody else having trouble watching the TED 2016 LIVE stream for I do?","updated_time":"2016-02-15T15:33:12+0000","id":"43410681471_10153298659396472"},{"message":"Hi there! The English subtitles for the video below are ready for review. Thanks! ","updated_time":"2016-02-15T04:49:10+0000","id":"43410681471_10153297510751472"},{"message":"Please consider this for translation:\nhttps:\/\/amara.org\/es\/videos\/BgnPcBwTY0w8\/info\/new-manincredible-xola-malik-tedxsnoislelibraries\/\n\nThank you and enjoy!","updated_time":"2016-02-15T02:24:24+0000","id":"43410681471_10153292070376472"},{"message":"Review please! :-)\n","updated_time":"2016-02-14T18:39:11+0000","id":"43410681471_10153297042346472"},{"message":"Hi there, can I quickly ask for some help on some bits in this video? If you are American, you might find it easier to figure them out:\n\n1. At 2:35, there is some face on screen which cracks the audience up. Do you know who he is and why it's so funny?\n\n2. At 5:50, the speaker says:\nNot on issues 1-10,\nbut on issues 11-1000.\nWhat could these \"issues 1-10\" and \"issues 11-1000\" be referring to?\n\nAny help will be appreciated!\n\n(Amara link: http:\/\/www.amara.org\/en\/videos\/LovYBaW3uF3Q\/info\/our-democracy-no-longer-represents-the-people-heres-how-we-fix-it-lawrence-lessig-tedxmidatlantic\/)\n\n","updated_time":"2016-02-14T00:57:37+0000","id":"43410681471_10153292413586472"},{"message":"Needs review (English to Italian) :-)\n","updated_time":"2016-02-13T17:40:06+0000","id":"43410681471_10153294077756472"},{"message":"Hey guys!\nI translated this video --\"The dictatorship of pleasure and porno-illusion\"-- from Spanish to English and it needs approval. It's very interesting! Could anyone please review it?","updated_time":"2016-02-13T17:40:02+0000","id":"43410681471_10153294243476472"},{"message":"I have finally managed to solve all the technical part of the subtitles and now, the Spanish translation is ready to be reviewed. Thank you!","updated_time":"2016-02-13T17:39:48+0000","id":"43410681471_10153295246681472"},{"message":"Hi! I finished my first translation into Italian for TED and I would like to know if there's somebody who can review it. Thank you so much for your help.","updated_time":"2016-02-13T13:20:26+0000","id":"43410681471_10153294956436472"},{"message":"I have translated this talk in to Burmese (Myanmar ) and it has been reviewed by my friend , our language coordinator ! It turned out that there is no translator's name and reviewer's name on this talk and it is not mentioned on out translation or review list on our TED profile ! Is there anyone who could explain what the problem is , please !","updated_time":"2016-02-12T15:35:16+0000","id":"43410681471_10153283384251472"},{"message":"Hi everyone! We're excited to present to you TED Español, our first Spanish language YouTube channel featuring some of the best TEDx talks given in Spanish, original TED-Ed lessons dubbed in Spanish, as well as subtitled talks from the TED.com archive. This was made possible thanks to OTP contributions in bringing TED to the Spanish-speaking world. :)","updated_time":"2016-02-11T14:59:00+0000","id":"43410681471_10153282513916472"},{"message":"Needs approval! :-)\n","updated_time":"2016-02-11T14:58:55+0000","id":"43410681471_10153289988951472"},{"message":"Hi everyone,\n\nToday's TEDTalk - Gregory Heyworth: How I'm discovering the secrets of ancient texts - comes from TEDxUM. Both videos are available for translation. NOTE: the TEDx video has been available for some time, so the title and description are slightly different, and translations into a few languages are underway.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/0DOAZ3uwNLJm\/info\/how-im-discovering-the-secrets-of-ancient-texts\/?tab=video\n\nTEDxTalk: http:\/\/amara.org\/en\/videos\/XA3W0uWZqA75\/info\/how-to-read-an-invisible-classic-gregory-heyworth-tedxum\/?tab=video\n\nEnjoy the talk!","updated_time":"2016-02-11T14:58:44+0000","id":"43410681471_10153290471281472"},{"story":"Virgini Franc was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:29+0000","id":"43410681471_10153291658666472"},{"story":"Thanyanuch Nucheiiez Chantanurak was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:27+0000","id":"43410681471_10153291659081472"},{"story":"Steven Gu was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:24+0000","id":"43410681471_10153291659191472"},{"story":"伍惠冰 was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:22+0000","id":"43410681471_10153291658746472"},{"story":"Muthu Manikandan was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:19+0000","id":"43410681471_10153291659351472"},{"story":"Alexandra Ana Carstea was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:16+0000","id":"43410681471_10153291658656472"},{"story":"Luiz Henrique was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:14+0000","id":"43410681471_10153291659276472"},{"story":"सुरभि कर्ण was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:12+0000","id":"43410681471_10153291659121472"},{"story":"Chen Ruiyang was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:09+0000","id":"43410681471_10153291658701472"},{"story":"Ana Habebt Medo was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:07+0000","id":"43410681471_10153291659236472"},{"story":"Justyna Niczyporuk was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:03+0000","id":"43410681471_10153291658676472"},{"story":"Elpis Spes was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:58:02+0000","id":"43410681471_10153290609011472"},{"story":"‎عبد الرحمن الخالد‎ was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:57:58+0000","id":"43410681471_10153290609136472"},{"story":"Alexandre Paia Manuel Manuel was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:57:57+0000","id":"43410681471_10153290608491472"},{"story":"Majo Portales was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:57:54+0000","id":"43410681471_10153291659211472"},{"story":"Santhosh Kumar was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:57:53+0000","id":"43410681471_10153291659176472"},{"story":"Salvador Victor Misle Ahumada was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:57:51+0000","id":"43410681471_10153291659156472"},{"story":"Marie Cha was added to I Translate TEDTalks by Krystian Aparta.","updated_time":"2016-02-11T14:57:49+0000","id":"43410681471_10153291659306472"},{"message":"Başka Bir Okul Mümkün Olabilir Mi?_ Demet Atagün \n另一種學校的可能_ Demet Atagün \nI need a review (from Turkish to Chinese), any volunteer?  \nThanks :)\n\n","updated_time":"2016-02-10T11:58:25+0000","id":"43410681471_10153288662311472"},{"message":"Looking for the review! (Eng to It)\n","updated_time":"2016-02-09T17:10:16+0000","id":"43410681471_10153288834376472"},{"message":"Hi translators,\n\nToday's TEDTalk - Sean Follmer: Shape-shifting tech will change work as we know it - comes from TEDxCERN. Both videos are available for translation:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/sPOWxn1ImLKR\/info\/shape-shifting-tech-will-change-work-as-we-know-it\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/F17Mz94Yq4Dy\/info\/shape-shifting-tech-will-change-work-as-we-know-it-sean-follmer-tedxcern\/\n\nEnjoy the talk!","updated_time":"2016-02-09T16:48:19+0000","id":"43410681471_10153288789376472"},{"message":"I need a review (from English to Italian), any volunteer? :-)\nThis is an amazing guy!!\n","updated_time":"2016-02-07T15:23:01+0000","id":"43410681471_10153284000031472"},{"message":"Hello everyone,\nis there a volunteer for reviewing this nice talk from English to Italian? Thank you :-)\n","updated_time":"2016-02-06T16:40:02+0000","id":"43410681471_10153271999501472"},{"message":"Hi everyone,\n\nToday's TEDTalk - Linda Liukas: A delightful way to teach kids about computers - comes from TEDxCERN. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/XIgm6dxbX0Of\/info\/a-delightful-way-to-teach-kids-about-computers\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/tmlRQy6ZLwTg\/info\/a-delightful-way-to-teach-kids-about-computers-linda-liukas-tedxcern\/?tab=video","updated_time":"2016-02-06T12:24:53+0000","id":"43410681471_10153275759011472"},{"message":"thanx fo the acception","updated_time":"2016-02-06T11:09:43+0000","id":"43410681471_10153283315471472"},{"message":"Hi, kindly, could anyone approve my video? I actually forgot that I did translate it! lol!\n\n","updated_time":"2016-02-06T10:33:34+0000","id":"43410681471_10153280737826472"},{"message":"Any volunteer for the review (from english to italian)? \nThanks! :-)\n","updated_time":"2016-02-06T10:33:27+0000","id":"43410681471_10153282126526472"},{"message":"Hi everyone,\n\nToday's TEDTalk - Matthew Williams: Special Olympics let me be myself -- a champion - comes from TEDxVancouver. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/ZXStAXUu3kUV\/info\/special-olympics-let-me-be-myself-a-champion\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/Y997O7J89g65\/info\/special-olympics-let-me-be-myself-a-champion-matthew-williams-tedxvancouver\/\n\nHappy Friday!","updated_time":"2016-02-05T16:17:02+0000","id":"43410681471_10153281928626472"},{"message":"Hello everybody! Any volunteer for the review? (from English to Italian).\nIt's a very nice talk, self-ironic, breathtaking, motivating!\n","updated_time":"2016-02-04T10:47:24+0000","id":"43410681471_10153279833836472"},{"message":"I am happy to share with you an Open Educational Resource (OER) about Learning subtitling using TED OTP. This is an activity to introduce advanced language learners to subtitling, using our volunteer community.\nScholars, me among them, from three European Universities have developed and tested this OER. This Didactic Unit has been designed by Anna Comas-Quin and myself. We have this OER licensed under Creative Commons by NC. That means, you can share — copy and redistribute the material in any medium or form— ; and also adapt — remix, transform, and build upon the material—, as long as you credit us and license your new creations under identical terms.\nThe resource is published at LORO an online platform which contains resources for language teaching available to download and reuse http:\/\/loro.open.ac.uk\/4802\/","story":"Lidia Cámara uploaded a file in the group: I Translate TEDTalks.","updated_time":"2016-02-03T12:12:31+0000","id":"43410681471_10153278410336472"},{"message":"Hello: Looking for help to translate this talk about solar's plummeting costs  and its potential to become the cheapest form of energy we've ever known. Specifically seeking Spanish translators, as well as a language coordinator who can approve existing translations. Thank you!\nhttp:\/\/www.amara.org\/en\/videos\/fQ0q8jBDp9uQ\/info\/how-to-power-the-world-for-just-two-cents-frank-van-mierlo-tedxbeaconstreet\/\nhttps:\/\/www.youtube.com\/watch?v=tWBiTYUlhxQ","updated_time":"2016-02-01T19:10:54+0000","id":"43410681471_10153267488091472"},{"message":"Hello everyboby, any volunteer for the review? Thank you :-)\n","updated_time":"2016-02-01T15:43:24+0000","id":"43410681471_10153275520486472"},{"message":"有人能帮忙Reiew一下么？\nIf there is no reviewer at all, where will my translation go ?","updated_time":"2016-02-01T14:38:28+0000","id":"43410681471_10153275466501472"},{"message":"I finish my first translation from english to spanish subtitles. Do I have to submit it for review or language coordinators will be advised is ready for review?","updated_time":"2016-02-01T09:55:00+0000","id":"43410681471_10153272790366472"},{"message":"Appel aux traducteurs français ! Is anyone interested in approving the French subtitles of this really interesting video on journalism ? The video has already been reviewed, I am just waiting on approval. Merci d'avance et bon après-midi !\n\n","updated_time":"2016-01-31T17:37:51+0000","id":"43410681471_10153273727061472"},{"message":"Hi, could any of the Italian language coordinators kindly approve The paranoid optimist by Charlie Jane Anders, which has been now reviewed?\nThank you!","updated_time":"2016-01-31T17:37:46+0000","id":"43410681471_10153272602901472"},{"message":"Hi, everybody! I'm a new member. And I had some troubles with my first task, Can anyone help me ?\n I've just finished my task but I can't review and compete this one. I can't even sync timing or click \"start review\". It always display:\nSync Timing\nsynced subtitles: 74 \/ 75\nThanks in advance!","updated_time":"2016-01-29T16:42:00+0000","id":"43410681471_10153270780016472"},{"message":"Hi! Can anybody review this video? It's my first translation task :)\n\n","updated_time":"2016-01-29T09:02:40+0000","id":"43410681471_10153268762931472"},{"message":"Any volunteer for the review from English to Italian? Thank you :-)\n","updated_time":"2016-01-27T20:09:58+0000","id":"43410681471_10153264196111472"},{"message":"Hi everyone,\n\nToday's TEDTalk - Tania Simoncelli: How I took on the gene patent industry -- and won - comes from TEDxAmoskeagMillyard. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/j3vMqRduQmtg\/info\/how-i-took-on-the-gene-patent-industry-and-won\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/8do2CQsfrt05\/info\/how-i-took-on-the-gene-patent-industry-and-won-tania-simoncelli-tedxamoskeagmillyard\/?tab=video","updated_time":"2016-01-27T19:49:40+0000","id":"43410681471_10153267689176472"},{"message":"Talk about TV. Some math, too. Feel free to review !.\n","updated_time":"2016-01-27T14:52:55+0000","id":"43410681471_10153267279736472"},{"message":"Do you feel like translating this great talk? \nEvery body: glamour, dateability, sexuality & disability | Dr. Danielle Sheypuk | TEDxBarnardCollege\nhttp:\/\/www.amara.org\/es\/teams\/ted\/tasks\/…\nStill impressed about the talk of this intelligent, critical and beautiful woman!","updated_time":"2016-01-27T09:46:05+0000","id":"43410681471_10153266953141472"},{"message":"Hey everyone! Could anyone tell me how long does it take to be approved? My application on ted.com has been pending for 3 days now.\nThank you in advance.","updated_time":"2016-01-25T11:01:54+0000","id":"43410681471_10153263098581472"},{"message":"Just finished this one, now I need your help with the review! C'mon!\n(english subtitles translated into italian)","updated_time":"2016-01-24T18:27:03+0000","id":"43410681471_10153262648361472"},{"message":"Hi, everybody! I'm new at TED, so I was wondering if anyone was interested in reviewing my first Spanish translation? Thank you!\n","updated_time":"2016-01-23T14:26:10+0000","id":"43410681471_10153260488871472"},{"message":"Hello,\nI have  a problem entering French subtitles to a video, and can't save or upload my work. My work has been ready for more than a month, and I have asked for additional time. On 19-Dec I have uploaded all the translation and could not save the work or save the text.\n\"Error saving subtitles\" \"Upload failed. The file you uploaded might be invalid or an unsupported format. \"\nSo please I need assistance in terms of converting from word to text or dfxp and finish with posting my work. It is the first time I face this.\nThanks.","updated_time":"2016-01-23T12:58:52+0000","id":"43410681471_10153260364941472"},{"message":"Are there any native english here? I need some help, please","updated_time":"2016-01-22T11:36:07+0000","id":"43410681471_10153252744666472"},{"message":"Hi everyone,\n\nHi team,\n\nThe Wednesday TEDTalk - Oscar Schwartz: Can a computer write poetry? - comes from TEDxYouth\u0040Sydney. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/fEHTvHg9rzLw\/info\/can-a-computer-write-poetry\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/EOGU4yL6z1Ck\/info\/can-a-computer-write-poetry-oscar-schwartz-tedxyouthsydney\/?tab=video","updated_time":"2016-01-21T13:16:15+0000","id":"43410681471_10153257450796472"},{"message":"Hi everyone! Great news: Now you can browse TED-Ed lessons by subtitle language. Check it out: ","updated_time":"2016-01-21T09:00:51+0000","id":"43410681471_10153256480916472"},{"message":"Hi all,\nI´m glad to be part of such a nice group :)\nI´ve just finished my first task from English to Portuguese. Is there any reviewer that would be so kind to check\/approve it for me? I´m not so sure what to do now. I saved the draft, but am not sure if I need to send someone, and how to do it. \n\nThanks a lot in advance.\n\n","updated_time":"2016-01-20T15:37:39+0000","id":"43410681471_10153255217666472"},{"message":"Hiya!\nI´ve just finished my first task from English to Spanish. Is there any reviewer that would be so kind to check\/approve it for me? Thanks a lot in advance","updated_time":"2016-01-20T15:03:11+0000","id":"43410681471_10153254624261472"},{"message":"Hi I am a Chinese Traditional translator. Does anyone know if there is a way to figure out how many times a TED talk has been viewed in a particular language? Is this possible?","updated_time":"2016-01-19T17:08:44+0000","id":"43410681471_10153253231796472"},{"message":"Hi, I am looking for an English to Italian reviewer for The paranoid optimist by Charlie Jane Anders, which I have just subtitled. \n\nCan anyone help please? Thank you!","updated_time":"2016-01-19T15:12:22+0000","id":"43410681471_10153252978501472"},{"message":"Another talk translated from Polish to English.\n","updated_time":"2016-01-19T14:44:40+0000","id":"43410681471_10153252228151472"},{"message":"Hi there,\nI have been trying to change the font of my browser to Nepali but it seems really tough.Can anyone help me out please.","updated_time":"2016-01-19T14:44:35+0000","id":"43410681471_10153252502526472"},{"message":"Quelqu'un aurait-il la gentillesse de relire ma traduction d'un vidéo de l'anglais vers le français ? Je la crois très intéressant sur le traitement des enfants autistes par des méthodes de biofeedback.","updated_time":"2016-01-19T14:44:17+0000","id":"43410681471_10153252712551472"},{"message":"Hi guys, how are you? \nMy name is Sarah Roz . I am a new volunteer in this community and I have finished my first task. I translated in to Arabic language . I'm waiting for someone who review my task . \nThank you.","updated_time":"2016-01-19T14:44:04+0000","id":"43410681471_10153253848131472"},{"message":"This TEDxAmsterdam about the relationship between angst and freedom is extremely relevant for the moment we are living. It is in Dutch, with an excellent English translation that can be the basis for more translations. Any takers? Don't let yourself be put off by the length (21 minutes), the speaker does not speak very fast. Enjoy - this talk is great fun! http:\/\/www.amara.org\/en\/teams\/ted\/tasks\/?team_video=239671","updated_time":"2016-01-19T14:43:47+0000","id":"43410681471_10153249325466472"},{"message":"Hello everbody. Does anyone know what to do when you can no longer hear the audio on the videos in Amara? Who can I report this to?","updated_time":"2016-01-18T14:18:47+0000","id":"43410681471_10153249910651472"},{"message":"Hello and happy new year (a bit late already ?)\nI have a few translation waiting to be approved. Thank you to the LC, who are busy, to have a look whenever they can.\nClaire\n\nhttp:\/\/www.amara.org\/en\/videos\/JJDrTfR8ytdu\/en\nhttp:\/\/www.amara.org\/en\/videos\/XM7dvUP2JvCG\/en\nhttp:\/\/www.amara.org\/en\/videos\/kdpSBjFSlW2c\/en\nhttp:\/\/www.amara.org\/en\/videos\/8UFZtsVT7i5H\/en\nhttp:\/\/www.amara.org\/en\/videos\/6tixArWBjK6p\/en\nhttp:\/\/www.amara.org\/en\/videos\/WBkP7s9EegM8\/en","updated_time":"2016-01-18T09:43:57+0000","id":"43410681471_10153252147696472"},{"message":"Approval needed ! French into English.\nThanks.\n\n","updated_time":"2016-01-15T14:40:46+0000","id":"43410681471_10153247243516472"},{"message":"I completed translation of following video to \"Urdu\", needs review.\nhttp:\/\/www.ted.com\/talks\/lucianne_walkowicz_let_s_not_use_mars_as_a_backup_planet#","updated_time":"2016-01-15T14:40:40+0000","id":"43410681471_10153247300656472"},{"message":"Colleagues, please do have a look at leisure!\nNeeds approval for Russian-English translation.\n","updated_time":"2016-01-14T16:47:27+0000","id":"43410681471_10153239214721472"},{"message":"Hello translators,\n\nToday's TEDTalk - Melvin Russell: I love being a police officer, but we need reform - comes from TEDxMidAtlantic. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/W6aJeJ6hqWf4\/info\/i-love-being-a-police-officer-but-we-need-reform\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/nLm3cKonEKCQ\/info\/i-love-being-a-police-officer-but-we-need-reform-melvin-russell-tedxmidatlantic\/?tab=video","updated_time":"2016-01-12T19:31:54+0000","id":"43410681471_10153242983331472"},{"message":"Can anybody review this for me, please? It's from English to Italian.\n","updated_time":"2016-01-12T17:19:06+0000","id":"43410681471_10153191870106472"},{"message":"I refused this task by mistake, can anybody please reassign it to me?\nhttp:\/\/www.amara.org\/it\/teams\/ted\/tasks\/?team_video=230249","updated_time":"2016-01-12T17:08:44+0000","id":"43410681471_10153242627861472"},{"message":"I created an FB group for the Danish translation team today. Please join, if you are a Danish TED Talk translator. :-D","updated_time":"2016-01-11T13:38:53+0000","id":"43410681471_10153236877276472"},{"message":"Hello, I've translated a very interesting talk about dung beetles ( polish->English). Feel free to review. It's not a long talk.\n","updated_time":"2016-01-11T08:32:22+0000","id":"43410681471_10153239531931472"},{"message":"I am eagerly looking for NEPALESE translators, transcribers, reviewers or language co-ordinators out there.\nThanks\nCheers","updated_time":"2016-01-10T17:41:07+0000","id":"43410681471_10153237061031472"},{"message":"Could someone look at approving this transcript? It has now gone more than two months since Ivan Stamenkovic made the review. It is large interest for making translations for this talk in different languages. The talk has currently 3.4 millions view on you tube.\n","updated_time":"2016-01-10T17:41:02+0000","id":"43410681471_10153239072236472"},{"message":"Thanks sister for adding me I do appreciate that","updated_time":"2016-01-08T17:34:38+0000","id":"43410681471_10153235466376472"},{"message":"Dear translators,\n\nToday's Talk of the day - David Sedlak: 4 ways we can avoid a catastrophic drought - comes from TEDxMarin. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/CadocghQkw2X\/info\/4-ways-we-can-avoid-a-catastrophic-drought\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/2qCr6uNGquIY\/info\/the-water-crisis-how-california-overcomes-the-drought-david-sedlak-tedxmarin\/\n\nEnjoy the talk!","updated_time":"2016-01-07T19:27:55+0000","id":"43410681471_10153233877496472"},{"message":"Hi everyone, if you're looking for a nice TEDx talk to translate, I strongly recommend this beautiful piece from TEDxCapeTown","updated_time":"2016-01-07T12:36:05+0000","id":"43410681471_10153233243236472"},{"message":"Happy new year!\n\nA couple more questions for this talk are bothering my translation team and we'd appreciate help from native & near-native speakers of English:\n\n1. What does \"the average sensual man\" mean in the excerpt below? \n\"...and the author of the Beveridge Report, had little faith in what they called the average sensual or emotional man. Instead, they trusted this idea of the impersonal system and the bureaucrat who would be detached\nand work in this system.\"\n\nThe phrase \"had little faith in the average sensual (or emotional) man\" seems to be an expression taken from a book. \n\n2. \"So some years ago, wanting to understand this problem, I started to work with a group of about 60 older people in South London, where I live.\"\n\nBy \"60 older people\", does she mean \"60 elderly people\" or \"people over 60 years old\"? \n\nThanks a million!\n\n","updated_time":"2016-01-07T12:32:55+0000","id":"43410681471_10153231909286472"},{"message":"Hi everybody,\n\nI watched a video on TEDx and I would like to translate it, I have an account on Amara, but this video does not appear there, What can I do?","updated_time":"2016-01-06T22:22:42+0000","id":"43410681471_10153225737496472"},{"message":"Hello, everyone. \nI'm extremely excited to be part of the team!\nSo, my first project is pending review - could an English LC approve it? It's from PT to ENG. Thanks a bunch. (:\n\n","updated_time":"2016-01-06T19:47:57+0000","id":"43410681471_10153232139356472"},{"message":"Hi! \nThank you, Krystian Aparta, for adding me☺.","updated_time":"2016-01-06T13:54:57+0000","id":"43410681471_10153231743476472"},{"message":"Hi ! I am looking for an English LC to approve those translations from Pt,Br :\nhttp:\/\/www.amara.org\/pt\/videos\/1W8jIYYBuDJT\/info\/esporte-e-transformacao-jose-luis-vieira-ventura-tedxlacador\/\n\nhttp:\/\/www.amara.org\/pt\/videos\/bFDshjFA8dxs\/info\/o-mito-do-cientificamente-comprovado-beatriz-bohrer-do-amaral-tedxlacador\/\n\nThis last one in fact is a transcription, but the notes were written in PT,Br so the task  would be easier for somebody who understand Portuguese, but I can answer any question about it to anybody who doesn't understand their meaning.\n","updated_time":"2016-01-06T09:18:33+0000","id":"43410681471_10153231495406472"},{"updated_time":"2016-01-06T09:18:31+0000","id":"43410681471_10153230917306472"},{"message":"Dear translators,\n\nToday's TEDTalk - Sebastian Wernicke: How to use data to make a hit TV show - comes from TEDxCambridge. Both videos are available for translation:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/GuoHBCZx61am\/info\/how-to-use-data-to-make-a-hit-tv-show\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/Kh9VC7GYqYkR\/info\/how-to-use-data-to-make-a-hit-tv-show-sebastian-wernicke-tedxcambridge\/","updated_time":"2016-01-05T16:37:28+0000","id":"43410681471_10153230330306472"},{"message":"Hi,everyone!I've already translated this video from English to Russian.Can anyone review it , please?","updated_time":"2016-01-05T07:45:44+0000","id":"43410681471_10153197033776472"},{"message":"Amara editor will not let me change the reference language. Is this a bug or should I change some settings somewhere?\nI click on \"English\" in drop-down menu but nothing happens.\nBrowser: Chromium.\nOS: Ubuntu.","updated_time":"2016-01-04T10:02:46+0000","id":"43410681471_10153216064616472"},{"message":"Should we do the same thing twice?\n\nI found Melissa Fleming's great talk in both TEDTalk and TEDxTalk categories. One is translated and other is in work in Korean.\n\n1. TEDTalk : https:\/\/s3.amazonaws.com\/ted.conferences\/talk\/transcript\/2015X\/None\/MelissaFleming_2015X-transcript.mp4\n\n2. TEDxTalk : http:\/\/www.youtube.com\/watch?v=c00zfzk4gdg\n\nI want to know your opinion.\nI think TED could have edited the original TEDx link into TED page link so there's no need to have two same versions.","updated_time":"2016-01-04T09:32:21+0000","id":"43410681471_10153195338956472"},{"message":"Hi everyone,\n\nToday's Talk of the day - Alison Killing: What happens when a city runs out of room for its dead - comes from TEDxGroningen. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/gE7gz9iucWPq\/info\/what-happens-when-a-city-runs-out-of-room-for-its-dead\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/qRF3hjNFEeZx\/info\/what-happens-when-a-city-runs-out-of-room-for-its-dead-alison-killing-tedxgroningen\/","updated_time":"2016-01-04T09:32:13+0000","id":"43410681471_10153193413606472"},{"message":"This is my first baby that needs to be reviewed (spanish to english). It's a short video and it would make my x-mas\/navidad if someone could give me feedback\/review. Thanks amigos!\n\n","updated_time":"2016-01-04T09:30:26+0000","id":"43410681471_10153192954881472"},{"message":"Hi all! We have some exciting news: For the first time ever, TED is coming to cinemas worldwide! Audiences from around the globe will have the unique opportunity to experience the “opening night” of TED’s legendary annual conference in select cinemas. Check www.tedtalksincinemas.com to find out which cinemas in your region will feature this extraordinary screening event, and get your tickets as long as they're still available!","updated_time":"2016-01-04T09:29:51+0000","id":"43410681471_10153189881616472"},{"message":"Hi everyone!\nI reviewed this transcription, the original language is English. It would be great if someone could approve it!\nThanks in advance!\n","updated_time":"2016-01-04T09:29:46+0000","id":"43410681471_10153205947956472"},{"message":"Hi everyone,\n\nToday's talk - Robert Waldinger: What makes a good life? Lessons from the longest study on happiness - comes from TEDxBeaconStreet. Both videos are available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/VC7ixlHkZqo3\/info\/what-makes-a-good-life-lessons-from-the-longest-study-on-happiness\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/B3SaZVyN4PyQ\/info\/what-makes-a-good-life-lessons-from-the-longest-study-on-happiness-robert-waldinger-tedxbeaconstreet\/?tab=video\n\nEnjoy the talk.\nHappy holidays!","updated_time":"2016-01-04T09:29:46+0000","id":"43410681471_10153207452611472"},{"message":"Hi everyone,\nI translated this video from french to english few months ago. \nIt still needs to be reviewed. It would be great if someone can handle the task.\nMerry xmas you all.","updated_time":"2016-01-04T09:29:36+0000","id":"43410681471_10153208219321472"},{"message":"Hi, I transcribed Simon Anholt's TEDx video about a month ago. It would be great if someone could review my English transcript so that the video can be made available for translations. Thanks!","updated_time":"2016-01-04T09:29:33+0000","id":"43410681471_10153200727236472"},{"message":"Hello, I've completed the translation (Polish->English). Feel free to review\n","updated_time":"2016-01-04T09:29:16+0000","id":"43410681471_10153212760941472"},{"message":"Hello Translators and Subscribers! \nPlease be informed that during Christmas Holidays, from Dec 24, 2015 to Jan 3, 2015 we will be slow to respond to emails and Facebook and Amara messages. Mark your email or message as [URGENT] if you need immediate help during this time.\n\nTo those of you who are celebrating Christmas and New Year, I wish you Love, Happiness, Joy, and Peace. 🎄🎅🎁","updated_time":"2016-01-04T09:29:10+0000","id":"43410681471_10153205693311472"},{"message":"Hey guys i have a regarding approvals.\nI have a video with English subtitles already done and it says it is waiting for approval. Anyone knows how can I get it approved?","updated_time":"2016-01-04T09:29:06+0000","id":"43410681471_10153221837586472"},{"message":"Hey everyone,\nI can open any other website but not Amara, is it just me or is there something wrong with the site?","updated_time":"2016-01-04T09:29:01+0000","id":"43410681471_10153220082801472"},{"message":"Some recommendations for the ROMANIAN TRANSLATORS: \nAm observat ca mute traduceri, suna foarte fortat si pretentios, e necesar ca fiecare traducator sa stie ca ei traduc si ADAPTEAZA, la limba romana, traducerea cuvant cu cuvant, nu inseamna neaparat ca e o traducere CORECTA, Traducerea trebuie sa fie adaptata la limbajul in limba romana, trebuie sa curga in mod natural. Nu ma refer in mod special la idioms. Va dau un exemplu de un idiom: \" Ball is in your court\" care cuvant cu cuvant tradus inseamna: mingea e in curtea ta. Bineintels ca fiecare stie ce inseamna in idiom si nimeni nu va traduce fraza aceasta folosind cuvandul \"mingea\" sau \"curte\". Autorul nu a descris un joc cu mingea in curte. De aceea e necesar sa nu traduceti cuvant cu cuvant, ci sa adaptati traducerea si traducereea corecta este: \"E randul tau acum sa hotarasti ce vrei sa faci\" sau: depinde de tine. Insa, sunt cazuri cand aveti de traduc o fraza care nu e un idiom, insa fraza care va da de furca, trebuie tratata ca un idiom si adaptata la limba romana. Cateva sfaturi: evitati infinitivul. Nu suna natural, si ia si mult spatiu. Il puteti inlocui cu conjuctiv. De asemena, nu lasati prepozitii la capat de rand. E foarte important sa cititi cu voce tare ce ati traus si daca suna fortat sau pretentios, aveti libertatea sa inlocuiti si sa adaptati textul, atata timp cat pastrati idea autorului, si nu deviati de la subiect. Daca aveti cea mai mica banuiala ca autotul foloseste un idiom sau nu sunteti siguri, folositi google si aflati daca fraza respectiva e in lista de idioms sau cereti ajutor, aici. Sper ca am fost de folos. va urez mult succes si astept feedback. :-)","updated_time":"2016-01-04T09:28:55+0000","id":"43410681471_10153214420201472"},{"message":"Hello, everyone! I have finished transcribe of a TED talk \"Quantified Cities: Big Data and Big Design\". This talk gives thoughtful insights on how we should balance the benefit of different communities in this big data era from the view point of a designer.\nPlease review the transcription if you are interested or are free. It is really appreciated that it can be available for translation. \nps. Happy new year!\n","updated_time":"2016-01-04T09:28:38+0000","id":"43410681471_10153218184546472"},{"message":"A nice talk worth translating. Only 6:39 minutes long.\nYou will relate if you are a new mother.","updated_time":"2016-01-04T09:28:33+0000","id":"43410681471_10153162724976472"},{"message":"Amara website is not working right now. The engineers are working to get things back up, and we will let you know once we know more.\nEDIT: Amara is back on! :)","updated_time":"2016-01-04T09:28:30+0000","id":"43410681471_10153220095776472"},{"message":"Happy new year! สวัสดีปีใหม่ from Thailand :)","updated_time":"2016-01-04T09:28:11+0000","id":"43410681471_10153221972926472"},{"message":"Hi, LC's!\nI've just reviewed the translation from Portuguese, Brazilian to English, of this little video. Is there anybody able to approve it?\n\nhttp:\/\/www.amara.org\/pt\/videos\/1W8jIYYBuDJT\/info\/esporte-e-transformacao-jose-luis-vieira-ventura-tedxlacador\/\n\nThanks!","updated_time":"2016-01-04T09:27:59+0000","id":"43410681471_10153227621251472"},{"message":"Thanks to Claire this TEDxTalk have been reviewed.\nNow it needs approval. Anyone awesome here ?","updated_time":"2015-12-26T17:04:54+0000","id":"43410681471_10153212484186472"},{"message":"If you speak Hindi, Bengali, Telugu, Marathi, Tamil, Gujarati, Kannada, Malayalam or Punjabi, you may be interested in Google's second Translateathon in India!\n","updated_time":"2015-12-24T09:50:44+0000","id":"43410681471_10153208432986472"},{"message":"Another development in translation of video, based on edited automatic translation and synthetic voice technology. Interesting!\nhttp:\/\/www.bbc.co.uk\/mediacentre\/latestnews\/2015\/bbc-virtual-voiceover-translations\nSee the video here https:\/\/www.youtube.com\/watch?v=YoEZqNuwX5U","updated_time":"2015-12-20T18:16:00+0000","id":"43410681471_10153196108961472"},{"message":"Hello! A few months ago I translated my second talk - which still needs review. Now that I have translated other talks I can see that I didn't break lines properly in this 2nd talk. Is it possible for me to edit the subtitles to improve them before the review? I could not find any OTP page dealing with that process.","updated_time":"2015-12-20T18:15:56+0000","id":"43410681471_10153197880701472"},{"message":"Hi everyone! \nI'm Martina, I study translation at university and a while ago I translated my first TED-ed ever from English to Italian, but nobody has reviewed it yet. It would mean the world to me if someone could do it and give me some feedback.\nThanks :)\n\n","updated_time":"2015-12-20T18:15:53+0000","id":"43410681471_10153188345796472"},{"message":"Dear all, \nI proudly introduce to you the new OTP transcribers and translators community built among TEDxValladolid and TEDxYouthValladolid audience after our 4th\/3rd editions last Sept\/Nov where I showed the OTP transcription video and did a call to action to the audience. \nThe result... 10 people as OTP community, 10 transcribers and 2 of them translators.\nLast saturday we had the real 2015 marathon. We spent 7 hours together sharing work, knowledge, tips and jokes. Really great and fun!!\nThank you so much Ivana Korom for your support :)\nHere we are...","updated_time":"2015-12-20T18:15:51+0000","id":"43410681471_10153194972076472"},{"message":"Another translator has reviewed my TED-ED talk, which I translated to Chinese Simplified,but the talk has pending on Amara for 2 weeks for approval, it seems that no one is approving my TED-ED talk,any one who knows when the talk would be finished approving?\n\nhttp:\/\/www.amara.org\/zh-cn\/videos\/9vjT7scG0MgB\/info\/do-animals-have-language-michele-bishop\/","updated_time":"2015-12-15T13:45:58+0000","id":"43410681471_10153186429251472"},{"message":"Hello, I have completed the translation for this talk ( from Polish to English). Could anybody please review it ?\n","updated_time":"2015-12-14T17:47:30+0000","id":"43410681471_10153183152696472"},{"message":"I have a question about syncing. I take great care in syncing the subtitle exactly at the start of the speech, in my view it enhances the overall experience of watching the video.\nNow, I've noticed that with TEDx talks, playing on Youtube, the sync is exactly as in the Amara editor. With TEDTalks though, playing in the proprietary TED environment, the sync seems to get shifted forward by what looks to be about 0.3 seconds, it's clearly noticeable. So, instead of the sharp cut audio-visual as it was created in the Amara editor, you get this weird feeling of precognition on the TED platform after publishing. Anything I can do about this?","updated_time":"2015-12-14T15:15:04+0000","id":"43410681471_10153129303086472"},{"message":"Hello, \n\nI've finished translating the TEDx Talk: \"A ilusão da aparência\" | Sara Ortins | TEDxFCTUNL from Portuguese to English. In this TEDx Talk, Sara, who has a precarious health condition, warns us for the fact that a normal, healthy appearance, can deceive our look and hide serious health problems that aren't revealed to strangers, by feelings of shame from who have them. It's a lesson of life and a wake up call for a more sensitive, compassionate and emphatic attitude from us to the Other apparently equal. \n\nSo, because I think it's a TedTalk worth sharing, I'm contacting you to know if someone is willing to review my translation.","updated_time":"2015-12-13T10:39:20+0000","id":"43410681471_10153187150981472"},{"updated_time":"2015-12-13T10:39:09+0000","id":"43410681471_10153122066131472"},{"message":"Dear TED translators,\n\nHi! My name is Feifei. I'm new here, and i've just finished my very first translation from English into Chinese(simplified). Is anyone available to review this video? Many many thanks in advance!\n\n","updated_time":"2015-12-13T10:38:55+0000","id":"43410681471_10153129877671472"},{"message":"Hi everone! Can some English native speaker help me understand what \"own it!\" means? Is it like an exhortation? is it another way of saying \"You can do that?\"\n\nI'm working at that translation. The speaker says the best advice in her life was when her friend told her \"own it\". min 1:40\nhttps:\/\/www.youtube.com\/watch?v=fw30yjccnD4\n\nThanks","updated_time":"2015-12-13T10:38:35+0000","id":"43410681471_10153133938361472"},{"message":"Hi guys! I have just uploaded my Italian subtitles for a video but and noticed there's a mistake in the description below the video. How can I modify them before the review?\nThanks :)","updated_time":"2015-12-13T10:38:31+0000","id":"43410681471_10153141960601472"},{"message":"Hello everyone! can anyone review my video?\nIt is from English to Chinese(Simplified).\nHow can music technology change lives? | Matan Berkowitz | TEDxJerusalem\nhttp:\/\/www.amara.org\/zh-cn\/videos\/qY7HMq936KCk\/info\/how-can-music-technology-change-lives-matan-berkowitz-tedxjerusalem\/\n\nThanks!","updated_time":"2015-12-13T10:38:28+0000","id":"43410681471_10153145877686472"},{"message":"Hi everybody :) I am already on board! Very happy and excited to join the project!","updated_time":"2015-12-13T10:38:25+0000","id":"43410681471_10153142161246472"},{"message":"Thanks to all the volunteer translators who have helped with the second batch of translations on Michael Green's talk on the new UN Global Goals! \n\nhttp:\/\/www.ted.com\/talks\/michael_green_how_we_can_make_the_world_a_better_place_by_2030\n\nBulgarian translation by Peter Petrov, reviewed by Radost Tsvetkova\n\nJapanese translation by Kazunori Akashi, reviewed by Misaki Sato  \n\nLithuanian translation by Agnė Baltrūnaitė, reviewed by Sigita Šimkutė-Macanko. \n\nGreek translation by petrina georgousi, reviewed by Aphrodite Constantinou. \n\nRussian translation by Anna Andreeva, reviewed by Anna Kotova \n\n-->If anyone can review the Portuguese Brazilian or advance the Spanish, the global team at the Social Progress Imperative would be very, very grateful.\u003C--\n\nhttp:\/\/amara.org\/en\/videos\/NHde2fOeLTBg\/info\/how-we-can-make-the-world-a-better-place-by-2030\/","updated_time":"2015-12-13T10:38:22+0000","id":"43410681471_10153149470946472"},{"message":"I am unable to sign-in nor reset my password with amara. I keep getting this message every time:\"Please enter a correct username and password. Note that both fields are case-sensitive.\" I am rechecking but it doesnwt help","updated_time":"2015-12-13T10:38:19+0000","id":"43410681471_10153148894371472"},{"message":"Hi there! Could some native speakers of English help me with this?\n\nI'm translating this talk, and at 0:43 she goes:\n\"Another son, Ryan, is keeping up this constant stream of abuse from the kitchen,\"\n\"and the dogs are locked behind the bedroom door and straining.\"\n\nI understand \"strain\" can mean a few different things but can't decide myself. What is she most likely meaning by \"straining\" here?\n\nMany thanks for your help!","updated_time":"2015-12-13T10:38:16+0000","id":"43410681471_10153146354411472"},{"message":"That is exactly the difference between machine and human translation.","updated_time":"2015-12-13T10:38:11+0000","id":"43410681471_10153150173251472"},{"message":"I did the review on this English spoken talk, and could not help but think how helpful it could be for Thais. Could someone in the Thai community pick up the Thai translation? Thank you!","updated_time":"2015-12-13T10:38:08+0000","id":"43410681471_10153155928291472"},{"message":"Hi translators,\n\nThe name of the Project “Best of TEDxTalks” in Amara has recently been changed into “English translation needed (TEDx)”.\n\nThe new title in a better and clearer way describes the goal of this project: it contains talks recommended by you, the TEDx organizers, or the local audiences; talks that our editorial and review teams would love to watch with English subtitles and consider them for further distribution.\n\nStart working on these talks if you have time and free tasks: they need your help in every step (transcript, translation, review).\n\nIf you know of other great talks that we should know about, in any language, let us know!","updated_time":"2015-12-13T10:38:05+0000","id":"43410681471_10153149152211472"},{"message":"Hi, guys! We wanted to let you know that the TED.com player has just been upgraded with a few new keyboard-control features: hit Space to pause\/play, the up \/ down arrow keys to control the volume, and Shift+down arrow to mute the audio. Plus, the right \/ left arrow keys skip 15 seconds forward and back.","updated_time":"2015-12-13T10:38:03+0000","id":"43410681471_10153157524471472"},{"message":"Hi!\nGreat things you are doing around here you guys, I am thrilled to start translating ENG-SPA and viceversa. I will follow the welcome email instructions...Any suggestion for a quick and effective start?","updated_time":"2015-12-13T10:38:00+0000","id":"43410681471_10153162450531472"},{"message":"Hi, I have several questions about translating on Amara. I have only started translating TED talks. I don't think I finished the video before the due date as I can't see the video on my Dashboard anymore. My questions are:\n\n1. Where is this video now? Is it still accessible from my dashboard?\n2. What happened to the translations I made? Is it forwarded to the language coordinator in its incomplete state? Or cause I didn't finish it in time, none of the translations were accepted, therefore it means my efforts are worthless now?\n\nThank you!","updated_time":"2015-12-13T10:37:56+0000","id":"43410681471_10153165184266472"},{"message":"Hello translators,\n\nTodays TEDTalk of the day - Jessica Shortall: How America fails new parents -- and their babies - comes from TEDxSMU. Both videos are available for translation on Amara.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/XV96CcAp45dW\/info\/how-america-fails-new-parents-and-their-babies\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/UJYmpstKMAl1\/info\/how-america-fails-new-parents-and-their-babies-jessica-shortall-tedxsmu\/?tab=video","updated_time":"2015-12-13T10:37:46+0000","id":"43410681471_10153171339486472"},{"message":"Dear TED translators & LCs,\nBelow are Amara links to TEDxKFAS lectures, which was held in Seoul, Korea on August 7.\nThey are still waiting for reviews and final approvals from the LCs.\nWe would much appreciate it if you would take some time to review the English subtitles! =)\n\n\"Needs Approval\"\n\n- An amazing talk on social entrepreneurship!\nhttp:\/\/www.amara.org\/ko\/videos\/Am1992AVbDG2\/info\/the-most-effective-way-to-better-society-jung-hyeon-kim-tedxkfas\/\n\n\"Needs Review\"\n\n- Great talks on the future of China\nhttp:\/\/www.amara.org\/ko\/videos\/toR49JXhdHJq\/info\/future-china-a-peaceful-power-yunling-zhang-tedxkfas\/\n\nhttp:\/\/www.amara.org\/ko\/videos\/DknAqQWFfWRD\/info\/can-china-connect-the-world-by-high-speed-rail-gerald-chan-tedxkfas\/\n\nhttp:\/\/www.amara.org\/ko\/videos\/STHiaRAi6pDh\/info\/2025-charting-chinas-future-jae-ho-chung-tedxkfas\/\n\nThank you so much!\n\nSincerely,\nTEDxKFAS team","updated_time":"2015-12-13T10:37:42+0000","id":"43410681471_10153172101041472"},{"message":"The content of the EU terminology database now available for free and for any use. Download from here: http:\/\/termcoord.eu\/iate\/download-iate-tbx\/ the content of IATE in the 24 languages of the EU","updated_time":"2015-12-13T10:37:38+0000","id":"43410681471_10153165207461472"},{"message":"Hi all, \nI'm working on a video, the task to translate is available and there is almost no activity on it. ..but I can already see translated subtitles over the vid (via CC settings) that have credits to people I can't find in our member list. \n\nDoes anyone know what happened? Is there another organization translating these videos? I'm fine with using their translation instead of doing it; the few lines I saw look good, but I don't know who they are or why they translated it and how it got attached to the vid if not via the TED group. o.o \n\nWhat do I do?   =o\n\nP.S. this is the video: ピラミッド・クエスト | 河江 肖剰 | TEDxKyoto","updated_time":"2015-12-13T10:37:35+0000","id":"43410681471_10153119357501472"},{"message":"Hi there,\nI finished the transcription of this talk. Is there anyone available to review the subtitles? \nThanks!\n","updated_time":"2015-12-13T10:37:32+0000","id":"43410681471_10153173876296472"},{"message":"Dear translators,\n\nTEDTalk of Friday was discovered through the great work of the OTP!\nGuillaume Néry, in his TEDxToulouse talk \"The exhilarating peace of freediving\", takes us into the ocean's depths as he explains the physical and emotional impact of water pressure, silence and holding your breath.\n\nBoth videos are available for translation on Amara.\nEnjoy this beautiful talk!\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/kq1F03sXrBak\/info\/guillaume-nery-speaks-at-tedxtoulouse\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/ukv3EGp6b8Ek\/info\/voyage-entre-deux-inspirations-guillaume-nery-a-tedxtoulouse\/?tab=video","updated_time":"2015-12-13T10:37:29+0000","id":"43410681471_10153176216691472"},{"message":"Hi! I finished translating this amazing talk about hidden prisons to Catalan, somebody available to review?\n\n","updated_time":"2015-12-13T10:37:26+0000","id":"43410681471_10153173037651472"},{"message":"Hi! I 'm new here and I would like to contact the group coordinator for Italian but I cannot find their Facebook page. I think I have found one but the link doesn't work...Can someone help me? Thanks! :)","updated_time":"2015-12-13T10:37:20+0000","id":"43410681471_10153172771081472"},{"story":"Lidia Cámara shared ProZ.com's photo to the group: I Translate TEDTalks.","updated_time":"2015-12-13T10:37:15+0000","id":"43410681471_10153181898861472"},{"message":"Hello I have completed the translation for this talk (from Polish to English). Could anybody please review it?\n","updated_time":"2015-12-13T10:37:11+0000","id":"43410681471_10153183154221472"},{"message":"Hi,I am from Myanmar.Our country need to translate more.So I would like to translate as I can.","updated_time":"2015-12-13T10:37:05+0000","id":"43410681471_10153180380756472"},{"message":"Hi all, \nI translated this talk about Mari Katayama's entry into the world of art after being bullied and feeling unable to communicate herself. \nIs anyone available to review it? \nThanks!","updated_time":"2015-12-07T10:14:14+0000","id":"43410681471_10153178755301472"},{"message":"I would like to request a review for my Japanese > English translation. \nDo I make these requests on the Japanese language page or is there an English language group? \n\nThis is the video: \n","updated_time":"2015-12-03T08:56:05+0000","id":"43410681471_10153172046511472"},{"message":"Hi, I am excited to be on board, and can translate English TED talks into French. Not sure how to proceed....","updated_time":"2015-11-26T12:39:17+0000","id":"43410681471_10153161228186472"},{"message":"I am a noob at translating. I would like to know the step by step process to help translate from English to Chinese.","updated_time":"2015-11-23T08:42:10+0000","id":"43410681471_10153153873391472"},{"story":"Gaurav Gupta shared Tedxwalledcity's event to the group: I Translate TEDTalks.","updated_time":"2015-11-19T09:37:39+0000","id":"43410681471_10153151342241472"},{"message":"Hi everyone! :)\nI've just joined the project and I'm very excited to be on board!","updated_time":"2015-11-17T12:49:06+0000","id":"43410681471_10153148823666472"},{"message":"Thanks to all the awesome volunteers who have helped translate our TED Talk on the Global Goals into so many languages and helped us achieve 500K views!\n\nhttp:\/\/amara.org\/en\/videos\/NHde2fOeLTBg\/info\/how-we-can-make-the-world-a-better-place-by-2030\/\n\nCroatian translation by Sanja Župan, reviewed by Ivan Stamenkovic.\n\nDutch translation by Peter Van de Ven, reviewed by Axel Saffran.  \n\nKorean translation by Youhan Kim, reviewed by Jihyeon J. Kim.  \n\nPersian translation by Niloufar Khodadoost, reviewed by Amin Rasoul'of.  \n\nSerbian translation by Milenka Okuka, reviewed by Mile Živković. \n\nUkrainian translation by Alina Kozoriz, reviewed by Hanna Leliv.  \n\n-->Vietnamese, Greek and Chinese Simplified are waiting for approvals - and we would be very grateful to anyone who could advance the Spanish version!\u003C--","updated_time":"2015-11-11T22:26:01+0000","id":"43410681471_10153129820811472"},{"message":"Hey, translators,\n\nToday's TEDTalk of the day - Andreas Ekström: The moral bias behind your search results - comes from TEDxOslo. Both versions of the video are available for translation on Amara:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/A1waot51I0mg\/info\/the-moral-bias-behind-your-search-results\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/K6sUc2RNwBGV\/info\/the-moral-bias-behind-your-search-results-andreas-ekstrom-tedxoslo\/?tab=video","updated_time":"2015-11-10T17:18:44+0000","id":"43410681471_10153139657246472"},{"message":"Hi, I've just provided this nice video with Italian subtitles: If someone wants to review it, please, do it :)","updated_time":"2015-11-09T18:28:35+0000","id":"43410681471_10153138394976472"},{"message":"Dear everyone , I have submitted one of my translation into my local language Burmese and whilst it was waiting for reviewed , it was edited some what in Japanese . What should I do . The talk is Cesar Hanada's How I teach kids to love science.","updated_time":"2015-11-09T12:47:20+0000","id":"43410681471_10153136512251472"},{"updated_time":"2015-11-09T08:19:53+0000","id":"43410681471_10153133654401472"},{"updated_time":"2015-11-09T08:19:44+0000","id":"43410681471_10153133660631472"},{"message":"Translations on going in 12 different languages of this great Ted Ed\n","updated_time":"2015-11-07T17:02:34+0000","id":"43410681471_10153135367051472"},{"message":"Dear translators,\n\nTwo TEDTalks from last week come from TEDx events, and both versions of each video are available for translation:\n\nVijay Kumar: The future of flying robots, from TEDxPenn\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/OGsc3ZuMNeEQ\/info\/the-future-of-flying-robots\/?tab=video\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/begolHF3UOfJ\/info\/the-future-of-flying-robots-vijay-kumar-tedxpenn\/?tab=video\n(original is longer, different edit)\n\nAlyson McGregor: Why medicine often has dangerous side effects for women, from TEDxProvidence\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/mLS0rbxzFqFH\/info\/why-medicine-often-has-dangerous-side-effects-for-women\/?tab=video\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/5s3Bs94xBO37\/info\/why-medicine-often-has-dangerous-side-effects-for-women-alyson-mcgregor-tedxprovidence\/?tab=video\n(original is slightly longer, same transcript)","updated_time":"2015-11-06T12:44:46+0000","id":"43410681471_10153108321916472"},{"message":"The latest OTP Learning Series tutorial just premiered on YouTube! It's entitled \"How to tackle reading-speed issues,\" and provides some very useful strategies that should help you deal with subtitles going over the reading-speed limit in your translations. You'll find the YouTube and Amara links below.\n\nhttps:\/\/youtu.be\/QVz0XyEAbHU\nhttp:\/\/amara.org\/en\/videos\/MVgIgNCU9zZQ\/info\/otp-learning-series-08-how-to-tackle-reading-speed-issues\/","updated_time":"2015-11-06T10:53:02+0000","id":"43410681471_10153132271596472"},{"message":"Bonjour, Hello !\ntwo of the videos I've worked on have been waiting for approval for over a month. Can anyone help ? \nThe two videos in question are :\n - the French version of this video : https:\/\/www.ted.com\/talks\/laura_schulz_the_surprisingly_logical_minds_of_babies\n - the French version of this one : https:\/\/www.ted.com\/talks\/fred_jansen_how_to_land_on_a_comet\n\nThanks a lot for your help guys ! :)","updated_time":"2015-11-06T02:18:49+0000","id":"43410681471_10153131067691472"},{"message":"Dear translators,\n\nTodays TEDTalk of the day - Melissa Fleming: A boat carrying 500 refugees sunk at sea. The story of two survivors - comes from TEDxThessaloniki.\n\nBoth versions of the video are available for translation on Amara.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/LPNT8hrrewy9\/info\/a-boat-carrying-500-refugees-sunk-at-sea-the-story-of-two-survivors\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/tpN4kNH2qOkp\/info\/a-boat-carrying-500-refugees-sunk-at-sea-the-story-of-two-survivors-melissa-fleming-tedxthessaloniki\/","updated_time":"2015-11-03T21:29:14+0000","id":"43410681471_10153129802961472"},{"message":"http:\/\/amara.org\/en\/videos\/dMd4kftBuDdq\/info\/take-off-your-heels-and-put-on-your-gas-mask-erinc-ermin-tedxiemadrid\/\n\nHi, I've just finished my first translation from English into Italian: who wants to review it? Many thanks in advance :)","updated_time":"2015-11-01T11:44:00+0000","id":"43410681471_10153125222356472"},{"message":"Hi guys, I translated some subtitles from English into Italian. What Comes Next?  I'm new here and I don't know how the program works. Can someone explain It to me,please? My subtitles need review. What does It Mean? Who is allowed to review them? And then Who will  approve them? How Long It Takes? Who owns the translation \"copyright\": me or the reviewer?  Thanks","updated_time":"2015-10-30T02:06:56+0000","id":"43410681471_10153118292606472"},{"message":"मेरा हिंदी अनुवाद  परीक्षण करे","updated_time":"2015-10-28T09:51:31+0000","id":"43410681471_10153120278141472"},{"message":"translated in marathi","updated_time":"2015-10-27T14:22:16+0000","id":"43410681471_10153119239751472"},{"message":"Hello! I just finished the English subtitles of this interesting video about a social enterprise in Sri Lanka, \n\nCan someone reviewed it? I just realized I made a mistake in one of the names of the social enterprise she talks about. It's \"Bunker Roy Barefoot College\"","updated_time":"2015-10-25T10:11:30+0000","id":"43410681471_10153114919536472"},{"message":"Dear translators,\n\nToday's TEDTalk of the day - Tom Uglow: An Internet without screens might look like this - comes from TEDxSydney. Both videos available for translation.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/mkw7o2xtrgWx\/info\/an-internet-without-screens-might-look-like-this\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/asi2NtjLigyC\/info\/an-internet-without-screens-might-look-like-this-tom-uglow-tedxsydney\/","updated_time":"2015-10-23T14:56:15+0000","id":"43410681471_10153112314426472"},{"message":"I am most intrigued :) Waiting for the transcript to be done","updated_time":"2015-10-23T10:53:06+0000","id":"43410681471_10153113298651472"},{"message":"Good morning everybody, I really hope someone in this group can help me with my problem....\nI am using FAB Subtitler for the first time for real. how do you merge all the 20-lines files into one big .stl file to deliver? or do you just deliver all small files?\nthank you so much for your help!!!","updated_time":"2015-10-23T07:32:48+0000","id":"43410681471_10153113147841472"},{"message":"Hi, another question for the Italian translators: at 3:00:97 how do you translate (cheers)? I found the noun \"acclamazioni\" but I don't like it at all. :\/","updated_time":"2015-10-23T04:49:12+0000","id":"43410681471_10153108529556472"},{"updated_time":"2015-10-22T08:10:41+0000","id":"43410681471_10153111780496472"},{"updated_time":"2015-10-22T08:04:04+0000","id":"43410681471_10153110324801472"},{"message":"Hi everyone, I'm wondering whether or not I should leave out words such as \"sort of\", \"kind of\", \"like\",... which appear more in speaking rather than in writing. Because the speaker uses those a lot, and it makes the script a little fragmentary.\nPlease give me some advice. \nThanks a lot.","updated_time":"2015-10-20T14:33:24+0000","id":"43410681471_10153104887636472"},{"message":"Please sign!","updated_time":"2015-10-20T13:14:42+0000","id":"43410681471_10153108608991472"},{"message":"Hello, I need someone to review the Arabic transcription of this video. \n\nThanks :D","updated_time":"2015-10-20T07:12:00+0000","id":"43410681471_10153108671981472"},{"message":"Hello, guys!\nAfter the video has been reviewed, how much time does it take to be approved?","updated_time":"2015-10-19T12:16:38+0000","id":"43410681471_10153088539696472"},{"message":"Hello all! \nI just started translating TEDTalks this week, and I have noob questions... \n\nDo we translate the description? ( I assume yes, but assuming is bad) \nWhen we translate the description, do we keep the tone of the original or make it appealing to our target language audience? Maybe by adding text. \n\nThanks!","updated_time":"2015-10-19T10:46:31+0000","id":"43410681471_10153088843736472"},{"message":"Hi everyone!\nSome time ago I translated a talk from German into Polish and English. Althrough Polish subs were reviewed and published, they are missing on YT. What can I do about it?\nhttp:\/\/amara.org\/en\/videos\/fV4tIKh9VBt0\/info\/tolerant-genug-gregor-eistert-tedxsalzburg\/\nhttps:\/\/www.youtube.com\/watch?language=pl&v=UhOlDWx4h3M","updated_time":"2015-10-18T09:18:49+0000","id":"43410681471_10153106318396472"},{"message":"Thank you for approving request","updated_time":"2015-10-16T15:22:27+0000","id":"43410681471_10153103723556472"},{"message":"Hi. Could anyone review English subtitles, please? Afterwards i want to continue to translate into Russian. Thank you in advance.\n","updated_time":"2015-10-16T14:39:28+0000","id":"43410681471_10153103490436472"},{"message":"Bill Gates has tweeted about it. Steve Case has tweeted about it. Global Citizen has embedded it on their website. Michael Green's second TED Talk on how the world can achieve the Global Goals has been viewed 250,000 times in just its first week. But we still don't have any subtitles other than English ready to share! \n\nhttp:\/\/www.amara.org\/en\/videos\/NHde2fOeLTBg\/info\/how-we-can-make-the-world-a-better-place-by-2030\/\n\nIf anyone can help expedite finishing any of the languages today Friday, but particularly \n\nSpanish and Portuguese,\n\n it would be extremely helpful. \n\nWe need your help to get our talk in front of audiences in EVERY UN member state by the end of the year! \n\nThanks again for all your help and for being part of this extraordinary community of volunteers.\n\n-Jonathan Talbot\nSocial Progress Imperative","updated_time":"2015-10-16T14:29:38+0000","id":"43410681471_10153103701401472"},{"message":"Hi, I'm translating the subtitles into Italian for this talk and I could use some help from some English native speakers: at 1:29\/1:30 the girls says something like \"We officially didn't take life [seriously] then\" according to the English Transcript, anyway it seems to me that she says something like \"we officially didn't take life SAFELY\" or something similar. It's important for me to understand what she actually say, because it may change the whole meaning of the paragraph. Thanks in advance :)","updated_time":"2015-10-16T12:26:32+0000","id":"43410681471_10153102318996472"},{"message":"I am also new here. Is there a how to. What website should I use to translate?","updated_time":"2015-10-16T11:13:29+0000","id":"43410681471_10153103399101472"},{"message":"Hi, my membership forthe french ted group is still pending and I've just subtitled this talk, so if there are any french-reviewers out there willing to have a look that would be great! :) ","updated_time":"2015-10-16T08:01:29+0000","id":"43410681471_10153103093726472"},{"message":"Hi everyone! My name is Jessica Ruby and I coordinate transcriptions for TED-Ed! We are so thankful for all the work you guys do to get our lessons out to teachers and students all around the world.\n\nWe just published a lesson that we'd love to get translated in a number of languages. Can you help us out?\n\nThanks so much!!","updated_time":"2015-10-15T21:22:30+0000","id":"43410681471_10153088711291472"},{"message":"Thanks to everyone who has started on translations of our latest TED Talk on the United Nations Sustainable Development Goals! \n\nhttp:\/\/www.amara.org\/en\/videos\/NHde2fOeLTBg\/he\/1122867\/\n\nJapanese, Bengali, Urdu, and Russian \n\nwould be great additions in these early days as we strive to reach audiences in EVERY UN member state.\n\nThanks from the whole Social Progress Imperative team!","updated_time":"2015-10-14T19:17:17+0000","id":"43410681471_10153101197371472"},{"message":"Hi everyone, I'm new in the group of TED translators,  I've just started with the translation into Italian of a TEDx Talk held in Madrid about the uprising in Gezi Park in 2013. I'm looking forward to seeing my translation online :) .","updated_time":"2015-10-14T17:11:47+0000","id":"43410681471_10153098534961472"},{"message":"Hi fellows, I've got a question: is there a Facebook group for the Italian translators? I've followed the link on the Youtube tutorial but it's broken :(","updated_time":"2015-10-14T12:56:38+0000","id":"43410681471_10153100737396472"},{"message":"He's back! Michael Green's first TED Talk introducing the Social Progress Index reached nearly 1 million viewers across 27 languages. Now his new video from the recent TED event in London, just released today, poses the question \"Can we achieve the Global Goals?\" The answer is a resounding YES, based on new research--but not with business as usual. \n\nHe introduces the People's Report Card, a new way for people everywhere to hold their governments accountable for delivering on their promises made at the United Nations.\n\nWe need to get this video in front of audiences in EVERY UN member state, and we need help of this awesome group of volunteer translators to make that happen. \n\nSpanish, German, and Arabic especially important this week.\n\nWho's in?\n\n","updated_time":"2015-10-14T02:28:34+0000","id":"43410681471_10153097501651472"},{"message":"Hello everyone, I've just finished transcribing my first video, and I wonder how can I know the status of my video, whether it has been reviewed\/approved or not?\nBtw, it's the video \"A transgender path home\" by Jennifer Finney Boylan. So if any of you is interested, please help me review it.\nhttp:\/\/www.amara.org\/en\/videos\/DIPErSqMGQOU\/info\/a-transgender-path-home-jennifer-finney-boylan-tedxmet\/\nThanks a lot!","updated_time":"2015-10-14T02:28:27+0000","id":"43410681471_10153094203671472"},{"message":"We've achieved 100K views in the first 24 hours on Michael Green's TED Talk on achieving the new Global Goals agreed at the United Nations, and we have 20 languages started for subtitles. Thank you! \n\nThis week, we are still in need of SPANISH as a priority language as part of our efforts to spread this talk to ALL UN member states. Any help on this front greatly appreciated.\n\n","updated_time":"2015-10-14T02:28:22+0000","id":"43410681471_10153098326401472"},{"message":"English to Russian translators, need a bit help to review a page and translate three hard lines. Anybody?","updated_time":"2015-10-13T12:28:54+0000","id":"43410681471_10153098036491472"},{"message":"Hello everybody,\nIs anyone of you available to approve the English translation of this talk from my city's TEDx event? http:\/\/amara.org\/fr\/videos\/yoWfbMPLYTY7\/info\/le-cerveau-a-t-il-un-sexe-franck-ramus-tedxclermont\/\nThanks a lot!","updated_time":"2015-10-12T19:33:00+0000","id":"43410681471_10153097437836472"},{"message":"Hello everyone! I am new to Amara. I transcribed this video about 3 months ago and the subtitle needs review. I am wondering how long does it take in general for a video to be reviewed? Or some of them just never do.... ? Hope that's not the case :) Anyway, it will be great if someone can help review it. It is my first video so I really look forward to it!  :)","updated_time":"2015-10-11T13:56:56+0000","id":"43410681471_10153093509251472"},{"message":"Hello everyone! Here are the links to my first two translations for TED. Is there anybody available to approve them? Thank you for your time. \n\n1) http:\/\/amara.org\/el\/videos\/MYiPtqB98AyL\/info\/an-invitation-to-men-who-want-a-better-world-for-women\/\n2) http:\/\/amara.org\/el\/videos\/8zuFNJv2soUZ\/el\/705647\/","updated_time":"2015-10-11T13:56:27+0000","id":"43410681471_10153094270556472"},{"message":"Hello all, anybody available to approve the French subtitles for this very touching and thoughtful TedX video? \nA bunch of other languages need review as well. \nMerci!\n\n","updated_time":"2015-10-11T12:57:44+0000","id":"43410681471_10153086065921472"},{"message":"English language coordinator needed\nCould any of you approve English subtitle for a talk at my event, we have a Vietnamese subtitle for it already but it has been 2 weeks, no one has approved our talk yet. Thanks in advance!\nP\/s this talk has been transcribed and sync by me the organizer of the event so it is very accurate.\n\n","updated_time":"2015-10-08T08:06:31+0000","id":"43410681471_10153089848561472"},{"message":"Are there any of you native English speaking that could consider reviewing the transcript for this: Reversing Type 2 diabetes starts with ignoring the guidelines | Sarah Hallberg | TEDxPurdueU? \nhttp:\/\/amara.org\/sv\/videos\/OHFFWTTsYi4d\/info\/reversing-type-2-diabetes-starts-with-ignoring-the-guidelines-sarah-hallberg-tedxpurdueu\/\nThere are several including myself that are interested in doing translations.","updated_time":"2015-10-06T11:44:41+0000","id":"43410681471_10153088482351472"},{"message":"If you're looking for something great to translate, I suggest this wonderful talk from TEDxYYC :)","updated_time":"2015-10-05T20:54:13+0000","id":"43410681471_10153087645256472"},{"message":"Polish subtitles in need of review:","updated_time":"2015-10-05T13:19:07+0000","id":"43410681471_10153087013951472"},{"message":"Hi guys. First time translating here and I can't sync what I translated. I think the Italian version is complete so I don't understand why it's not working. Thanks for your support, here's the link ","updated_time":"2015-10-05T10:29:39+0000","id":"43410681471_10153082331496472"},{"updated_time":"2015-10-05T10:14:10+0000","id":"43410681471_10153082741451472"},{"message":"http:\/\/www.amara.org\/en\/videos\/vNtUM5CRl6cN\/zh-cn\/1087042\/\n\nIS THERE ANYONE COULD HELP ME TO REVIEW IT? PLEASE!!","updated_time":"2015-10-05T10:14:00+0000","id":"43410681471_10153082804651472"},{"message":"Hello everyone, \ndoes anyone want to transcribe a talk? I really want to translate it to Portuguese, because it was a friend's sister who gave the talk, but it wasn't transcribed yet...\nHere's the link:\n\n","updated_time":"2015-10-05T10:13:51+0000","id":"43410681471_10153084787286472"},{"message":"Dear translators,\n\nToday TEDTalk of the day - Emilie Wapnick: Why some of us don't have one true calling - comes from TEDxBend.\n\nBoth videos are available for translation on Amara.\nNOTE: The TEDx video has existed on Amara for a while, and has a few completed translations, and a few more in progress.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/I944Whcs1Tx5\/info\/why-some-of-us-dont-have-one-true-calling\/\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/xLnviKxVD9lh\/info\/why-some-of-us-dont-have-one-true-calling-emilie-wapnick-tedxbend\/?tab=video","updated_time":"2015-10-02T18:30:56+0000","id":"43410681471_10153082183076472"},{"message":"Hello everyone,\n\nthis is Enid Kim from TEDxKFAS team.\nWe just added English subtitles for 4 Korean talks we have, and now they are waiting to be reviewed! :)\n\nThe talks are from social social entrepreneurs in Korea, who are striving to give a positive impact to the society through their businesses.\nPlease help these talks reach wider audience! =)\n\nYou can find the videos in the following link:\nhttp:\/\/www.amara.org\/ko\/search\/#\/?q=tedxkfas&video_lang=&langs=ko\n\nThank you!","updated_time":"2015-10-02T17:47:17+0000","id":"43410681471_10153081586591472"},{"message":"Hi translators,\n\nToday's TEDTalk of the day - Martin Pistorius: How my mind came back to life - and no one knew - comes from TEDxKC.\n\nBoth videos are available for translation on Amara.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/k65PA9EYnZkd\/info\/how-my-mind-came-back-to-life-and-no-one-knew\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/UWRIlr97Nzes\/info\/how-my-mind-came-back-to-life-and-no-one-knew-martin-pistorius-tedxkc\/?tab=video","updated_time":"2015-10-01T18:56:33+0000","id":"43410681471_10153080822176472"},{"message":"Felicidades a todos.","story":"Cesar Guadarrama shared Culturizando's photo to the group: I Translate TEDTalks.","updated_time":"2015-10-01T09:31:47+0000","id":"43410681471_10153079979306472"},{"message":"Hello everyone,\n\nI am Enid Kim from TEDxKFAS team.\nWe recently held a TEDx conference here in Seoul, and some of our talks (in English) are still waiting to be reviewed.\nWe would much appreciate it if you could help us out by reviewing them! \nThey are rather fun talks about China's future and nanotechnology. :)\n\nThank you in advance for your help!\n\nThe list of talks are:\n\nChina’s Domestic Transformation and Global Security Impact by 2025 | Feng Zhu | TEDxKFAS\nhttp:\/\/www.amara.org\/ko\/videos\/dZ6yIXtqZwaA\/info\/chinas-domestic-transformation-and-global-security-impact-by-2025-feng-zhu-tedxkfas\/?tab=video\n\nFuture China: A Peaceful Power? | Yunling Zhang | TEDxKFAS\nhttp:\/\/www.amara.org\/ko\/videos\/toR49JXhdHJq\/info\/future-china-a-peaceful-power-yunling-zhang-tedxkfas\/?tab=video\n\nCan China Connect the World by High-Speed Rail? | Gerald Chan | TEDxKFAS\nhttp:\/\/www.amara.org\/ko\/videos\/DknAqQWFfWRD\/info\/can-china-connect-the-world-by-high-speed-rail-gerald-chan-tedxkfas\/?tab=video\n\n2025: Charting China’s Future | Jae Ho Chung | TEDxKFAS\nhttp:\/\/www.amara.org\/ko\/videos\/STHiaRAi6pDh\/info\/2025-charting-chinas-future-jae-ho-chung-tedxkfas\/\n\nTargeted Therapy for Liver Cancer Assisted by Nanotechnology | Taeghwan Hyeon | TEDxKFAS\nhttp:\/\/www.amara.org\/ko\/videos\/27spuPM4cvqo\/info\/targeted-therapy-for-liver-cancer-assisted-by-nanotechnology-taeghwan-hyeon-tedxkfas\/?tab=video","updated_time":"2015-10-01T09:31:40+0000","id":"43410681471_10153080083246472"},{"message":"Happy International Translation Day!\n","updated_time":"2015-10-01T09:31:15+0000","id":"43410681471_10153078762691472"},{"message":"Hello everyone,\n\nToday's TEDTalk of the day, Mac Stone: Stunning photos of the endangered Everglades, comes from TEDxUF.\n\nBoth videos are available for translation on Amara.\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/N8YEg6noECZI\/info\/stunning-photos-of-the-endangered-everglades\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/2O6uSpac4KbO\/info\/stunning-photos-of-the-endangered-everglades-mac-stone-tedxuf\/?tab=video","updated_time":"2015-09-30T20:07:06+0000","id":"43410681471_10153079502196472"},{"message":"I have a question. I have been working in TEDxKobe OTP team mainly to transcribed in original language, i.e., Japanese. I wonder if there is any possibility to have already-published-titles (of our past talk which had already published into English) changed? The translation was conducted by non-team member, and there is nothing bad about the title, but TEDxKobe team want to use our original titles which were used and written in the event programme pamphlet, so that we could easily reach our talk video through searching engines.\nIf possible, how could we do it?\nThank you.","updated_time":"2015-09-30T15:28:11+0000","id":"43410681471_10153078524531472"},{"message":"Hi! I am posting this on behalf of Gautam John (a TED India \n Fellow who talked about an open source publishing model Pratham Books was working on at the 2013 retreat). Gautam is not on Facebook and has requested to post this here : \n\nWe've just launched Pratham Books' StoryWeaver 3 weeks ago: https:\/\/storyweaver.org.in. StoryWeaver is an open source platform of multilingual children’s stories. Log on from a desktop computer, laptop, tablet or mobile phone and you can then read from a collection of 800+ stories in 27 languages. You can create a new story from a bank of 2000 images. You can translate any of the stories into newer languages and share them\nwith others. You can print and use the stories in the way that you want. And also connect with a community of content creators and readers. And this is just the beginning. We will continue to grow the repository through more participation and more collaboration with like-minded partners.\n\nI was wondering whether the TED translation community might both find value in the platform and add value by translating stories in to their languages. \n\nThank you!\n\n*****************\nWe are currently looking for collaborators for the Weave-a-Story campaign : http:\/\/bit.ly\/8o9WaSc. \nIf you are unable to find your language on the site, please email us at storyweaver\u0040prathambooks.org to add it and we will try to add it as soon as possible.","updated_time":"2015-09-30T14:56:01+0000","id":"43410681471_10153079043766472"},{"message":"Happy #Translators Day","updated_time":"2015-09-30T05:17:42+0000","id":"43410681471_10153077339396472"},{"updated_time":"2015-09-28T07:34:43+0000","id":"43410681471_10153075840846472"},{"message":"Hi everyone, just a quick question. Do you know if it's okay to put words like \"gonna\" instead of \"going to\" in the subtitles? Because the man speaks so fast, people cannot read them (makes me get a \"!\" on every sentence).","updated_time":"2015-09-27T05:06:25+0000","id":"43410681471_10153069050036472"},{"message":"Great news everyone! We hit the 50\u0025 mark for transcriptions and the 27.9\u0025 mark for Spanish translations at TEDxMileHigh! Thank you to everyone who has helped so far. If you have time this weekend, can you start another?? :D Thank you so much!! (Also if you don't speak Spanish, we still absolutely want your translations! Come one, come all!)\n\n","updated_time":"2015-09-26T00:43:59+0000","id":"43410681471_10153072546711472"},{"message":"Hi there, I've just translated the subtitles for this Japanese TEDx video into English and I'm keen to have it reviewed before it gets forgotten in the queue. My translation of the title is \"Empowering teachers to transform education\" and it's on a fairly broad subject but it's also quite personable. \n\nIt'd be nice if someone who knows some Japanese could do it but you don't necessarily have to understand Japanese to take the reviewing task do you? Any takers?\n\nEmpowering teachers to transform education | Yusuke Matsuda | TEDxICU","updated_time":"2015-09-24T20:22:53+0000","id":"43410681471_10153066102551472"},{"message":"Hello, guys!\nI have translated my first TED video and I'm really anxious to know about my performance, since I'm new in this area. I'm an English and Portuguese teacher in Brazil and an under graduate student in translation. Is it possible to know when the video is reviewed? Do we receive any email telling us about it?","updated_time":"2015-09-24T19:16:27+0000","id":"43410681471_10153070737141472"},{"message":"Hi everyone,\n\nThis TEDxGeneva talk on imitation needs French translation! The speaker, a French-American artist, advocates for a world in which art is distributed and modified freely. The task is available here:\nhttp:\/\/www.amara.org\/en\/teams\/ted\/tasks\/?lang=fr&team_video=81970","updated_time":"2015-09-24T19:10:16+0000","id":"43410681471_10153070860576472"},{"message":"Hello,\n\nCan someone help me on this? I translated a video that was eventually reviewed. According to the reviewer, the subtitles are out of sync. But everything was fine when I checked it in the editor. I already tried checking it using the Legacy Editor and still it was in sync. I don't know what to do about it. Please help. :(\n\nThank you..","updated_time":"2015-09-23T07:51:46+0000","id":"43410681471_10153066939736472"},{"story":"Dimitra Isiliel Papageorgiou shared TED's post to the group: I Translate TEDTalks.","updated_time":"2015-09-22T21:13:29+0000","id":"43410681471_10153067715806472"},{"message":"Hi everyone,\n\nThe TED talk from Thursday, September 17th, \"Falling in love is the easy part\", by Mandy Len Catron, comes from TEDxChapmanU.\n\nBoth the TEDx and the TED video are available for translation on Amara.\n\nTEDTalk: http:\/\/amara.org\/en\/videos\/8xA3UZs7e2yP\/info\/falling-in-love-is-the-easy-part\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/mJra9Ktk2FKP\/info\/falling-in-love-is-the-easy-part-mandy-len-catron-tedxchapmanu\/?tab=video","updated_time":"2015-09-22T09:12:48+0000","id":"43410681471_10153066259491472"},{"message":"Hello,\n\nI'm facing a problem adding translation to a video I already transcribed. Whenever I try to access that video, this message shows up. Do u have any idea what is going on? or what should I do to overcome this problem. I'll be thankful for any help.","updated_time":"2015-09-21T19:30:21+0000","id":"43410681471_10153062191871472"},{"message":"Hi All Today I clicked a task on dashboard but I noticed it has actually been finished. I'm confused. Do anyone know any about this？ Thanks：）","updated_time":"2015-09-21T13:10:15+0000","id":"43410681471_10153049566486472"},{"message":"I just finished syncing subtitles for my first TedX video. I was then taken to this page, which shows that my work is in draft form. Is there anything I else I should have done here, to save the work, any steps I'm missing? It's waiting for a review now! German to Engish translation. \n\n","updated_time":"2015-09-17T15:08:20+0000","id":"43410681471_10153055155241472"},{"message":"Volunteers working on transcripts and translations of TEDxSaoPaulo and TEDxJardins at our transcribeathon this morning in São Paulo.","updated_time":"2015-09-17T14:52:21+0000","id":"43410681471_10153058483716472"},{"message":"https:\/\/www.facebook.com\/atpatilsir\/posts\/991597144207753\n\nFor review","updated_time":"2015-09-16T01:48:34+0000","id":"43410681471_10153054226016472"},{"message":"Hi, I transcribed a video long ago and i'm still waiting for the review, can you please do it!","updated_time":"2015-09-15T15:52:50+0000","id":"43410681471_10153049575046472"},{"message":"Anyone translating Romanian here? I'd like to get briefed on how to get started, quality checks and so on, but how do I know that 2 people won't start translating the same thing at the same time? Thanks!","updated_time":"2015-09-13T22:56:57+0000","id":"43410681471_10153051081686472"},{"message":"Hello everyone,\nI translated the following video, it was reviewed already, but it's been waiting for approval for a month. I was a pleasure to me to translate it because of its topic and I'd like it to be ready.","updated_time":"2015-09-13T05:50:47+0000","id":"43410681471_10153048502461472"},{"message":"Hello everyone!\nI'm a newbie here,can anyone tell me how I get started,the ABC's of it?\nThanks ^^","updated_time":"2015-09-12T11:31:39+0000","id":"43410681471_10153049277831472"},{"message":"Hello! French reviewers: would one of you have a moment to review The meeting point of Oriental roots and Rock | Yossi Sassi | TEDxJaffa, by and about this fantastic musician, Yossi Sassi? \nIt's under 17 minutes long, music included, and there shouldn't be much reviewing to do. \nMerci :)","updated_time":"2015-09-11T15:27:34+0000","id":"43410681471_10153046602851472"},{"message":"Hey guys,\nIs there any one being kind to review this Chinese(simplifie)subtitle?\nThanks in advance!:)","updated_time":"2015-09-11T15:27:30+0000","id":"43410681471_10153047109081472"},{"message":"Hey everyone, can somebody please review this for me?\n","updated_time":"2015-09-10T19:42:52+0000","id":"43410681471_10153046626936472"},{"message":"Hi everyone!\n\nThis video needs review of the English transcription in order to be \"set free into the world\". Any awesome volunteer willing to tackle this task?\n\n(http:\/\/tedxtalks.ted.com\/video\/Merging-Industry-and-Academia-A)","updated_time":"2015-09-08T07:58:53+0000","id":"43410681471_10153040817826472"},{"updated_time":"2015-09-08T07:58:06+0000","id":"43410681471_10153041725271472"},{"message":"Hello everyone!\nThis is one of our TEDx talks\/performance in Mongolia.\nCan anyone review the english translations? \nIt has only a dozen lines\n\nP.S: And of course I forgot to translate the title and desc.... sigh \n\nTitle: Contortionist | Ukhaanzaya Tserendondov | TEDxBagaToiruu\nDesc: Eighth grade student at School No.1 in Khentii Province, Ukhaanzaya Tserendondov, was named “Humanitarian Child” for her charitable projects. By raising 8,000 dollars through her charity concerts held in Khentii and Ulaanbaatar, she donated wheelchairs to disabled children, beds for the local maternity hospital and toys for children’s hospital ward.","updated_time":"2015-09-08T07:58:00+0000","id":"43410681471_10153041777831472"},{"message":"Hello all, as video subtitlers\/reviewers, are we credited on public websites such as TedxTalks.ted.com or YouTube? If so, where? (if not... why not? :)) \nI checked a video I subtitled on these websites but I don't see any credits.\nThanks!","updated_time":"2015-09-07T13:59:53+0000","id":"43410681471_10153020390331472"},{"message":"Got free time this weekend? At TEDxMileHigh, we set a goal of transcribing 100\u0025 of our talks in English by 2016 and translating 100\u0025 of our talks in Spanish by 2017. We are 43\u0025 done with our English transcriptions and 24\u0025 done with our Spanish transcriptions. Please see this spreadsheet or message me directly if you are interested in helping :) Thank you!\n\n","updated_time":"2015-09-06T16:59:09+0000","id":"43410681471_10153037244381472"},{"message":"This fun and short talk given in English by a 16 year old Brazilian girl is waiting for review in Arabic, Chinese and Polish.\nIndonesian, Russian and Ukranian tasks are incomplete.","updated_time":"2015-09-06T16:59:02+0000","id":"43410681471_10153037794961472"},{"message":"Hello from TEDxMoscow.\n\nWe need your help. The following videos need review.\n\nElena Serova - the first TEDx Talk Live from ISS in history of TED and TEDx \nhttp:\/\/www.amara.org\/en\/videos\/uYTvFdNjUukM\/info\/interviu-s-bortovym-inzhenerom-mks-elena-serova-tedxmoscow\/\n\nPyotr Nalich\nhttp:\/\/www.amara.org\/en\/videos\/EDAi2V7qOsx5\/info\/konturbabimus-piotr-nalich-tedxmoscow\/\n\nDmitry Alekseev\nhttp:\/\/www.amara.org\/en\/videos\/K30FrwdhCcAY\/info\/3-milliarda-bakterii-delaiushchikh-zhizn-luchshe-dmitrii-alekseev-tedxmoscow\/\n\nVladimir Dolgy-Rapoport\nhttp:\/\/www.amara.org\/en\/videos\/s4JrIWaijNL6\/info\/kak-vyrastit-schastlivogo-rebionka-i-vozmozhno-chempiona-vladimir-dolgii-rapoport-tedxmoscow\/","updated_time":"2015-09-04T14:58:50+0000","id":"43410681471_10153026388861472"},{"updated_time":"2015-09-04T13:52:41+0000","id":"43410681471_10153034530616472"},{"message":"Hi there,\nI've recently been told by a reviewer that I should change the quotation marks on a video entitled 'How I learned to communicate my inner life with Asperger's'. Only I don't have access to this video anymore and it was not sent back to me. \nHow comes ?\nThanks for your help :)","updated_time":"2015-09-01T08:47:42+0000","id":"43410681471_10153022195996472"},{"message":"Hello,\nCould any of the LCs out there please  approve this talk(Chinese Simplified translation)? Thank you so much!\n ","updated_time":"2015-08-31T08:43:00+0000","id":"43410681471_10153024271031472"},{"message":"Hi TED Talks community!\nI’m really excited of participating in this project. I just have translated this video from English to Spanish, does anyone would like to review it please? Thanks in advance!\nGreetings from Perú!","updated_time":"2015-08-26T15:55:30+0000","id":"43410681471_10153015627821472"},{"message":"Hello everyone,\nI hope someone has time to review the subtitles for this translation :http:\/\/amara.org\/fr\/videos\/LJHTAlwW96Ii\/info\/ne-dans-la-lave-dun-volcan-thierry-courtadon-tedxclermont\/\nThis TEDx took place in my city so I would be happy to see it approved!\nThanks a lot!","updated_time":"2015-08-26T15:55:20+0000","id":"43410681471_10153016541426472"},{"message":"Hello everyone!\nI am excited to be part of the project and this group. Recently, I translated a video from German to English that has not been reviewed yet. Would someone be kind to review it? Thank you!\n","updated_time":"2015-08-25T07:25:38+0000","id":"43410681471_10152994675591472"},{"updated_time":"2015-08-20T12:32:06+0000","id":"43410681471_10153004324316472"},{"message":"Hey guys, I just have translated this video from English to simple Chinese, does anyone would like to review it please? This is my first translate talk, interesting. Thanks so much!","updated_time":"2015-08-19T01:32:21+0000","id":"43410681471_10153000900031472"},{"message":"Hi all,\nJust a week question. I don't yet understand very well how TED Open Translation works. I already translated into French a few TED videos only I found out I'm not always credited for the work I've done. \nOn the video 'Depressed Dogs, Cats with OCD' by Laurel Braitman, I am credited as the reviewer, although I translated this video and obliviously did not review it myself.\nWhile on the video 'The DIY Orchestra of the Future' by Ge Wang, I am not credited at all even though I sent back the translation I did and never got an answer.\nCould anyone explain me how it works, what I've done wrong and how I could correct it in the future ?\nThanks a lot everyone.","updated_time":"2015-08-14T09:33:49+0000","id":"43410681471_10152994050216472"},{"message":"Hello everyone!\nreally excited to participate in the project like this))\nHere is my first transcribed video)\nPlease,is there anyone to be so kind to review?\npleeasse)\nhttp:\/\/www.amara.org\/en\/videos\/VXCVCjsjA51q\/info\/motherhood-matters-trish-morrison-tedxspeedwayplaza\/","updated_time":"2015-08-14T07:38:53+0000","id":"43410681471_10152993779481472"},{"updated_time":"2015-08-14T07:38:48+0000","id":"43410681471_10152993680676472"},{"message":"Hi guys. \nSo, I´ve translated a video last week, than was reviewed and approved. However, I didn´t get any credits for that as I was expecting. My question is, I saw that the video the video I translated on TED´s page, and the it´s showing the name of the person who approved the video \"the coordinator\". I am really upset with this, since I did the translation and my name is not showing there.","updated_time":"2015-08-11T15:31:10+0000","id":"43410681471_10152988936456472"},{"message":"Great community, May I seduce you to approve any of the following talks transcribed more than a year ago. Thanks in advance!\n\n- http:\/\/bit.ly\/1xSVcef - What is your \"What if\"\n- http:\/\/bit.ly\/1B8ps5L - Programming biology\n- http:\/\/bit.ly\/1JFAPXp - Understanding becomes before action","updated_time":"2015-08-11T09:03:40+0000","id":"43410681471_10152988555106472"},{"message":"Hi everyone,\n\nParticipate in discovering and sharing great TEDx talks given in Russian!\n\nThe \"Best of TEDxTalks\" project on Amara is updated with talks from TEDxMoscow, TEDxSkolkovo, TEDxAlmaty, TEDxKyiv and other events.\n\nSome of them need transcripts, and others English translation\/reviews.\n\nIf you're looking for your next task, this is the best place to check first!\n\nHappy subtitling!","updated_time":"2015-08-07T12:21:26+0000","id":"43410681471_10152966610606472"},{"message":"Today I watched this video. I understand it is not yet translated in english. Do you have news? Will it be translated? Thank you for your help.","updated_time":"2015-08-07T12:21:26+0000","id":"43410681471_10152975604436472"},{"message":"Hey everyone,\n\nI gave a TEDx talk last October 2014, calling young people to act and make a difference  and take leadership over their life, no matter where you are from and what happened to you. I've been working ever since to get the video uploaded and subtitled, but right now it's still in the 'subtitles in review' phase. So, I already gave it English subtitles, I just need someone who can review them for me. The talk is in Dutch, but I can pretty much assure you that the subtitles are correct. Please help!\n\nLink:\n","updated_time":"2015-08-07T12:21:26+0000","id":"43410681471_10152977236276472"},{"message":"Hi everyone. I have some doubts about the changes that we need to do with the subtiling after has been reviewed. I´ve translated a video from Spanish to Portuguese, and now I need to make some changes, as I got a message from the coordinator. However, I don´t know how to edit the subtitle again. The task is assigned to another person (the coordinator). Anyone knows how to do that? This is my substitle that has been reviewed and ready to be approved.","updated_time":"2015-08-07T12:21:25+0000","id":"43410681471_10152977631526472"},{"message":"Hello, everyone! This Talk was given in TEDx São Paulo. So, now its subtitle is available to be translate to other languages. Please, if there is someone fluent in Portuguese (Brazilian), I make an invitation to share this talk to the world. Thank you! \n\n","updated_time":"2015-08-07T12:21:25+0000","id":"43410681471_10152977707401472"},{"message":"https:\/\/www.facebook.com\/UPROXX\/videos\/10153583746731337\/?pnref=story\n\nRecommended for translation:\n\n","updated_time":"2015-08-07T12:21:10+0000","id":"43410681471_10152977226811472"},{"message":"Hello everyone, \nDo anyone of you speak Malay? Or know anyone who does? I need a bit of help in translating :)","updated_time":"2015-08-07T12:20:58+0000","id":"43410681471_10152978356441472"},{"message":"We know that YouTube counts the views but are there also statistics on subtitles per language per video? Does TED track them on their site?","updated_time":"2015-08-05T14:26:53+0000","id":"43410681471_10152975734891472"},{"message":"Hello all,\nFirst thank you for accepting me in the group.\n\nRecently I translate my first TEd-Ed video through Amara platform. Now the status of my translation is \"Waiting for review\".\n\nDo you know how long is the process of review?\n\nThank you in advance!","updated_time":"2015-08-03T12:44:48+0000","id":"43410681471_10152971442481472"},{"message":"Hi everyone!\n\nI have recently joined TED and have become a translator (to Italian), which I am very pleased of. I started working on my first video and subtitles are now over. However, I cannot seem to find a way to move on to the next step, so that someone can review my job. I am attaching here a screenshot of what I see on my Amara page. If I click on the \"Yes, start syncing\" button, nothing happens.\n\nCan somebody help me? Thanks a lot!","updated_time":"2015-08-03T11:58:49+0000","id":"43410681471_10152971442261472"},{"message":"Any Indonesian translators here? Just translated this into Indonesian and it needs review: ","updated_time":"2015-08-03T11:39:21+0000","id":"43410681471_10152966142486472"},{"message":"Hello, as I've noticed this is a recurring issue among all communities and many of you, I'd like to share a tip:\n\nNo matter at what point during the process one writes\/modifies title and description, please make sure you hit 'save' immediately afterwards.\n\n[Note:consider doing this as a stand-alone step, without making any other changes to the body of the transcription\/translation itself. You can do so after you resume your task].\n\nHope it helps!","updated_time":"2015-07-31T18:51:50+0000","id":"43410681471_10152962479176472"},{"message":"Respected all,\n                       I am the curator of TEDx IIT Guwahati,India.I have to organize the ted talk on 26th July 2015. But due to unavoidable circumstances it could  not be organized. Our license is valid till April 2016. I have send the mail to the Tedx but they are on summer holidays till Aug 10.Is there is  any possibility that i can edit the dates and tell them the revised date as soon as possible .reply if possible asap.","updated_time":"2015-07-28T14:34:53+0000","id":"43410681471_10152959354401472"},{"updated_time":"2015-07-28T11:03:40+0000","id":"43410681471_10152948353176472"},{"story":"Yasser Karimo shared TEDxUTP's photo to the group: I Translate TEDTalks.","updated_time":"2015-07-27T16:56:01+0000","id":"43410681471_10152954224111472"},{"message":"Thank you very much for youe acceptance","updated_time":"2015-07-27T16:55:56+0000","id":"43410681471_10152955894461472"},{"message":"Hello! I'm trying to transcribe this video, and it has a problem with muted sound in Amara. Specifically in subtitling area, not in the video itself. Could someone help me? Many thanks!\n\n","updated_time":"2015-07-27T05:02:07+0000","id":"43410681471_10152947815646472"},{"message":"Dear TED OTP friends,\n\nIf anyone interested in translate\/review this TED-ed video, please please please kindly do. Thanks in advance :)\n","updated_time":"2015-07-26T23:11:07+0000","id":"43410681471_10152883389881472"},{"updated_time":"2015-07-24T21:33:38+0000","id":"43410681471_10152953099081472"},{"message":"hi guys! yesterday i translated my first ted talk and just wondering usually how long it takes before someone will do the review for my video? thanks","updated_time":"2015-07-24T04:19:19+0000","id":"43410681471_10152950829281472"},{"story":"Nadine Hennig shared ProZ.com's photo to the group: I Translate TEDTalks.","updated_time":"2015-07-23T12:02:12+0000","id":"43410681471_10152950553656472"},{"message":"Hi everyone,\n\nToday's TEDTalk - John Green: The nerd's guide to learning everything online - comes from TEDxIndianapolis. Both videos are available for translation on Amara.\n\nTEDTalk: https:\/\/amara.org\/en\/videos\/K9YP7WZ0eaor\/info\/john-green\/?tab=video\n\nTEDxTalk: https:\/\/amara.org\/en\/videos\/cxKjS1wVwhJA\/info\/the-paper-town-academy-john-green-tedxindianapolis\/?tab=video","updated_time":"2015-07-23T04:32:45+0000","id":"43410681471_10152949116366472"},{"message":"Hello, I hope one of you has time to review the English subtitles of this video: http:\/\/amara.org\/fr\/videos\/bNAyNxqly2xH\/info\/elle-fait-chanter-vos-neurones-sandrine-musel-tedxclermont\/\n\nThank you and have a good week-end!","updated_time":"2015-07-18T14:30:25+0000","id":"43410681471_10152941259686472"},{"message":"I was reminded of Pink Floyd's lyrics \"Hanging on in quiet desperation is the English way\" by this talk addressing a type of hidden human suffering that takes place right under our noses. Who helps with adding a translation? \n","updated_time":"2015-07-17T07:16:42+0000","id":"43410681471_10152929073391472"},{"message":"This talk went the whole cycle of translation (Dutch), review and approval in Amara but the Dutch subtitles do not become available online, nor do I see the talk show up on my TED profile. What can be the reason?\n\n","updated_time":"2015-07-15T15:49:49+0000","id":"43410681471_10152931278571472"},{"message":"Hi. Is there any way to enter special characters such as back space in Amara editor?\nA user experiences Amara editor \"Error saving subtitles\" overly frequently.  We have found the saved text to download always contains control character x08. It is also reproducible. When I copy and paste x08 code in Amara editor. It will always show \"Error saving subtitles\" dialog.\nIs there any way a Mac user can enter special character in Amara editor? (Edited: added the following) The user hasn't done anything intentionally to enter x08 in Amara editor, but somehow the character gets entered and will cause \"Error saving subtitles\" error. If some of you could think of several ways such as key sequence or certain operations on editor, I would ask the user to look for that operation.","updated_time":"2015-07-15T14:37:40+0000","id":"43410681471_10152934381061472"},{"message":"Hello, I've recently translated this TEDxTalk from Lauryn Ballesteros (about bold authenticity in speaking your “trueself”) and a Found in Translation Panel that may be useful for somebody willing to know how translating TEDTalks works and the amazing community that comes with it. \n\nSomebody available to review them?\n\nhttps:\/\/www.youtube.com\/watch?v=qIrTYnuHYu4\n\nMany thanks you in advance... :)","updated_time":"2015-07-14T14:21:06+0000","id":"43410681471_10152933590801472"},{"message":"Hey, I'm new to this and I can't figure out how to split the subtitles. I've been reading the wiki and checked out tutorial videos. But for some reason this little 'plus' button does not appear on my screen to add another subtitle. Anyone who is willing to help? Thanks in advance.","updated_time":"2015-07-14T13:11:40+0000","id":"43410681471_10152932643951472"},{"message":"Any good TED Talk to accompany #PlutoFlyBy?","updated_time":"2015-07-13T19:44:54+0000","id":"43410681471_10152933239056472"},{"message":"Hello - I translated my first talk a couple of weeks ago, and I think it has been reviewed, does anyone know how I can hurry it along so that the subtitles are available for public viewing? Thanks. ","updated_time":"2015-07-13T13:50:50+0000","id":"43410681471_10152932701146472"},{"message":"I've just finished translating this beautiful talk, please could someone review it? Thanks. ","updated_time":"2015-07-13T13:50:42+0000","id":"43410681471_10152932703216472"},{"message":"Hello - I've found a talk I'd really like to translate into English, but although translation into various languages is listed as a task for the video, English isn't one of them. Does anyone know how to fix this? (It hasn't been done already and I don't think anyone else is working on it)","updated_time":"2015-07-13T13:36:12+0000","id":"43410681471_10152923600661472"},{"message":"Hi everyone,\n\nThe Friday TEDTalk of the day - Ash Beckham: When to take a stand — and when to let it go - comes to us from TEDxBoulder.\n\nBoth versions of this video are available for subtitling on Amara, so you can take both tasks and adjust your translations:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/tzjnAD1gCdwD\/info\/ash-beckham\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/Z5gInX0h4u3Y\/info\/owning-your-duality-ash-beckham-tedxboulder\/?tab=comments","updated_time":"2015-07-11T11:19:18+0000","id":"43410681471_10152929410526472"},{"message":"Why do I get notifications where it says there are available videos to translate and once I get there and look them up, there aren't?","updated_time":"2015-07-10T15:10:53+0000","id":"43410681471_10152926772416472"},{"message":"Passionate about languages? How many do you speak? Sébastien Roger de Nūnez speaks 10 - so far! In this talk, he explains the origins of language, and how they're related to Latin.\n\nEnglish translation is available for review.\nOriginal language: French.\n\n","updated_time":"2015-07-10T11:54:23+0000","id":"43410681471_10152926272016472"},{"message":"http:\/\/amara.org\/en\/videos\/zIdpki7CjW6j\/en\/1018998\/\nHey guys, I need final revision and moderation for this TedXSoba performance. Please check it out, shouldn't take long and I'm sure most will find it interesting and informative to watch. \nInbox me if there are any questions. \nThank you in advance.","updated_time":"2015-07-10T06:38:44+0000","id":"43410681471_10152927036306472"},{"message":"Hey guys,\ncould anyone tell me if there s also revision of transcription or after I do transcription i can start translating immediately? Thanks","updated_time":"2015-07-09T13:20:43+0000","id":"43410681471_10152926395336472"},{"message":"Hi, I found something interesting. I was looking for one of my previous translations and I found out, that this Talk is missing on both TED website and youtube. Somebody deleted it?\n","updated_time":"2015-07-09T13:19:15+0000","id":"43410681471_10152926251566472"},{"message":"Hi guys, so for a couple days lately, I've been getting this error each time I try to open the subtitle editor, and I already tried with another browser (I use Chrome and Safari) and the error persists. Does anyone else encounter the same problem and have found a solution to this? In case this is a factor as well, I am using Mac OSX Yosemite 10.10.4.","updated_time":"2015-07-09T11:53:07+0000","id":"43410681471_10152923873071472"},{"message":"Anybody please let me know the link where I can add my movies to amara. Thanks.","updated_time":"2015-07-08T12:12:59+0000","id":"43410681471_10152924649476472"},{"message":"A quick question: are the TED MED talks available for translation?","updated_time":"2015-07-07T08:39:00+0000","id":"43410681471_10152922875521472"},{"message":"Hello friends,\nI have some French translation for review. \nThank you very much for helping me!\nclaire\n\nhttp:\/\/www.amara.org\/en\/videos\/UOAh238AtT41\/fr\nhttp:\/\/www.amara.org\/en\/videos\/QazJ05dvlgji\/fr\nhttp:\/\/www.amara.org\/en\/videos\/DpD6W3DvZB6h\/fr\nhttp:\/\/www.amara.org\/en\/videos\/uoYtYLjrBS3a\/fr\nhttp:\/\/www.amara.org\/en\/videos\/nGOMigza3Sew\/fr\nhttp:\/\/www.amara.org\/en\/videos\/IncABfUwcXgH\/fr\nhttp:\/\/www.amara.org\/en\/videos\/8p7NcLfMCdtv\/fr\nhttp:\/\/www.amara.org\/en\/videos\/ws3cxSePcG1K\/fr\nhttp:\/\/www.amara.org\/en\/videos\/MoMG9cIczz4h\/fr","updated_time":"2015-07-03T18:47:03+0000","id":"43410681471_10152916139156472"},{"message":"Hello friends! I need help reviewing a video on AMARA. The subtitles are already submitted in english and I just need somebody to help me review them? Care to help me? (:\n\nI can return the favor by translating a talk from english to spanish. Thanks!","updated_time":"2015-06-30T17:59:32+0000","id":"43410681471_10152909754901472"},{"message":"Hello Translators!  Is anyone interested in translating this talk? It is certainly one of the most interesting TEDx talks I've transcribed! A story of a major social movement in India, built from the ground up.\n\n","updated_time":"2015-06-30T16:03:07+0000","id":"43410681471_10152908656801472"},{"message":"Hi everyone! I am TED's Russian translator. I mostly do the Ted-ed videos (you can see my translations of The Use of Metaphor, Why Shakespeare Wrote in Iambic Pentameter, What is an Earworm? and some others). I really like Ted-Eds. The issue might not be new, but we have been discussing it in our Russian FB-group and we have decided to bring it on international board. We want the names of translators be visible. We think it's quite natural to sign what has been done by you. Why not allow us to sign our works by writing TRANSLATED (into Russian) BY after the text of the scripts as the \"last (additional) capture\" or in the description after the author's name and the animation by info? We could put Author, Animation, Translation. Maybe also Edited by? If it's not a new issue, so give me some feedback on that since I am relatively new to TED.com (I started this year). Thank you!","updated_time":"2015-06-30T13:48:28+0000","id":"43410681471_10152909324096472"},{"updated_time":"2015-06-25T11:03:34+0000","id":"43410681471_10152900436836472"},{"updated_time":"2015-06-24T21:15:26+0000","id":"43410681471_10152896106771472"},{"message":"Dear all, Let's take a challenge!\n\nAlso, this is one way for us to discover interesting videos we want to translate :)\n\nI'm in :D","updated_time":"2015-06-24T03:27:13+0000","id":"43410681471_10152895038081472"},{"message":"Guys, I had big problems with my internet connection this month and couldn't finish to translate this talk on time. Now I can't get it back any more, what can I do?? Please, help. :\/\n","updated_time":"2015-06-23T13:31:13+0000","id":"43410681471_10152894337331472"},{"updated_time":"2015-06-23T10:23:24+0000","id":"43410681471_10152895577336472"},{"message":"Hello wonderful people!! \n\nAnybody interested in transcribing this TEDx talk: Love is the Key: Caitlin Crosby at TEDxBend? Thank you!!\n\nHere is the task: http:\/\/amara.org\/en\/videos\/JDuFBFm4FrIB\/info\/love-is-the-key-caitlin-crosby-at-tedxbend\/\n\nhttps:\/\/youtu.be\/J0VJaPe2Amk","updated_time":"2015-06-20T20:05:32+0000","id":"43410681471_10152889677256472"},{"message":"Please join our new group, Languages:\n\nImprove your Language skills and make new friends...\n\nIn Languages we share a vision of a world where people understand one another. A world where languages are no longer a barrier, but a bridge. A world where humanity speaks in many tongues, but shares one heart.\n\nWe strongly believe in the value of language education. We do it by using the power of a community. Together we practice our English, share moments of our lives, ask questions and help each other.\n\nhttps:\/\/www.facebook.com\/groups\/1624558247831283\/","updated_time":"2015-06-18T10:04:25+0000","id":"43410681471_10152882400421472"},{"message":"Is anyone interested in translating this talk?  It's a really powerful message, especially for young people:\n\n","updated_time":"2015-06-17T13:01:09+0000","id":"43410681471_10152867034651472"},{"message":"Could anyone review my english subtitles?\n","updated_time":"2015-06-17T12:09:21+0000","id":"43410681471_10152881961976472"},{"message":"I'm asking in this group as well... Anybody interested in transcribing this talk? I'd love to translate it\n\n","updated_time":"2015-06-15T19:20:30+0000","id":"43410681471_10152838657331472"},{"message":"Hello everyone!\nOur event TEDxKyotoUniversity was a success! \nWe are asking if there might be some who are interested in transcribing\/ translating some of our talks! Eng > Jpn, Jpn > Eng.\nPlease let us know! :)\n\nAlso checkout our page! \nhttps:\/\/www.facebook.com\/TEDxKyotoUniversity?ref=bookmarks","updated_time":"2015-06-15T19:20:23+0000","id":"43410681471_10152864940366472"},{"message":"Dear transcribers, \n\nI have been transcribing these two TEDx ADA talks in English recently.\n1. http:\/\/universalsubtitles.org\/en\/videos\/c7euMqIZHxeu\/info\/fourth-tunnel-tunnel-of-repetitions-hikmat-mursalzade-tedxada\/\n2. http:\/\/universalsubtitles.org\/en\/videos\/WL3zpi2Nz5zV\/info\/brain-transformation-timur-bakibayev-tedxada\/ \nCan I ask for a help from a native transcriber(or close) to review them, since I am neither native nor too much confident with my English?\nThanks beforehand~~","updated_time":"2015-06-15T19:20:18+0000","id":"43410681471_10152859883916472"},{"message":"Just finished Chinese translation of this talk. It is amazing how specialists can do on your devices. I don't know it is good or bad for our life. But you can just watch and have fun.\n\n","updated_time":"2015-06-15T19:20:10+0000","id":"43410681471_10152867725656472"},{"message":"EU Terminology Resources by TermCoord","updated_time":"2015-06-15T19:20:04+0000","id":"43410681471_10152866788886472"},{"message":"Dear translators, \nAnyone knows if there is a Facebook group for french TED translators\/transcribers? \nThanks in advance","updated_time":"2015-06-15T19:19:55+0000","id":"43410681471_10152874589511472"},{"message":"To celebrate your remarkable contributions this past year, and to look at the year ahead, we created the 2014 OTP annual report. Check it out!","updated_time":"2015-06-15T19:19:51+0000","id":"43410681471_10152663179551472"},{"message":"Dear all,\na translator asked me if there are official statistics about the average time it takes, globally, to translate a \"standard\" 18 minutes TEDTalk.\n\nThe OTPedia says \"Translation of a 15 minute talk can easily take several hours\", but if possible she'd rather have a number, or at least an interval (like, 4 to 6 hours).\n\nCan anyone of you help me with that?\nThanks in advance for your time.\nBest!\n\nMichele","updated_time":"2015-06-14T13:49:23+0000","id":"43410681471_10152872054211472"},{"message":"Recently I reviewed a Ted talk that was approved and published. Someone noticed that there were 2 mistakes where North korea was translated to South Korea. how can we correct a translation that was aready published?","updated_time":"2015-06-14T13:05:24+0000","id":"43410681471_10152875573606472"},{"message":"Absolutely stay true to yourself. Recommended for translation:\n","updated_time":"2015-06-06T18:55:04+0000","id":"43410681471_10152862077751472"},{"message":"TEDx Transcribe community, I need your help!  I'm making some promotional posters for our TEDxMileHigh Transcribathon and I would like to translate a few quotes from previous TEDxMH into as many languages as possible to put on the poster.  Listed below are five different quotes.  Please comment or message me with translations in your language.  I don't want to rely on Google Translate in case it is inaccurate :D  Thank you so much!!\n\n1. It's not about doing the occasional big things, it's about doing the consistent small things.\n2. People will support you when you start working with purpose.\n3. If you can achieve all of our goals, dreams and ambitions in your lifetime, then believe me when I say that you're not thinking big enough.\n4. Leave here and use your voice. Implore others to use theirs.\n5. We are all explorers.","updated_time":"2015-06-05T22:19:08+0000","id":"43410681471_10152853800281472"},{"message":"I noticed something intresting about Khadija Gbla's talk. In 16:02 I can clearly hear \"One in three children in Australia...\", but in transcript somebody wrote \"[Three children per day] in Australia...\" In Polish translation I wrote, what I heard, but German, French and French (Canada) translators followed transcript taken (I think) from TEDx version (http:\/\/www.amara.org\/en\/videos\/s3yMsuiUQN4i\/en\/908137\/). Who is right and what we should do?","updated_time":"2015-06-05T10:38:20+0000","id":"43410681471_10152858819011472"},{"message":"A world of languages!","updated_time":"2015-06-02T12:11:51+0000","id":"43410681471_10152852639671472"},{"message":"Hello,\nCould any of the LCs out there please review then approve this talk(Chinese translation)? Thank you so much!\n","updated_time":"2015-06-02T02:25:40+0000","id":"43410681471_10152838731321472"},{"message":"Αυτή είναι η πρόσφατη προσπάθειά μου, ευχαριστώ εκ των προτέρων όποιον αναλάβει το review.\nIδού η εισαγωγή:\n\"Φαντάζεστε ο εγκέφαλος να μπορούσε να προβεί σε επανεκκίνηση όπως ο υπολογιστής σας; Μια επανεκκίνηση σην οποία να ενημερώνονταν αντικαθιστώντας τα παλιά κατεστραμένα κύτταρα με νέα;\nΩ,αυτό φαίνεται καθαρή επιστημονική φαντασία θα πείτε. Όχι κύριοι,αποτελεί δυνητική πραγματικότητα που ερευνούν οι επιστήμονες αυτή τη στιγμή.\nΗ Ραλίτσα Πέτροβα μας αποκαλύπτει μερικές λεπτομέριες  της επιστήμης της νευρογέννεσης και εξηγεί πως αυτή (η νευρογέννεση) θα μπορούσε να δαμστεί ώστε να αναστρέψει ασθένεις όπως Αλζχάιμερ ή Πάρκινσον..\"\n\n","updated_time":"2015-06-01T10:45:01+0000","id":"43410681471_10152845405606472"},{"message":"तुम्ही केलेल्या भाषांतराचे पृष्ठ  इतरांना शेअर करा  त्याची नोंद ted घेईल \nl after you share a talk. Whenever you log into TED.com and share a talk, ted we'll start counting how many views it receives from people clicking on your links.\n________________________________________\nHow does it work?\nWhen you log in to your TED.com account and share a talk, we'll create a special sharing link just for you. You can share the talk using the social media buttons, or just by cutting and pasting the link. Each time someone follows your special link - and watches the video - one view will be credited to you.\nIf you don't have a TED.com account, you can sign up here.\n\n=  \n","updated_time":"2015-06-01T10:05:44+0000","id":"43410681471_10152847866416472"},{"message":"Hi, I'm transcribing a Tedx talk. Sometimes the lecturer talks really fast and the chars\/sec of the corresponding subtitles is more than 21. Sometimes it's almost 30. Is there any way to deal with it and reduce the rate?","updated_time":"2015-06-01T08:41:41+0000","id":"43410681471_10152824468061472"},{"message":"Hello everyone!  Is anyone going to be in the Denver (USA) area on June 12th?  We're putting together a TEDxMileHigh Transcribeathon and we would love the support of experienced translators if there is anyone nearby!  Let me know :)","updated_time":"2015-05-31T19:30:53+0000","id":"43410681471_10152841662676472"},{"message":"Hi everyone,\n\nThe Wednesday TEDTalk - Yassmin Abdel-Magied: What does my headscarf mean to you? - comes from TEDxSouthBank.\n\nBoth videos are available for subtitling on Amara:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/vcXVsxM4VIAr\/info\/what-does-my-headscarf-mean-to-you\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/tzRiDXb30Bp2\/info\/what-does-my-headscarf-mean-to-you-yassmin-abdel-magied-tedxsouthbank\/?tab=video","updated_time":"2015-05-29T13:58:24+0000","id":"43410681471_10152832716796472"},{"message":"Hey大家好！我新翻译了Heels vs. footbinding | Julie Bertrand | TEDxMontrealWomen的中文简体字幕，需要approval，有没有人可以帮忙approve呀?好感谢的喔XD\nI just translated my first TED subtitle from English into Simplified Chinese, could anyone be so kind to review and approve it? Lots of thanks! XD\nHeels vs. footbinding | Julie Bertrand | TEDxMontrealWomen\n","updated_time":"2015-05-29T12:10:03+0000","id":"43410681471_10152838342316472"},{"message":"Salut, est ce qu'il y a quelqu'un pour approuver cette traduction en français ? \nMerci  :D","updated_time":"2015-05-26T11:40:58+0000","id":"43410681471_10152805020661472"},{"message":"Arabic Translation :Ahmad Altamimi \nEnjoy your time by watching this smart woman ...","updated_time":"2015-05-26T11:40:54+0000","id":"43410681471_10152817475431472"},{"message":"One language dies every 14 days. By the next century nearly half of the roughly 7,000 languages spoken on Earth will likely disappear, as communities abandon native tongues in favor of English, Mandarin, or Spanish. What is lost when a language goes silent?\n","updated_time":"2015-05-19T22:57:19+0000","id":"43410681471_10152793487006472"},{"message":"Guys, Yossi, I just realised I forgot to put the title and the description here. Sorry...What can I do now? :\/\n","updated_time":"2015-05-19T16:24:32+0000","id":"43410681471_10152791030196472"},{"message":"Hi everyone,\n\nToday's TEDTalk is a moving song by women who are in prison for life, without the possibility of parole. It comes from a TEDxMuncyStatePrison event. Both videos are available for translation on Amara:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/5ZaGAlGHr30L\/info\/a-moving-song-from-women-in-prison-for-life\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/FbJh55QcEViV\/info\/a-moving-song-from-women-in-prison-for-life-the-lady-lifers-tedxmuncystateprison\/?tab=video","updated_time":"2015-05-19T11:09:42+0000","id":"43410681471_10152782612736472"},{"message":"Question:I'm a amateur.How to find a simple video to practice（English-Chinese）.","updated_time":"2015-05-18T22:21:49+0000","id":"43410681471_10152779138216472"},{"message":"Could any of the LCs out there please approve this talk? It is really interesting and it has been waiting for some time now to be approved and translated into other languages. Thank you in advance, whoever (and wherever) you are!\n","updated_time":"2015-05-17T15:04:01+0000","id":"43410681471_10152753292746472"},{"message":"Untranslatable Words with cute illustrations:","updated_time":"2015-05-14T11:19:13+0000","id":"43410681471_10152779421671472"},{"message":"HI Arabic translating friends! Dick Simon, a speaker for \"The Most Dangerous Four-letter Word\", needs to have Arabic caption available for his talk ASAP. He provided with complete translation - if any of you can help with this process, that will be great. Anwar may have a good advice but if any Arabic translator can reach out to me, I can forward you the text - so that you can start the process. I will inform Dick who will be working on it. Thanks!\nYou will enjoy this talk. \n","updated_time":"2015-05-14T07:12:35+0000","id":"43410681471_10152779378651472"},{"message":"Hey, everyone! We tried something new at TEDActive this year by bringing a filmmaker named Kier Atherton to follow our OTP volunteers around the conference. This is the first of hopefully a few films that will come out of the footage he shot. I hope it will bring back good memories for everyone who has ever attended a conference, and inspire dreams for those of you who have yet to join us. The work you do is so important. Thank you!\n\n","updated_time":"2015-05-13T11:44:45+0000","id":"43410681471_10152778124011472"},{"message":"Hello all ! This talk by wonderful Faouzia Cherfi has its French transcript and its English translation, because of its topic, it would be great if it was translated in Arabic especially, if any of you is interested : ","updated_time":"2015-05-11T20:19:58+0000","id":"43410681471_10152771297041472"},{"message":"This is a powerful talk, please consider translating it :) Thanks\n\nOn Amara:https:\/\/amara.org\/es\/videos\/05r8C53gJPjk\/info\/courage-under-fire-rabia-siddique-tedxperth\/\n\nTo preview on YouTube:\nhttps:\/\/www.youtube.com\/watch?language=en&v=aDIeCPmojes","updated_time":"2015-05-10T06:46:25+0000","id":"43410681471_10152773151741472"},{"message":"An international community of volunteer translators and transcribers who are passionate about \"Ideas Worth Spreading\"\n\nNew members are approved regularly. However, if you need urgent help and have not yet been approved as a member of this group, please send us an email to translate\u0040ted.com.\n\nhttp:\/\/www.ted.com\/participate\/translate\nhttp:\/\/translations.ted.org\/wiki\ntinyurl.com\/OTPLearningSeries\nhttps:\/\/twitter.com\/tedotp\n\nFor support, please contact:\ntedsupport\u0040universalsubtitles.org (Amara issues)\nor\ntranslate\u0040ted.com (everything else)\n\n***Group etiquette***\n1. Posts should be related to translation, languages and the Open Translation Project.\n\n2. Be respectful toward others at all times. Racism, discrimination and inflammatory posts are prohibited.\n\n3. Do not post advertising material\/spam.\n\n4. Posting about bugs should be avoided. Please send your bug reports to tedsupport\u0040amara.org or translate\u0040ted.com\n\n5. Refrain from posting transcript corrections. Please send your corrections to translate\u0040ted.com","story":"Krystian Aparta updated the description of the group I Translate TEDTalks.","updated_time":"2015-05-09T11:36:39+0000","id":"43410681471_10152772274156472"},{"message":"An international community of volunteer translators and transcribers who are passionate about \"Ideas Worth Spreading\"\n\nMembers are approved regularly. However, if you need urgent help and have not been approved as a member of this group yet, please send us an email to translate\u0040ted.com.\n\nhttp:\/\/www.ted.com\/participate\/translate\nhttp:\/\/translations.ted.org\/wiki\ntinyurl.com\/OTPLearningSeries\nhttps:\/\/twitter.com\/tedotp\n\nFor support, please contact:\ntedsupport\u0040universalsubtitles.org (Amara issues)\nor\ntranslate\u0040ted.com (everything else)\n\n***Group etiquette***\n1. Posts should be related to translation, languages and the Open Translation Project.\n\n2. Be respectful toward others at all times. Racism, discrimination and inflammatory posts are prohibited.\n\n3. Do not post advertising material\/spam.\n\n4. Posting about bugs should be avoided. Please send your bug reports to tedsupport\u0040amara.org or translate\u0040ted.com\n\n5. Refrain from posting transcript corrections. Please send your corrections to translate\u0040ted.com","story":"Krystian Aparta updated the description of the group I Translate TEDTalks.","updated_time":"2015-05-09T11:34:39+0000","id":"43410681471_10152772269861472"},{"message":"Hey guys I need help... I'm trying to translate the a 15 minute Ted talk but in the time line only appears 3:56 minutes... What whould I do? Thank you","updated_time":"2015-05-08T20:03:37+0000","id":"43410681471_10152765442326472"},{"message":"Hi there! I translated these videos from English to Spanish some weeks ago but I can't find LCs to approve them. Is there anyone here who could help, please? Thanks a lot!!\n\nhttp:\/\/www.amara.org\/en\/videos\/dOIpFmJxtYA1\/info\/cosmology-and-the-arrow-of-time-sean-carroll-tedxcaltech\/\n\nhttp:\/\/www.amara.org\/en\/videos\/jgTzbDncMdPq\/info\/getting-smart-about-learning-wissam-yafi-tedxbeirut\/\n\nhttp:\/\/www.amara.org\/en\/videos\/DEsSDUlkRtS5\/info\/the-joy-of-less-kim-coupounas-tedxboulder\/\n\nhttp:\/\/www.amara.org\/en\/videos\/mbh0CMSJLJjr\/info\/tedx-as-the-journey-progresses\/","updated_time":"2015-05-07T17:00:50+0000","id":"43410681471_10152769595306472"},{"message":"Dear Finnish Translators! \n\nIf you have a Finnish facebook group, let us know so we can add it to the list of Language groups on OTPedia. And please note there are a few review tasks awaiting for you: http:\/\/www.amara.org\/en\/teams\/ted\/tasks\/?project=any&lang=fi&type=Review&sort=-created Thanks!","updated_time":"2015-05-07T11:16:56+0000","id":"43410681471_10152769163601472"},{"message":"Hi all TED(x) fans and translators!\n\nJust a quick question to all of you: has anyone of you tried to conduct (or has come across) any scientific research on TED Talks subtitling in English (and, possibly, Polish?). I'm trying to delve into the topic and I'd appreciate any help with the resources or previous studies in that area.\n\nThanks in advance!","updated_time":"2015-05-07T10:39:30+0000","id":"43410681471_10152769162476472"},{"message":"Tips and guides about translation market and targeting both translators and translation clients.\nUsing 3d Cartoon characters, a short videos from 2 - 8 minutes with board and effects, the screen make the video as a short course about subject in translation industry.\nhttps:\/\/www.facebook.com\/Freelance.Translator.Compass","updated_time":"2015-05-06T07:50:51+0000","id":"43410681471_10152755052766472"},{"message":"If you are American, please sign this petition of a friend of mine. It is a very important issue, especially for us contributing to TED and TEDx, it should be essential. Think about it. „smile“-Emoticon\n","updated_time":"2015-05-06T07:50:41+0000","id":"43410681471_10152756523236472"},{"updated_time":"2015-05-06T07:50:35+0000","id":"43410681471_10152764158056472"},{"message":"Hello,\nCould any of the LCs out there please approve this talk? It is really interesting and it has been waiting for some time now to be approved and translated into other languages. Thank you in advance, whoever (and wherever) you are!\n","updated_time":"2015-05-04T19:01:54+0000","id":"43410681471_10152762818671472"},{"message":"Hello,\nCould any of the LCs out there please review then approve this talk? It is really interesting and it has been waiting for some time now to be approved and translated into other languages. Thank you in advance, whoever (and wherever) you are!\n","updated_time":"2015-05-04T18:08:13+0000","id":"43410681471_10152762821481472"},{"message":"Hi! I found a typo in http:\/\/amara.org\/pl\/videos\/kNZQLo79imcn\/en\/964732\/. In 0:51 should be written \"angry\" instead of \"anrgy\". Please fix it! ;-)","updated_time":"2015-05-04T17:36:48+0000","id":"43410681471_10152756488346472"},{"message":"Maybe you'd like to share this information about this 5 week free on line MOOC with some of your friends or colleges. The course \"Powerful Tools for Teaching and Learning: Web 2.0 Tools\" has just started! ","updated_time":"2015-05-04T16:30:28+0000","id":"43410681471_10152762647741472"},{"message":"Is there Esperanto group for TEDTalks for Translators?","updated_time":"2015-05-01T06:13:04+0000","id":"43410681471_10152753572621472"},{"message":"Dear all Indonesian reviewers,\nPlease someone approve the translation for this video https:\/\/www.amara.org\/en\/videos\/26NjkgOEYcOb\/url\/1467319\/\nIt's been waiting for almost 3 weeks.... Your help will be really appreciated.\nThank you very much in advance.","updated_time":"2015-04-30T07:18:32+0000","id":"43410681471_10152753557136472"},{"message":"Hola! Gracias por los tutoriales de la OTPedia, subtitulados al español. He observado que los cambios de línea aparecen en youtube como [br]. ¿Puede alguien corregirlo? Gracias :)","updated_time":"2015-04-30T01:54:09+0000","id":"43410681471_10152751514521472"},{"message":"Hey guys! \nAs I was cleaning up my computer, I ran into this pic and I'd like to share it with you. I don't remember when and when I found it on the Internet, but it's worth sharing.","updated_time":"2015-04-29T19:38:42+0000","id":"43410681471_10152751500656472"},{"message":"Can someone subtitle this talk that happened at our B-School.\n\nI am new here, I don't know how the subtitling is done. Someone kindly guide me?\n\n","updated_time":"2015-04-29T14:00:40+0000","id":"43410681471_10152751702856472"},{"message":"Hello Everyone! Please note there is a new Estonian group for translators! \nIt can be found here: https:\/\/www.facebook.com\/groups\/1581915285395891\/","updated_time":"2015-04-27T12:04:30+0000","id":"43410681471_10152747018096472"},{"message":"Hello, could any of the LCs please approve this talk? It has been waiting for an approval for almost 3 months now, so... it would be really appreciated. Thank you in advance.\n","updated_time":"2015-04-27T00:18:12+0000","id":"43410681471_10152737168081472"},{"message":"Hello. I am working on this video reviewing Japanese subtitle:\nhttps:\/\/amara.org\/ja\/videos\/jCHaizl6256k\/info\/the-secret-lives-of-paintings\/\nWhen I thought I finished everything and tried to press 'approve' button, it did not work. Instead there came words: Error saving subtitles. \nThis is the third time I've ever seen this. Is it an amara's bug? or is there anything I could do to complete my  task without doing all over again? \nThank you.","updated_time":"2015-04-26T08:32:40+0000","id":"43410681471_10152736503836472"},{"message":"Maybe you'd like to share this information about this 5 week free MOOC\nwith some of your friends or peers\n","updated_time":"2015-04-24T13:29:25+0000","id":"43410681471_10152721609556472"},{"message":"You may be interested to join this on line course for free\n","updated_time":"2015-04-22T08:43:45+0000","id":"43410681471_10152736574776472"},{"message":"You may be interested to join this on line course for free\n","updated_time":"2015-04-22T08:31:02+0000","id":"43410681471_10152736574006472"},{"message":"Call to anyone interested, in any language, this talk by our dear friend Anwar is ready for you ","updated_time":"2015-04-21T20:11:56+0000","id":"43410681471_10152735531916472"},{"message":"Could any of the LCs approve this talk ?\nhttp:\/\/amara.org\/en\/videos\/LBlYyjLGZbmW\/en\/247588\/","updated_time":"2015-04-21T17:22:36+0000","id":"43410681471_10152725611076472"},{"message":"Hello! \nwho would like to translate the journey of merging roots with rock? enjoy & let me know :) thanks!","updated_time":"2015-04-20T13:27:58+0000","id":"43410681471_10152732596606472"},{"message":"Hi, everyone,\n\nTuesday TEDTalk - Eduardo Saenz de Cabezon: ¿Para qué sirven las matemáticas? - comes from TEDxRiodelaPlata. Thanks again to everyone who participated in the transcription and translation of this talk, and helped us discover it!\n\nBoth videos are available for translation on Amara:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/C26bojdYt3P9\/info\/para-que-sirven-las-matematicas\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/f5v8woik8I45\/info\/las-matematicas-son-para-siempre-eduardo-saenz-de-cabezon-tedxriodelaplata\/?tab=video","updated_time":"2015-04-19T16:22:17+0000","id":"43410681471_10152707533841472"},{"message":"Hello all! I would please like to ask the language manager to approve the english subtitles for this talk. Thank you for your help! \n","updated_time":"2015-04-17T13:31:47+0000","id":"43410681471_10152721728771472"},{"message":"Dear translators, I am trying to list the TED Talk and TEDx Talks related to human brain and computer interfaces such as \nhttp:\/\/www.ted.com\/talks\/tan_le_a_headset_that_reads_your_brainwaves\nor \nhttps:\/\/www.ted.com\/talks\/miguel_nicolelis_brain_to_brain_communication_has_arrived_how_we_did_it\nAny other idea? Thank you very much in advance for your input!","updated_time":"2015-04-17T13:04:33+0000","id":"43410681471_10152725637156472"},{"message":"TEDxJerusalem is happening TODAY - You are more than welcome to join us live at: http:\/\/www.tedxjerusalem.com\/tedxjerusalem-2015-live\/ starting at 9:30 am (Israel Time).","updated_time":"2015-04-17T05:18:33+0000","id":"43410681471_10152719098566472"},{"message":"Today Amara released several changes which should improve your subtitling experience:\n\n1. In the editor, each subtitle now has an option menu, which can be accessed by hovering over the wrench icon. (see image)\n\nMenu options include: seeking the video to the point where the subtitle plays, inserting a subtitle above \/ below the active subtitle, deleting the subtitle, and adding a time-coded note associated with the subtitle.\n\n2. New keyboard shortcuts (see image)\n\n3. SHIFT + SPACE no longer triggers the video to play or pause\n\n4. Subtitles with invalid timestamps won’t be allowed (i.e. two subtitles which start and end at the same time)\n\n5. When comparing two revisions, red text indicates the text has changed. A red box outlining the time codes indicates a timing change. (see image)","updated_time":"2015-04-16T18:48:39+0000","id":"43410681471_10152724130006472"},{"message":"Hi translators,\n\nThe BestofTEDxTalks Project on Amara contains some of the selected talks that are still missing either a transcript or English translation or both.\n\nOnce a talk is translated into English, it is reviewed and considered for distribution through playlists and TED partners, so don't miss a chance to share ideas from your community and language with the global audience! Choose to transcribe or translate one of the talks in this folder.\n\n","updated_time":"2015-04-16T12:04:10+0000","id":"43410681471_10152723560801472"},{"message":"Hi everyone,\n\nThe Tuesday TEDTalk of the day - Takaharu Tezuka: The best kindergarten you’ve ever seen - comes from TEDxKyoto.\n\nBoth videos are available for translation:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/fJ0o8udkkCnZ\/info\/the-best-kindergarten-youve-ever-seen\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/Pao3kGG3dfFn\/info\/the-best-kindergarten-youve-ever-seen-takaharu-tezuka-tedxkyoto\/","updated_time":"2015-04-16T06:59:35+0000","id":"43410681471_10152723237566472"},{"message":"This talk is really interesting and cute, talking about this incredible and adorable animal: the penguin! It needs approval and I would like to ask you, LCs out there, to take a moment of your precious time to approve it for me. Greatly appreciated.\n","updated_time":"2015-04-16T00:15:34+0000","id":"43410681471_10152712483516472"},{"message":"Do you want to be part of the year of sisu? Do you in fact, have sisu?\nWordlovers, do you know what sisu is?\nHere's a wonderful talk by Emilia Lahti ","updated_time":"2015-04-15T18:57:32+0000","id":"43410681471_10152717569731472"},{"message":"Could any of the wonderful LCs out there approve this talk for me? It is really interesting and the translators would love to have an opportunity to translate it into their languages. Thank you in advance!\n","updated_time":"2015-04-14T20:52:31+0000","id":"43410681471_10152712478716472"},{"message":"This talk http:\/\/www.amara.org\/en\/videos\/Mgow3HUxsguf\/zh-cn\/954245\/ is going to make everyone think a little more serious about American's poverty people. It may pair with Nick Hanauer's talk:www.amara.org\/…\/beware-fellow-plutocrat-the-pitchforks-are…\/. I Just finished simplified Chinses translation. Hope another translator help to review it as soon as possible.","updated_time":"2015-04-14T07:00:52+0000","id":"43410681471_10152718839291472"},{"message":"Hello, could anybody review and approve the italian version of this talk, please?\n\nhttps:\/\/amara.org\/it\/videos\/NZHy0xlK6lKq\/info\/redefining-beauty-rick-guidotti-tedxeast\/\n\nThank you so much.","updated_time":"2015-04-13T15:32:09+0000","id":"43410681471_10152717984686472"},{"message":"Hi translators,\n\nToday's TEDTalk of the day - Barat Ali Batoor: My desperate journey with a human smuggler - comes from TEDxSydney.\n\nBoth videos are available for translation on Amara:\n\nTEDTalk: http:\/\/www.amara.org\/en\/videos\/YpKajaOutX53\/info\/my-desperate-journey-with-a-human-smuggler\/?tab=video\n\nTEDxTalk: http:\/\/www.amara.org\/en\/videos\/fxr5e512B8nb\/info\/my-desperate-journey-with-a-human-smuggler-barat-ali-batoor-tedxsydney\/?tab=video","updated_time":"2015-04-10T16:36:40+0000","id":"43410681471_10152712082941472"},{"message":"Hey guys, can u help choose the theme?\n\nhttps:\/\/www.facebook.com\/permalink.php?story_fbid=359447990915266&id=351746778352054","updated_time":"2015-04-09T16:19:53+0000","id":"43410681471_10152709945391472"},{"message":"Hello everyone :)\nIm new at TED subtitling and I just finished translating the video above but, the sync button, it just wont press. \nWould really want to know how to solve it.\nThank you in advance :)","updated_time":"2015-04-08T19:49:12+0000","id":"43410681471_10152708344736472"}],"paging":{"previous":"https:\/\/graph.facebook.com\/v2.5\/43410681471\/feed?limit=500&since=1461175284&access_token=CAACEdEose0cBADcNP15dZCo4PZBPQj0nRAIvNtIZBRxUBq6XrLW4APTaRBOfvbKliEBwIjHGkhkhYDM94X35CwZCojtXJGvAl938KF4cG2SioZC2VpOUNtba2ytwWFibhnlcWzp3kQRYHo1y1GXfFBkHszwHKP1u4o33EZBjgfZBIul3a47jQLdDVw8RbKscWh5Q1irFELEprexjQoDkGsN&__paging_token=enc_AdB4bJVVP74a1INuqg34DsTKPG1dRxYAxoj4uq53LZBOs9rEIO1OMZAGVyZCmYBkIjFaOZCSXSxZBbnRVZBAykZCWZCZASZAWj&__previous=1","next":"https:\/\/graph.facebook.com\/v2.5\/43410681471\/feed?limit=500&access_token=CAACEdEose0cBADcNP15dZCo4PZBPQj0nRAIvNtIZBRxUBq6XrLW4APTaRBOfvbKliEBwIjHGkhkhYDM94X35CwZCojtXJGvAl938KF4cG2SioZC2VpOUNtba2ytwWFibhnlcWzp3kQRYHo1y1GXfFBkHszwHKP1u4o33EZBjgfZBIul3a47jQLdDVw8RbKscWh5Q1irFELEprexjQoDkGsN&until=1428522552&__paging_token=enc_AdCr3B2Nd4ScY6ZBOTA6HYi7pCiuDiGHew1mfyllS4y6t4X5rOZBetWKlMWtRnzZB7a50VZAlhkC0cU0enCHblnBH0ZBR"}},"id":"43410681471"}