{"feed":{"data":[{"updated_time":"2016-04-21T02:21:38+0000","id":"394462630661212_963973790376757"},{"message":"Some nice guns for sell at NORTH EAST FIREARMS....","updated_time":"2016-04-21T01:52:00+0000","id":"394462630661212_963970697043733"},{"message":"Losing Customers....\n","updated_time":"2016-04-20T21:01:34+0000","id":"394462630661212_963869713720498"},{"message":"Can you believe this???\n\nA federal court this week ruled that a public high school may not provide separate restrooms and locker rooms on the basis of biological sex!!!\n\nUse your vote to elect leaders with some common sense.\n\n","updated_time":"2016-04-20T15:04:26+0000","id":"394462630661212_963683670405769"},{"message":"It is time for a do-nothing Congress to grow some stones. Decades of abdicating responsibility have produced an imperial president, a legislating SCOTUS, and hordes of incompetent bureaucrats.\n\nIt is time that Congress start using some of its powers, including the power to impeach, starting with the IRS Commissioner.\n\n","updated_time":"2016-04-20T14:00:21+0000","id":"394462630661212_963666883740781"},{"message":"Congress should reject Obama’s Climate Change Treaty for several reasons. The main reason is that the regulations will have no meaningful impact on the planet’s temperature.\n\nEven if government closed all businesses and eliminated their CO2-emitting activities (doing away with all associated US jobs), there would be less than two-tenths of one degree Celsius reduction in global temperatures!!!\n\n","updated_time":"2016-04-20T13:37:05+0000","id":"394462630661212_963650213742448"},{"updated_time":"2016-04-20T13:09:57+0000","id":"394462630661212_963635897077213"},{"updated_time":"2016-04-20T13:09:27+0000","id":"394462630661212_963635780410558"},{"updated_time":"2016-04-20T13:09:10+0000","id":"394462630661212_963635647077238"},{"message":"A bi-partisan congressional committee has been investigating medical practices of abortion service providers and whether or not procurement organizations were engaged in illegally selling fetal tissue for profit.\n\nSome information has been released, including prices being paid for baby body parts and an indication of groups involved. This story has legs and more will be released.\n\n","updated_time":"2016-04-20T13:01:52+0000","id":"394462630661212_963633230410813"},{"updated_time":"2016-04-20T12:32:15+0000","id":"394462630661212_963620303745439"},{"message":"If it isn't Mr Trump, it will be the nominee of the Establishment's choosing...and it will not be Cruz either. Since when has the Establishment been all for a \"Conservative\"? The Establishment has kept Kasich there for this very reason.","updated_time":"2016-04-20T10:40:27+0000","id":"394462630661212_963568347083968"},{"message":"THIS IS INSANE!!! ","updated_time":"2016-04-20T08:28:44+0000","id":"394462630661212_963239263783543"},{"updated_time":"2016-04-20T04:01:42+0000","id":"394462630661212_963388270435309"},{"message":"We can thank Obama and Clinton for their failed “reset” policy toward Russia that has projected American weakness in world affairs and resulted in Russian aggression, such as the “buzzing” of an American warship in international waters.\n\nThe Pentagon has rotated a Brigade Combat Team back to Europe that includes a couple hundred tanks, armored vehicles and artillery pieces that will join 60,000-plus Americans already in Europe. \n\nWhat could possibly go wrong with an Obama escalation and more Russian mischief???\n\n","updated_time":"2016-04-20T01:39:34+0000","id":"394462630661212_963324100441726"},{"message":"Remember the promise, “if you like your doctor, you can keep your doctor?” This promise will be broken again as the largest insurer in America, UnitedHealthcare, loses $720 million on ObamaCare exchanges and is expected to announce that it is dropping coverage in additional states.\n\nAfter ObamaCare coerced millions of people into coops and mandated the purchase of insurance people did not need or could not afford, more than half of the original 23 ObamaCare exchanges have already closed. \n\n","updated_time":"2016-04-20T01:05:32+0000","id":"394462630661212_963308723776597"},{"message":"NYC COP gets no jail time for manslaughter and negligent criminal homicide??? ARE YOU SERIOUS?? Please join our FREE Wrongful Imprisonment, Criminal Justice Reform Forum at http:\/\/www.illegalincarceration.com\/forum-.html\nGet involved, debate topics, ANYTHING GOES!!!! Get your case showcased now! Launched 4\/19\/16.","updated_time":"2016-04-20T00:14:55+0000","id":"394462630661212_963289947111808"},{"message":"Trump revolution is happening!!! #VoteTrump\n","updated_time":"2016-04-19T23:58:43+0000","id":"394462630661212_963221097118693"},{"message":"This week Obama visits Saudi Arabia – a country deep in turmoil. And according to this report, Obama is “the source of no small share of this nation’s anxiety.” The President’s foreign policy failures have come a long way since his speech to the Muslim world in Cairo in 2009 to create a huge chill between the US and key middle east allies.\n\n","updated_time":"2016-04-19T22:51:40+0000","id":"394462630661212_963264453781024"},{"updated_time":"2016-04-19T22:19:55+0000","id":"394462630661212_963253713782098"},{"message":"A perfect storm has developed at the federal level where the balance of powers is slipping away.\n\nObama once said he is not an emperor and that his job is to execute the laws that are passed. Congress over the years has abdicated its power by passing legislation empowering the executive branch to do some of its work. The judicial branch has legislated rather than limited its role to interpreting laws.\n\nNow Obama promises “audacious executive action” in his final year. If the Supreme Court does not restore a balance of power in its ruling on Obama’s Executive Amnesty, then we will become more a government of men, rather than of laws.\n\n","updated_time":"2016-04-19T20:16:20+0000","id":"394462630661212_963206070453529"},{"updated_time":"2016-04-19T18:17:06+0000","id":"394462630661212_963151833792286"},{"updated_time":"2016-04-19T17:56:13+0000","id":"394462630661212_963142817126521"},{"message":"Question: To those who have called me a conspiracy theorist in the past, if our economy is doing so well (and has gotten better under the Obama administration; how could one (1) corporation be such a big threat to the US? \nThe US dollar is about to implode. If you hear about a virus or hackers who have hit the banking system (like on a Friday, and won't reopen until Monday) then you better get ready FAST! If that does happen you will have 72 hours to get into position for martial law (in other words away from the city). Your Windows of opportunity boils down to this:\nHOURS 0-24 free movement\nHOURS 24-48 only back roads\nHours 48+ you are screwed, and by foot is your only possible (not probable) option.\nThis has been your public service warning.","updated_time":"2016-04-19T16:33:47+0000","id":"394462630661212_963104917130311"},{"message":"When you read this article, replace the following:\n\n1) “..refugee camp in Turkey..” with “..refugee camp in America..”\n2) “..German Chancellor Angela Merkel..” with “..US President Barack Obama..”\n\nAnd you have a prophesy of what will happen here.\n\n","updated_time":"2016-04-19T14:27:10+0000","id":"394462630661212_963049403802529"},{"updated_time":"2016-04-19T13:09:53+0000","id":"394462630661212_963018663805603"},{"message":"Even The Los Angeles Times got this one correct: The new $15\/hour minimum wage will cause the last remaining survivors of the garment manufacturing industry to leave CA.\n\n","updated_time":"2016-04-19T04:04:38+0000","id":"394462630661212_962789883828481"},{"updated_time":"2016-04-19T02:01:37+0000","id":"394462630661212_962745200499616"},{"message":"God made man and God made woman, nothing in between. Stay in your own bathroom.","updated_time":"2016-04-19T01:37:21+0000","id":"394462630661212_962714550502681"},{"updated_time":"2016-04-18T21:00:59+0000","id":"394462630661212_962625910511545"},{"message":"Here is documentation of the government’s global warming scam and fraud. Note how even NASA data was altered.\n\nThe federal government with its climate change zealots skews science data and pressures scientists to support their climate change religion. State Department documents “give detailed instructions on how to change the IPCC’s science document and the summary for policymakers”. \n\n","updated_time":"2016-04-18T20:59:48+0000","id":"394462630661212_962625523844917"},{"updated_time":"2016-04-18T17:21:53+0000","id":"394462630661212_962525047188298"},{"updated_time":"2016-04-18T16:57:42+0000","id":"394462630661212_962516427189160"},{"message":"ALASKA HOUSE AND SENATE PASS THE COUNTERMAND AMENDMENT APPLICATION ON CONGRESS AND DELEGATE RESOLUTION.\n\nWE THE PEOPLE WON!!!  AMERICA WON!!!  OUR CONSTITUTIONAL REPUBLIC WON!!!  PRAISE THE LORD FOR HIS MERCIES AND GOODNESS.  WE DID NOT QUIT, WE PERSEVERED AND GOD GAVE US THE VICTORY.  \n\nThe Alaska House Sunday and Senate today passed with overwhelming margins and with bi-partisan support (3 democrats and 1 independent) both the Article V Countermand Amendment ‘Application’ on Congress and the Delegate Resolution.  \n\nWe made Constitutional history today and it is going to change the course of our Constitutional Republic forever.\n\nTHE COUNTERMAND AMENDMENT IS AMERICA’S MOST IMPORTANT CONSTITUTIONAL EVENT SINCE THE 1787 CONVENTION.  \n___________________\n\nVIDEO - NON PARTISAN SINGLE ISSUE ARTICLE 5 COUNTERMAND AMENDMENT   Stop Federal Encroachment on States Rights & Personal Liberties.  Go to:  ","updated_time":"2016-04-18T14:07:48+0000","id":"394462630661212_962423830531753"},{"message":"The Obama Administration sides with Saudi Arabia and against US 911 victims.\n\nSeems that Obama is willing to be blackmailed by Saudi Arabia’s threat to sell billions in US assets if US releases classified report on Saudi Arabia’s involvement in the 911 attack.\n\nIn addition to abandoning 911 victims this leads to the question: What additional international blackmail is this feckless president inviting? China blackmail US with a threat to call US debt if US resists Chinese aggression in the South China Sea? Russia blackmail US with threats if US develops some backbone to resist Russian aggression in the Baltics?\n\n","updated_time":"2016-04-18T13:54:08+0000","id":"394462630661212_962416313865838"},{"message":"http:\/\/www.latimes.com\/local\/lanow\/la-me-ln-lax-flight-arabic-student-southwest-20160418-story.html","updated_time":"2016-04-18T11:32:32+0000","id":"394462630661212_962349667205836"},{"message":"What do you think about this?\n","updated_time":"2016-04-18T10:53:10+0000","id":"394462630661212_960292607411542"},{"message":"Absolute power corrupts if you follow the money, the Saudi money, you will find it transcends several American presidential administrations.","updated_time":"2016-04-18T01:51:52+0000","id":"394462630661212_962152733892196"},{"updated_time":"2016-04-18T00:51:07+0000","id":"394462630661212_962130320561104"},{"message":"http:\/\/www.upi.com\/Top_News\/US\/2016\/04\/17\/Supreme-Court-takes-up-Obama-immigration-policy\/5191460912897\/","updated_time":"2016-04-17T22:27:43+0000","id":"394462630661212_962080173899452"},{"story":"Bob Scott shared The Conservative Outpost's post to the group: Constitutional Patriots.","updated_time":"2016-04-17T21:23:43+0000","id":"394462630661212_962057290568407"},{"message":"This must be stopped!!!\n","updated_time":"2016-04-17T19:34:56+0000","id":"394462630661212_962018657238937"},{"updated_time":"2016-04-17T13:41:01+0000","id":"394462630661212_961846783922791"},{"updated_time":"2016-04-17T08:23:37+0000","id":"394462630661212_961613800612756"},{"updated_time":"2016-04-17T04:52:49+0000","id":"394462630661212_961613797279423"},{"message":"This is so tragic.... Prayers for the victims and their families... ","updated_time":"2016-04-17T01:17:56+0000","id":"394462630661212_961526643954805"},{"message":"Obama giving his fellow suicide bombers a free pass to the USA.","updated_time":"2016-04-17T00:27:14+0000","id":"394462630661212_961506097290193"},{"message":"Why bail out Puerto? Possibly because some of the money is needed to pay off Obama cronies, such as a $3.4MM contract to Obama senior staffers Anita Dunn and Bill Burton, to handle public relations, including $500,000 for paid advertising to promote the bailout… and $52.5 million to a former official of the US Treasury Department … and $37 million to a Manhattan law firm … and the list goes on.\n\nIf you want your tax dollars wasted like that…then be my guest. If not contact your US Representative and demand that they OPPOSE Obama’s bailout of Puerto Rico.  U.S. Representative Will Hurd \n\n","updated_time":"2016-04-16T22:34:45+0000","id":"394462630661212_960350614072408"},{"updated_time":"2016-04-16T20:25:16+0000","id":"394462630661212_961423830631753"},{"updated_time":"2016-04-16T19:58:09+0000","id":"394462630661212_961415657299237"},{"message":"Trump responds to Facebook anti-Trump poll on Fox & Friends.. This is my man! This is mr.PRESIDENT!!!!\n","updated_time":"2016-04-16T19:49:05+0000","id":"394462630661212_961412583966211"},{"updated_time":"2016-04-16T17:57:28+0000","id":"394462630661212_961311873976282"},{"message":"Ignoring the obvious HYPOCRISY, California Union Leaders, who were the driving force behind raising the minimum wage to $15 \/ hour, now want to be exempt from the ordinances requiring that workers be paid $15.\n\nCities such as San Jose, Oakland, San Francisco, Long Beach, Chicago and Milwaukee have exemptions from minimum wage requirements for unions.\n\nIt seems when unions are given the choice between seeking clauses that strengthen their bargaining power or dropping them in the name of advocating for all workers, union members or otherwise, their allegiance is clear\n\n","updated_time":"2016-04-16T15:32:40+0000","id":"394462630661212_961245633982906"},{"message":"Who is waging a WAR ON WOMEN?\n\nDemocrat Examples:\nClinton Foundation pays Women Executives 38\u0025 less than Male Counterparts\nHillary Clinton paid her State Department Women Staff 28\u0025 less than Male Counterparts\nObama Administration pays Men 13\u0025 more than Women (No improvement since taking office)\n\nRepublican Examples:\nDonald Trump Organization executive positions – all companies – 57\u0025 Women and 43\u0025 Men; Women Executives’ compensation is same or above that of Men Executives.","updated_time":"2016-04-16T14:56:48+0000","id":"394462630661212_961230080651128"},{"updated_time":"2016-04-16T13:34:41+0000","id":"394462630661212_961189550655181"},{"message":"Read \"TRADE OF TERROR: BLOOD MONEY,\" \nExplicitly written book provides rare insight of International crime and terrorism,\n\nEbook download: http:\/\/www.amazon.com\/Trade-Terror-Blood-Shabbir-Tankiwala-ebook\/dp\/B01E7DA6TA\/ref=sr_1_1?ie=UTF8&qid=1460599926&sr=8-1&keywords=trade+of+terror+blood+money\n\nPrint book: http:\/\/www.amazon.com\/Trade-Terror-Blood-Shabbir-Tankiwala\/dp\/1532734921\/ref=sr_1_2?ie=UTF8&qid=1460600165&sr=8-2&keywords=trade+of+terror+blood+money","updated_time":"2016-04-16T12:57:54+0000","id":"394462630661212_961171230657013"},{"updated_time":"2016-04-16T08:21:34+0000","id":"394462630661212_961066204000849"},{"message":"Breaking Fact Check: IS TRUMP A SOCIOPATH? Or is Cruz?\n","updated_time":"2016-04-16T04:59:23+0000","id":"394462630661212_960998940674242"},{"updated_time":"2016-04-16T02:58:22+0000","id":"394462630661212_960944954012974"},{"message":"Value That, Cruz! - New York GOP Gala Crowd Completely Ignores Canadian Candidate \n","updated_time":"2016-04-16T00:37:01+0000","id":"394462630661212_960393024068167"},{"message":"The War on Savings: The Panama Papers, Bail-Ins, and the Push to Go Cashless ~ see article here: http:\/\/wp.me\/p2X3AR-g5a","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-15T21:43:35+0000","id":"394462630661212_960816220692514"},{"message":"Now her support will go to “The Donald.”\n","updated_time":"2016-04-15T20:32:53+0000","id":"394462630661212_960786057362197"},{"updated_time":"2016-04-15T17:37:24+0000","id":"394462630661212_960693204038149"},{"message":"This Left Coast writer has it RIGHT\n\nSince you brought it up yet again, Donald: About Those New York Values ...\n","updated_time":"2016-04-15T15:35:23+0000","id":"394462630661212_960636527377150"},{"message":"Multiple federal agencies \"tighten screws\" on oil and gas companies\nRush Limbaugh said, \"I hope Obama fails\"\nBut Obama is succeeding in destroying our energy industry.\n\nWant to learn more? Listen to Mark Meckler live this Saturday at 11 AM Eastern\/10 Central. RSVP here: http:\/\/www.cosaction.com\/live_with_mark_meckler\n\nSign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750\nTell your state lawmakers to do the duty given to them by the Founders in Article V -- to protect you from an out-of-control federal government! Http:\/\/COSAction.com\/?recruiter_id=2750\n#COSPWeek  #COSProject","updated_time":"2016-04-15T15:15:16+0000","id":"394462630661212_960627674044702"},{"updated_time":"2016-04-15T14:58:56+0000","id":"394462630661212_960618844045585"},{"message":"So, can I sue Budweiser for a fatal DUI or can I sue Marlboro for cancer from 2nd hand smoke?  This is ridiculous!","updated_time":"2016-04-15T13:13:30+0000","id":"394462630661212_960563554051114"},{"story":"Skeeter Brewer shared Skeeter brewer's live video to the group: Constitutional Patriots.","updated_time":"2016-04-15T06:06:44+0000","id":"394462630661212_960411850732951"},{"updated_time":"2016-04-15T04:31:02+0000","id":"394462630661212_960376397403163"},{"updated_time":"2016-04-15T02:10:58+0000","id":"394462630661212_960319860742150"},{"updated_time":"2016-04-14T23:17:34+0000","id":"394462630661212_960267484080721"},{"message":"WOW! This one is definitely the most BADASS endorsement!!!\n\n","updated_time":"2016-04-14T23:13:22+0000","id":"394462630661212_960266270747509"},{"message":"Who had the best town hall this week? Vote here now! ","updated_time":"2016-04-14T20:39:53+0000","id":"394462630661212_960182537422549"},{"message":"Can you believe this???\nHouse leadership plans to fast-track the new debt restructuring bill for Puerto Rico in light of their $70 billion debt crisis. And a voice vote is planned to prevent a recorded vote!!\nTime to call Congressmen!!    U.S. Representative Will Hurd \n\n","updated_time":"2016-04-14T20:20:34+0000","id":"394462630661212_960175027423300"},{"message":"TRUMP 2016 all the way! All the rest of the people running are puppets to the same NWO puppet masters! If they steal this from trump ill never vote Republican again ever! I'm sick of the corruption.\n\n","updated_time":"2016-04-14T19:56:19+0000","id":"394462630661212_960164970757639"},{"message":"The War on Women continues on “Equal Pay Day”. The Obama Adm pays men about 16\u0025 more than women and The Clinton Foundation pays men almost 40\u0025 more than women.\n\nLooks like those who insincerely advocate for equal-pay-for-women have the most work to do to get equal.\n\nhttps:\/\/www.facebook.com\/permalink.php?story_fbid=1594880934105028&id=100007494092599&comment_id=1594916560768132","updated_time":"2016-04-14T18:59:06+0000","id":"394462630661212_960134854093984"},{"message":"CONSERVATIVES? Who is our enemy? HINT: It's NOT Trump, Cruz, o...CONSERVATIVES? Who is our enemy? HINT: It's NOT Trump, Cruz, or Kasich....\nDonald Trump is NOT our enemy. Ted Cruz is NOT our enemy. John Kasich is NOT our enemy. HILLARY CLINTON or BERNIE SANDERS IS. We always hear the moniker this is \"the most important election of our lifetimes.\" It's not. But it could be the LAST election of our lifetimes if we don't win. There are 4 or 5 Supreme Court Judges that are so old they can barely fog a mirror. Do we really want a liar leftist criminal like Hillary or a Quasi-Communist Socialist like Bernie nominating our judges?","updated_time":"2016-04-14T18:18:33+0000","id":"394462630661212_960116294095840"},{"message":"The Obama Administration’s inquisition against climate change deniers is underway. While the DOJ under Obama ignores Fast & Furious, Benghazi, Voter Fraud, IRS scandals, illegal e-mails and servers that endanger national security, etc, the DOJ initiates an inquisition against climate change-denying scientists.\n\nThe only way to characterize this DOJ action is as a blatant attempt to shut down free and open research and to intimidate and coerce those who disagree with their catastrophic climate change religion.\n\n","updated_time":"2016-04-14T15:53:02+0000","id":"394462630661212_960011944106275"},{"updated_time":"2016-04-14T15:30:10+0000","id":"394462630661212_960043030769833"},{"message":"The Article I Project (A1P) is something to support. A network of nine Senate & House members is working on legislation to roll back executive-branch overreach (enabled by congressional under-reach) with a goal to restore a more responsible, trustworthy government.\n\nToday laws (e.g. ObamaCare) are increasingly written by special interest people and processes designed to exclude public scrutiny and input at the expense of the American people. The Article I Project seeks to reverse this trend.\n\nPlease encourage your Senators and Representative to support A1P.   United States Senator Mike Lee    Jeb Hensarling\n\n","updated_time":"2016-04-14T14:58:42+0000","id":"394462630661212_960032087437594"},{"message":"Well, I am very glad to hear that!","updated_time":"2016-04-14T14:21:41+0000","id":"394462630661212_960013350772801"},{"message":"Liberal hypocrisy is astounding.\n\nLiberals say big money & big business in politics are bad, unless they support Hillary. Liberal rock stars want to follow their consciences, but small business owners like bakers and florists cannot. Liberals say that states that want to keep men out of women’s bathrooms are human rights violators, but Singapore and Cuba are great.\n\n","updated_time":"2016-04-14T13:39:41+0000","id":"394462630661212_960001917440611"},{"story":"Raymond Snow shared HuffPost Politics's video to the group: Constitutional Patriots.","updated_time":"2016-04-14T12:34:01+0000","id":"394462630661212_959953260778810"},{"updated_time":"2016-04-14T04:35:21+0000","id":"394462630661212_959772367463566"},{"story":"Bobbi Lyn shared The voice of the people's photo to the group: Constitutional Patriots.","updated_time":"2016-04-14T02:57:41+0000","id":"394462630661212_959718907468912"},{"message":"Read \"TRADE OF TERROR: BLOOD MONEY,\" \nExplicitly written book provides rare insight of International crime and terror,\n\nEbook download: http:\/\/www.amazon.com\/Trade-Terror-Blood-Shabbir-Tankiwala-ebook\/dp\/B01E7DA6TA\/ref=sr_1_1?ie=UTF8&qid=1460599926&sr=8-1&keywords=trade+of+terror+blood+money\n\nBook available on amazon.com\n\nPrint book: http:\/\/www.amazon.com\/Trade-Terror-Blood-Shabbir-Tankiwala\/dp\/1532734921\/ref=sr_1_2?ie=UTF8&qid=1460600165&sr=8-2&keywords=trade+of+terror+blood+money","updated_time":"2016-04-14T02:39:45+0000","id":"394462630661212_959734000800736"},{"message":"He has hated America way long before he became President.","updated_time":"2016-04-14T00:53:49+0000","id":"394462630661212_959691650804971"},{"updated_time":"2016-04-14T00:20:13+0000","id":"394462630661212_959588340815302"},{"message":"Would you vote for him?\n","updated_time":"2016-04-13T21:46:44+0000","id":"394462630661212_959614900812646"},{"message":"TRUMP 2016 all the way! All the rest of the people running are puppets to the same NWO puppet masters! If they steal this from trump ill never vote Republican again ever! I'm sick of the corruption.\n","updated_time":"2016-04-13T21:09:09+0000","id":"394462630661212_959597800814356"},{"updated_time":"2016-04-13T17:41:51+0000","id":"394462630661212_959511480822988"},{"message":"Lying – a very useful tool to promote social justice by an all-white, trans-black activist who gets confused about her “racial identity”. Rachel Dolezal, lies without blinking an eye, then doubles down. \n\nDoesn’t it sort of frighten you to think that she may want to become an “educator”?\n\n","updated_time":"2016-04-13T17:32:47+0000","id":"394462630661212_959506587490144"},{"updated_time":"2016-04-13T14:53:09+0000","id":"394462630661212_959411737499629"},{"story":"David McGarvey shared his post to the group: Constitutional Patriots.","updated_time":"2016-04-13T14:44:34+0000","id":"394462630661212_959403124167157"},{"story":"Colby Tanner shared Freedom Mudroom's photo to the group: Constitutional Patriots.","updated_time":"2016-04-13T14:30:42+0000","id":"394462630661212_959395200834616"},{"message":"Rubio you're scumbag!!! Why you support this cheater Cruz??? My vote is still for Trump! Trump tsunami is comming!!!!!!!\n","updated_time":"2016-04-13T14:30:38+0000","id":"394462630661212_958937797547023"},{"story":"Ken Crow shared his post to the group: Constitutional Patriots.","updated_time":"2016-04-13T11:00:27+0000","id":"394462630661212_959306870843449"},{"updated_time":"2016-04-13T05:26:53+0000","id":"394462630661212_959196474187822"},{"updated_time":"2016-04-13T03:08:14+0000","id":"394462630661212_959154427525360"},{"updated_time":"2016-04-13T02:00:12+0000","id":"394462630661212_959133300860806"},{"updated_time":"2016-04-13T01:26:06+0000","id":"394462630661212_959121867528616"},{"message":"Donald J. Trump just let the nation know who he would pick for attorney general... the left is HATING this announcement.\n\nGood for Trump... he just read our minds.\n\n","updated_time":"2016-04-12T23:46:54+0000","id":"394462630661212_959033577537445"},{"message":"Do you support him?\n","updated_time":"2016-04-12T23:13:18+0000","id":"394462630661212_959023347538468"},{"message":"trump needs envelopes","updated_time":"2016-04-12T20:37:47+0000","id":"394462630661212_958968227543980"},{"story":"Larry Hilt shared Charles Green's photo to the group: Constitutional Patriots.","updated_time":"2016-04-12T20:04:33+0000","id":"394462630661212_958955510878585"},{"message":"People each day are wrongfully imprisoned, and remain such for years. Some even die there innocently. Please, take 20 seconds to repost this link with this message as we all know someone who's been wronged by the law. Help make a difference.\n\nwww.illegalincarceration.com\n\nThank you.","updated_time":"2016-04-12T19:06:06+0000","id":"394462630661212_958934450880691"},{"message":"https:\/\/www.facebook.com\/washingtonstarnews\/posts\/1575309979464059\/ |","updated_time":"2016-04-12T17:56:12+0000","id":"394462630661212_958469024260567"},{"message":"What's Ted Cruz Hiding? - NJ Judge Hears Arguments On Secret Citizenship Docs \n","updated_time":"2016-04-12T17:54:41+0000","id":"394462630661212_958512244256245"},{"message":"http:\/\/l.facebook.com\/l.php?u=http\u00253A\u00252F\u00252Fthewashingtonstandard.com\u00252Fjudges-will-inform-jurors-jury-nullification-new-hampshire-bill-signed-law\u00252F&h=tAQHknllbhttp:\/\/l.facebook.com\/l.php?u=http\u00253A\u00252F\u00252Fthewashingtonstandard.com\u00252Fjudges-will-inform-jurors-jury-nullification-new-hampshire-bill-signed-law\u00252F&h=tAQHknllb","updated_time":"2016-04-12T17:48:19+0000","id":"394462630661212_958574777583325"},{"message":"Sheriff Clarke - Disconnected Obama Doesn't Believe A Thing He Said \n","updated_time":"2016-04-12T05:19:11+0000","id":"394462630661212_958578027583000"},{"updated_time":"2016-04-12T04:16:55+0000","id":"394462630661212_958542694253200"},{"message":"Convert To Cruz Or Else - Trump Delegate Stripped Of CO Credentials \n","updated_time":"2016-04-12T00:23:29+0000","id":"394462630661212_957985080975628"},{"updated_time":"2016-04-11T22:52:05+0000","id":"394462630661212_958409924266477"},{"message":"WARNING: A Climate Change Inquisition may be coming to your state.\n\nDemocrat Attorneys General in 15 states are treating their views of an unproven, controversial theory on climate change as an absolute, unassailable, and above critique fact. \n\nThey have announced that they will target any company that challenges their catastrophic climate change religion. Can you believe that this is happening in America?\n\n","updated_time":"2016-04-11T22:48:33+0000","id":"394462630661212_957711701002966"},{"message":"Tennessee Passes Bill Rejecting Gun Control Imposed By International Law Or Treaty ~ see article here: http:\/\/wp.me\/p2X3AR-g1i","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-11T19:13:32+0000","id":"394462630661212_958323147608488"},{"message":"Unbelievable !!! ","updated_time":"2016-04-11T14:21:15+0000","id":"394462630661212_958176437623159"},{"story":"Raymond Snow shared Uncle Sam's Misguided Children's video to the group: Constitutional Patriots.","updated_time":"2016-04-11T13:32:28+0000","id":"394462630661212_958152094292260"},{"message":"Want to learn more? Listen to Mark Meckler live this Saturday at 11 AM Eastern\/10 Central. RSVP here: http:\/\/www.cosaction.com\/live_with_mark_meckler\n\nTell your state lawmakers to do the duty given to them by the Founders in Article V -- to protect you from an out-of-control federal government! Http:\/\/COSAction.com\/?recruiter_id=2750\n#COSPWeek  #COSProject","updated_time":"2016-04-11T13:30:49+0000","id":"394462630661212_958151567625646"},{"message":"Has anyone seen the Denver Post?","updated_time":"2016-04-11T05:25:15+0000","id":"394462630661212_957955204311949"},{"updated_time":"2016-04-11T05:20:03+0000","id":"394462630661212_957953934312076"},{"message":"Made it past 3000 a day ahead- Now we're going for five thousand ! make it Happen !","updated_time":"2016-04-11T02:17:42+0000","id":"394462630661212_957888067651996"},{"message":"Doesn’t Hillary seem a little cozy here with John Podesta? He is a bundler for her campaign, chief lobbyist for the Russian Sberbank, and brother to John Podesta, former chief of staff for Bill Clinton.\n\nStay tuned as the Panama Papers disclose more of the dealings of the super rich.\n\n","updated_time":"2016-04-11T01:55:21+0000","id":"394462630661212_957874400986696"},{"message":"To those of you who truly care about our Vets\nThose who have asked us to describe PTSD.\nThis video is for you, to help you understand.\nVeteran Warning! Strong trigger content!\n\"Not One More Life\" Ride & Rally\nEVENT - https:\/\/www.facebook.com\/events\/1606622089576835\/","updated_time":"2016-04-11T01:18:54+0000","id":"394462630661212_957861804321289"},{"message":"To those of you who truly care about our Vets\nThose who have asked us to describe PTSD.\nThis video is for you, to help you understand.\nVeteran Warning! Strong trigger content!\n\"Not One More Life\" Ride & Rally\nEVENT - https:\/\/www.facebook.com\/events\/1606622089576835\/","updated_time":"2016-04-11T01:16:09+0000","id":"394462630661212_957861090988027"},{"message":"Donald J. Trump just let the nation know who he would pick for attorney general... the left is HATING this announcement.\n\nGood for Trump... he just read our minds.\n\n","updated_time":"2016-04-10T23:29:38+0000","id":"394462630661212_957826444324825"},{"message":"Voter fraud in the US is real and includes actions such as vote-buying, ineligible voting, false registrations, fraudulent use of absentee ballots, etc. Some opponents to stopping election fraud excuse these activities, saying that to control them would “restrict full and equal voting rights.”\n\nNothing could be further from the truth. Why should we care?\n\nCheck out this data base of 400 cases of voter fraud and judge for yourself whether these could impact election outcomes. Then contact True The Vote and become a volunteer at polling places.\n\n","updated_time":"2016-04-10T22:35:58+0000","id":"394462630661212_957805687660234"},{"updated_time":"2016-04-10T21:58:04+0000","id":"394462630661212_957790640995072"},{"message":"ZIRP: The Most Destructive Weapon Of Financial Mass Destruction In Existence ~ see article here: http:\/\/wp.me\/p2X3AR-g0Y","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-10T19:53:29+0000","id":"394462630661212_957746454332824"},{"message":"Anyone ever hear of Tony Podesta, one of the best-connected Democrats in the country whose brother John Podesta is former chief of staff for Bill Clinton? \n\nWhat a remarkable coincidence revealed by the Panama Papers:  Russia’s biggest bank, Sberbank, uses The Podesta Group as its lobbyist in Washington, DC. Wonder if Hillary is aware of that??? I’ll bet Bernie knows!!!\n\n","updated_time":"2016-04-10T17:16:34+0000","id":"394462630661212_957688311005305"},{"message":"The penalty for espionage should be the death penalty.. Putting the lives of our men and woman at risk is unforgivable!\n\n","updated_time":"2016-04-10T15:54:03+0000","id":"394462630661212_957649281009208"},{"message":"PayPal’s hypocrisy is despicable.\n\n","updated_time":"2016-04-10T15:23:36+0000","id":"394462630661212_957627004344769"},{"message":"I sent this message on my Congressman. You are welcome to use the text:\n\nPlease OPPOSE Obama’s plan to bailout Puerto Rico from its debt crisis, which the President frames as a bipartisan responsibility of the US government and Congress.\n\nThis is Puerto Rico’s crisis, not a responsibility of the American taxpayer. Under existing federal law, Congress would have to change the law to provide bankruptcy-like protection to Puerto Rico, creating a slippery slope encouraging financially irresponsible states like CA, IL, and NY to follow suit.\n\nPuerto Rico’s financial problems are so complex and far-reaching that bankruptcy alone will not solve them. The Detroit experience is a lesson to be learned. That city’s bankruptcy proceedings helped reduce debt, but did not leave the city with a recovery plan.\n\nBailouts and bankruptcies funded by hard working taxpayers are not the answer.\n\n","updated_time":"2016-04-10T04:45:18+0000","id":"394462630661212_957323777708425"},{"message":"What is WRONG with AMERICANS \nREALLY are all of you SO BLIND ... TRUTH is ONLY DONALD TRUMP!\n","updated_time":"2016-04-10T03:57:14+0000","id":"394462630661212_957098064397663"},{"updated_time":"2016-04-10T02:46:17+0000","id":"394462630661212_957276994379770"},{"message":"The Panama Papers may reveal how the Clintons went from “dead broke” to earning $100 million after leaving the White House.\n\nFor example, in lobbying for the Panama-United States Trade Promotion Agreement, Clinton paved the way for major banks and corporations, most notably the Deutsche Bank, to skirt national laws and regulations. After she resigned as Secretary of State, the Deutsche Bank paid her $485,000 for a speech.\n\nWith influence peddling like that, we can be sure that she will bring this whole sordid system of wheeling and dealing into the Whitehouse if elected.\n\n","updated_time":"2016-04-09T22:47:43+0000","id":"394462630661212_957186954388774"},{"message":"The way to win the debate is to take a strong forward position and stick with it.\n\nThat worked for Reagan with his 1981 tax cuts that triggered 90 months of economic growth and his Strategic Defense Initiative which forced the Soviets to abandon the arms race and agree to end the cold war at the bargaining table and not on the battlefield.\n\nConservatives can do it again with the president’s SCOTUS nominee as well as in the November elections!!\n\n","updated_time":"2016-04-09T22:18:01+0000","id":"394462630661212_957178854389584"},{"message":"Coutesy of Sean Arronge.....well stated!\n\nSee how delusional they are and talk about cowardly.The toughest vets are Trump supporters talking they need someone to lead them. The God damn ignorance in this country is outstanding the popular vote doesn't count. The people do not vote for the president of the United States one thing I know about the NWO they do not change the rules for you. Read the Constitution.\nYou show me where it says \"the popular vote shall be taken\" and \"the number of electors shall be chosen by each sate and apportioned according to the popular vote\" and I'll kiss your ass. I won't be kissing ass cause it's just not in there.\n\nU.S. Constitution\nArticle II\nSection 1.\n\nThe executive power shall be vested in a President of the United States of America. He shall hold his office during the term of four years, and, together with the Vice President, chosen for the same term, be elected, as follows:\n\nEach state shall appoint, in such manner as the Legislature thereof may direct, a number of electors, equal to the whole number of Senators and Representatives to which the State may be entitled in the Congress: but no Senator or Representative, or person holding an office of trust or profit under the United States, shall be appointed an elector.\n\nThe electors shall meet in their respective states, and vote by ballot for two persons, of whom one at least shall not be an inhabitant of the same state with themselves. And they shall make a list of all the persons voted for, and of the number of votes for each; which list they shall sign and certify, and transmit sealed to the seat of the government of the United States, directed to the President of the Senate. The President of the Senate shall, in the presence of the Senate and House of Representatives, open all the certificates, and the votes shall then be counted. The person having the greatest number of votes shall be the President, if such number be a majority of the whole number of electors appointed; and if there be more than one who have such majority, and have an equal number of votes, then the House of Representatives shall immediately choose by ballot one of them for President; and if no person have a majority, then from the five highest on the list the said House shall in like manner choose the President. But in choosing the President, the votes shall be taken by States, the representation from each state having one vote; A quorum for this purpose shall consist of a member or members from two thirds of the states, and a majority of all the states shall be necessary to a choice. In every case, after the choice of the President, the person having the greatest number of votes of the electors shall be the Vice President. But if there should remain two or more who have equal votes, the Senate shall choose from them by ballot the Vice President.\n\nThe Congress may determine the time of choosing the electors, and the day on which they shall give their votes; which day shall be the same throughout the United States.","updated_time":"2016-04-09T22:04:50+0000","id":"394462630661212_957174571056679"},{"message":"I am asking if everyone can or who wants to list the area in which you are in...I live in northeastern PA","updated_time":"2016-04-09T21:16:41+0000","id":"394462630661212_957125704394899"},{"message":"The only thing that will fix this nation is us, however the government has got to the point it is bigger than it needs and granting them the power to make changes. Executive powers should be stripped from any president. They are unconstitutional and everything needs congresses approval.....We need to meet up and have a good old fashion get together. We cannot communicate through facebook, or discuss anything as we are always being listened too. I can say this. I am tired of hearing the abuse and terroristic actions of law enforcement. They all of a sudden have the right to kill people. They are cops not God and people have the right to chose god as the only one allowed to take a life.","updated_time":"2016-04-09T21:08:17+0000","id":"394462630661212_957113894396080"},{"message":"We are the last defense against terrorism in our beloved country. We shall and will defend our freedom and our civilians against all threats.","updated_time":"2016-04-09T20:16:41+0000","id":"394462630661212_957127417728061"},{"message":"So excited that Gavin will be speaking at our event in Flint!!!\nFlint:\nhttps:\/\/www.facebook.com\/events\/468763869977251\/\nEscanaba: \nhttps:\/\/www.facebook.com\/events\/747798621986359\/","story":"Melissa Krystyniak shared her event to the group: Constitutional Patriots.","updated_time":"2016-04-09T19:52:35+0000","id":"394462630661212_957125764394893"},{"updated_time":"2016-04-09T18:41:24+0000","id":"394462630661212_957101301064006"},{"message":"WAIT WHAT?? ","updated_time":"2016-04-09T14:36:19+0000","id":"394462630661212_956686344438835"},{"updated_time":"2016-04-09T03:30:44+0000","id":"394462630661212_956726904434779"},{"message":"Donald J. Trump just let the nation know who he would pick for attorney general... the left is HATING this announcement.\n\nGood for Trump... he just read our minds.\n\n","updated_time":"2016-04-08T22:59:05+0000","id":"394462630661212_956625251111611"},{"message":"Former Deep Insider Pulls Back The Curtain On Global Financial Scam ~ see article here: http:\/\/wp.me\/p2X3AR-g0d","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-08T20:09:47+0000","id":"394462630661212_956544821119654"},{"message":"Just a reminder why we should vote for Trump!!! Share this everyone can see that Trump is right choice!!!\n","updated_time":"2016-04-08T19:26:09+0000","id":"394462630661212_956531571120979"},{"message":"- Twenty Two Soldiers -\nTwenty two soldiers died today\nTheir mind overwhelmed with fear\nFlagged casket lowered into the ground\nWhile loved ones shed a tear\n\nTwenty two soldiers died today\nTheir thoughts filled with despair\nI wish they’d found another way\nI wish they knew how much we care\n\nTwenty two soldiers died today\nKeep fighting, yes they tried\nToo many souls are lost this way\nEach one a victim – of Suicide\n\n© brian Crandall 06\/14\/2015\n\"NOT ONE MORE LIFE\" Ride & Rally \nSaturday, June 25 at 12 PM - 5 PM \nArea 2, Capital Grounds, Washington DC\nHosted by Defenders of Liberty MC\nThey fought for us ~ Now we fight for them\nFor more info go to:\nhttps:\/\/www.facebook.com\/events\/1606622089576835\/","story":"Tina Lane shared Brian Crandall's photo to the group: Constitutional Patriots.","updated_time":"2016-04-08T18:14:48+0000","id":"394462630661212_956502584457211"},{"message":"This not new. This has been known for decades but today it is real threat still with no protection.","updated_time":"2016-04-08T18:00:59+0000","id":"394462630661212_956461911127945"},{"message":"BREAKING...\n","updated_time":"2016-04-08T15:51:48+0000","id":"394462630661212_956440571130079"},{"message":"You just never know...\n","updated_time":"2016-04-08T12:33:08+0000","id":"394462630661212_955986421175494"},{"message":"DOES ANYONE KNOW ANYONE WRONGFULLY IMPRISONED? \n\nIf so, submit their case at the website below:\n\nwww.illegalincarceration.com\n\n100\u0025 Free Legal Representation for the Wrongfully Convicted. 0 Fees, EVER!","updated_time":"2016-04-08T08:58:59+0000","id":"394462630661212_956089831165153"},{"story":"June Pitts shared Supporting Donald J Trump's post to the group: Constitutional Patriots.","updated_time":"2016-04-08T05:11:00+0000","id":"394462630661212_956136077827195"},{"updated_time":"2016-04-08T04:27:30+0000","id":"394462630661212_956118267828976"},{"updated_time":"2016-04-08T03:58:56+0000","id":"394462630661212_956109467829856"},{"updated_time":"2016-04-08T02:15:43+0000","id":"394462630661212_956045207836282"},{"updated_time":"2016-04-08T02:14:39+0000","id":"394462630661212_956044874502982"},{"message":"American TAX BILL FOR 2016 is higher than food, clothing, and housing COMBINED!!!\n\nHelp shrink that tax bill & Sign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-04-08T02:08:13+0000","id":"394462630661212_956042334503236"},{"updated_time":"2016-04-07T23:13:44+0000","id":"394462630661212_955986214508848"},{"story":"Tommy Robert Mitchell shared Bret Baier's video to the group: Constitutional Patriots.","updated_time":"2016-04-07T20:32:43+0000","id":"394462630661212_955898867850916"},{"message":"Just a reminder why we should vote for Trump!!!\n","updated_time":"2016-04-07T20:28:10+0000","id":"394462630661212_955922741181862"},{"message":"Clinton Supported and Enabled Tax Evasion Revealed By the “Panama Papers” … Sanders OPPOSED It ~ see article here: http:\/\/wp.me\/p2X3AR-fYr","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-07T19:36:31+0000","id":"394462630661212_955903397850463"},{"updated_time":"2016-04-07T18:08:50+0000","id":"394462630661212_955842137856589"},{"message":"Unions\/Politicians Admit Minimum Wage Push About Political Power, Not the Workers ","updated_time":"2016-04-07T17:07:05+0000","id":"394462630661212_955815171192619"},{"message":"Hey Obama, look what your son did: Crack dealer freed early under Obama’s ‘racial discrimination’ plan commits mass murder.","updated_time":"2016-04-07T15:45:02+0000","id":"394462630661212_955729997867803"},{"message":"Remember the time an illegal alien from down Mexico way, by the name of, José Medellín, grabbed two young girls (14 and 16) in Texas, and raped and killed them?\nThe state of Texas found him guilty, and sentenced him to death. About ten years later, guess who gets involved? \"The International Court of Justice of the United Nations.\" THEY ruled that Texas had violated the Vienna Convention. The President of the United States, bowing to pressure from the United Nations, told Texas, they basically needed to release this illegal bastard.\nWell there was someone in Texas that doesn't think you should get to waltz into America, and kill our women and children and walk away scot-free. So he went to the Supreme Court, TWICE, to fight for justice for these poor girls. To fight for the states sovereignty from the Federal government, telling them what International Laws they had to follow.\nWell, that someone was Ted Cruz, and Ted Cruz won in the Supreme Court, the second time. José Medellín, later that year, got a lethal injection in the state of Texas. Jennifer Ertman, and Elizabeth Peña's families watched as that raping, murdous, illegal bastard died and went to Hell.\nThe President of the United States was actually angry that this happened. The establishment and the Liberal do-gooders, said this \"hurt US Mexico relations\" and Texas should have, \"Let; José; Medellín... go free.\" Well, thank God, Ted Cruz ISN'T one of the establishment and justice was served.","updated_time":"2016-04-07T15:15:01+0000","id":"394462630661212_955734761200660"},{"updated_time":"2016-04-07T14:22:57+0000","id":"394462630661212_955735344533935"},{"message":"SHARE SHARE SHARE EVERYWHERE\n\nTRUMP TALKS ABOUT HIS ONE YEAR OLD's BREASTS AND LEGS\n","updated_time":"2016-04-07T08:43:12+0000","id":"394462630661212_955478154559654"},{"updated_time":"2016-04-07T06:31:49+0000","id":"394462630661212_955506987890104"},{"message":"Listen to the chorus. This is for us Patriotic Americans. First of all, WE ARE AMERICANS. We MUST protect our freedoms NOW or we lose them. Period!!! Whether for Trump or for Cruz, AMERICA is what we all agree on. We are PATRIOTS and we must not allow anyone to divide us to conquer us any longer. Think about it my brother and sister American patriots.","updated_time":"2016-04-07T06:31:15+0000","id":"394462630661212_955506844556785"},{"updated_time":"2016-04-07T06:00:13+0000","id":"394462630661212_955496421224494"},{"message":"Obama's Previously Released Illegal Alien Child Rapist Murderer Avoids Death Penalty \n","updated_time":"2016-04-07T05:15:09+0000","id":"394462630661212_955485031225633"},{"updated_time":"2016-04-07T04:56:25+0000","id":"394462630661212_955480511226085"},{"updated_time":"2016-04-07T04:00:31+0000","id":"394462630661212_955465461227590"},{"updated_time":"2016-04-07T03:32:57+0000","id":"394462630661212_954510431323093"},{"message":"https:\/\/www.facebook.com\/washingtonstarnews\/posts\/1578120065849717\/ |","updated_time":"2016-04-07T02:48:48+0000","id":"394462630661212_955425947898208"},{"message":"So many of you fall into the same trap every election....\nIt is hard for the rest of us to understand how you can be \"awake\" yet fall for the elites agenda so easily...\n\n1) If you do your research you will know the elite pick the POTUS....\n2) If someone \"good' becomes POTUS they are compromised\n3) NO POTUS....no matter who they are will restore the Constitutional Republic\n4) Part of the elites agenda is to keep us divided and conquered...look at what the Trump\/Cruz supporters are doing to eachother...falling for the bullshit\n5) Part of the elites agenda is to keep you distracted from what's really going on....look at all the time you waste supporting\/defending something you have no choice in\n\nI could go on but will stop there\n\nYES....decide who to vote for...then leave it be\n\nQuit falling for the elites divide and conquer strategy\n\nDo your research and you willcome to know these things\n\nStop dividing and start uniting","updated_time":"2016-04-07T02:44:22+0000","id":"394462630661212_955266124580857"},{"updated_time":"2016-04-06T22:05:49+0000","id":"394462630661212_955300904577379"},{"updated_time":"2016-04-06T20:41:53+0000","id":"394462630661212_955286144578855"},{"message":"I vote for Melania!!! Everyone that supports mr.Trump should vote! Maybe you want Bill to be our first lady !\nShare this article on your Facebook so more people can see it not just this group! Let’s win this poll!!!\n","updated_time":"2016-04-06T19:12:24+0000","id":"394462630661212_955245277916275"},{"updated_time":"2016-04-06T18:08:59+0000","id":"394462630661212_954613197979483"},{"message":"The Panama Leaks – Is it Really a New World Order Attack on a Stand-Alone Nation? ~ see article here: http:\/\/wp.me\/p2X3AR-fX2","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-06T15:04:55+0000","id":"394462630661212_955138317926971"},{"message":"American pride...SHARE \n","updated_time":"2016-04-06T13:51:53+0000","id":"394462630661212_955110721263064"},{"message":"I went to federal prison innocently, for over 4 years, due to government corruption. I challenge you to go to www.illegalincarceration.com and prove otherwise.\n\nSTAND UP FOR YOUR RIGHTS!!!","updated_time":"2016-04-06T02:14:48+0000","id":"394462630661212_954851181289018"},{"message":"Come on Oprah your smarter than this.","updated_time":"2016-04-06T02:05:13+0000","id":"394462630661212_954294108011392"},{"updated_time":"2016-04-06T01:47:28+0000","id":"394462630661212_954841194623350"},{"message":"THIS IS INSANE!!!!!! ","updated_time":"2016-04-06T01:37:13+0000","id":"394462630661212_954838407956962"},{"message":"Clinton: Unborn Children Don’t Have Constitutional Rights\nINSANE!!!\n","updated_time":"2016-04-06T00:42:41+0000","id":"394462630661212_953596768081126"},{"message":"Of all the enemies to public liberty war is, perhaps, the most to be dreaded, because it comprises and develops the germ of every other. War is the parent of armies; from these proceed debts and taxes; and armies, and debts, and taxes are the known instruments for bringing the many under the domination of the few. In war, too, the discretionary power of the Executive is extended; its influence in dealing out offices, honors, and emoluments is multiplied; and all the means of seducing the minds, are added to those of subduing the force, of the people. The same malignant aspect in republicanism may be traced in the inequality of fortunes, and the opportunities of fraud, growing out of a state of war, and in the degeneracy of manners and of morals engendered by both. No nation could preserve its freedom in the midst of continual warfare.\n\n–James Madison, Political Observations, Apr. 20, 1795 in: Letters and Other Writings of James Madison, vol. 4, p. 491 (1865)","story":"Colby Tanner shared Freedom Mudroom's photo to the group: Constitutional Patriots.","updated_time":"2016-04-05T23:24:59+0000","id":"394462630661212_954798847960918"},{"message":"Driver Licensing vs. Right to Travel\n\nAuthor Unknown\n\nThe following argument has been used in at least three states (Pennsylvania, Ohio, and West Virginia) as a legal brief to support a demand for dismissal of charges of \"driving without a license.\" It is the argument that was the reason for the charges to be dropped, or for a \"win\" in court against the argument that free people can have their right to travel regulated by their servants.\n\nThe forgotten legal maxim is that free people have a right to travel on the roads which are provided by their servants for that purpose, using ordinary transportation of the day. Licensing cannot be required of free people, because taking on the restrictions of a license requires the surrender of a right. The driver's license can be required of people who use the highways for trade, commerce, or hire; that is, if they earn their living on the road, and if they use extraordinary machines on the roads. If you are not using the highways for profit, you cannot be required to have a driver's license. \n\nBRIEF IN SUPPORT OF NOTICE FOR DISMISSAL FOR LACK OF JURISDICTION\n\nNOW, comes the Accused, appearing specially and not generally or voluntarily, but under threat of arrest if he failed to do so, with this \"BRIEF IN SUPPORT OF NOTICE FOR DISMISSAL FOR LACK OF JURISDICTION,\" stating as follows:\n\nARGUMENT\n\nIf ever a judge understood the public's right to use the public roads, it was Justice Tolman of the Supreme Court of the State of Washington. Justice Tolman stated:\n\n\"Complete freedom of the highways is so old and well established a blessing that we have forgotten the days of the Robber Barons and toll roads, and yet, under an act like this, arbitrarily administered, the highways may be completely monopolized, if, through lack of interest, the people submit, then they may look to see the most sacred of their liberties taken from them one by one, by more or less rapid encroachment.\"\nRobertson vs. Department of Public Works, 180 Wash 133, 147.\n\nThe words of Justice Tolman ring most prophetically in the ears of Citizens throughout the country today as the use of the public roads has been monopolized by the very entity which has been empowered to stand guard over our freedoms, i.e., that of state government.\n\nRIGHTS\n\nThe \"most sacred of liberties\" of which Justice Tolman spoke was personal liberty. The definition of personal liberty is:\n\n\"Personal liberty, or the Right to enjoyment of life and liberty, is one of the fundamental or natural Rights, which has been protected by its inclusion as a guarantee in the various constitutions, which is not derived from, or dependent on, the U.S. Constitution, which may not be submitted to a vote and may not depend on the outcome of an election. It is one of the most sacred and valuable Rights, as sacred as the Right to private property ... and is regarded as inalienable.\"\n16 C.J.S., Constitutional Law, Sect.202, p.987\n\nThis concept is further amplified by the definition of personal liberty:\n\n\"Personal liberty largely consists of the Right of locomotion -- to go where and when one pleases -- only so far restrained as the Rights of others may make it necessary for the welfare of all other citizens. The Right of the Citizen to travel upon the public highways and to transport his property thereon, by horse drawn carriage, wagon, or automobile, is not a mere privilege which may be permitted or prohibited at will, but the common Right which he has under his Right to life, liberty, and the pursuit of happiness. Under this Constitutional guarantee one may, therefore, under normal conditions, travel at his inclination along the public highways or in public places, and while conducting himself in an orderly and decent manner, neither interfering with nor disturbing another's Rights, he will be protected, not only in his person, but in his safe conduct.\"\nII Am.Jur. (1st) Constitutional Law, Sect.329, p.1135\n\nand further ...\n\n\"Personal liberty -- consists of the power of locomotion, of changing situations, of removing one's person to whatever place one's inclination may direct, without imprisonment or restraint unless by due process of law.\"\nBovier's Law Dictionary, 1914 ed., Black's Law Dictionary, 5th ed.; \nBlackstone's Commentary 134; \nHare, Constitution, Pg. 777\n\nJustice Tolman was concerned about the State prohibiting the Citizen from the \"most sacred of his liberties,\" the Right of movement, the Right of moving one's self from place to place without threat of imprisonment, the Right to use the public roads in the ordinary course of life.\n\nWhen the State allows the formation of a corporation it may control its creation by establishing guidelines (statutes) for its operation (charters). Corporations who use the roads in the course of business do not use the roads in the ordinary course of life. There is a difference between a corporation and an individual. The United States Supreme Court has stated:\n\n\"...We are of the opinion that there is a clear distinction in this particular between an individual and a corporation, and that the latter has no right to refuse to submit its books and papers for examination on the suit of the State. The individual may stand upon his Constitutional Rights as a Citizen. He is entitled to carry on his private business in his own way. His power to contract is unlimited. He owes no duty to the State or to his neighbors to divulge his business, or to open his doors to investigation, so far as it may tend to incriminate him. He owes no such duty to the State, since he receives nothing therefrom, beyond the protection of his life, liberty, and property. His Rights are such as the law of the land long antecedent to the organization of the state, and can only be taken from him by due process of law, and in accordance with the Constitution. Among his Rights are the refusal to incriminate himself, and the immunity of himself and his property from arrest or seizure except under warrant of law. He owes nothing to the public so long as he does not trespass upon their rights.\"\n\"Upon the other hand, the corporation is a creature of the state. It is presumed to be incorporated for the benefit of the public. It receives certain special privileges and franchises, and holds them subject to the laws of the state and the limitations of its charter. Its rights to act as a corporation are only preserved to it so long as it obeys the laws of its creation. There is a reserved right in the legislature to investigate its contracts and find out whether it has exceeded its powers. It would be a strange anomaly to hold that the State, having chartered a corporation to make use of certain franchises, could not in exercise of its sovereignty inquire how those franchises had been employed, and whether they had been abused, and demand the production of corporate books and papers for that purpose.\"\nHale vs. Hinkel, 201 US 43, 74-75\n\nCorporations engaged in mercantile equity fall under the purview of the State's admiralty jurisdiction, and the public at large must be protected from their activities, as they (the corporations) are engaged in business for profit.\n\n\"...Based upon the fundamental ground that the sovereign state has the plenary control of the streets and highways in the exercise of its police power (see police power, infra.), may absolutely prohibit the use of the streets as a place for the prosecution of a private business for gain. They all recognize the fundamental distinction between the ordinary Right of the Citizen to use the streets in the usual way and the use of the streets as a place of business or a main instrumentality of business for private gain. The former is a common Right, the latter is an extraordinary use. As to the former, the legislative power is confined to regulation, as to the latter, it is plenary and extends even to absolute prohibition. Since the use of the streets by a common carrier in the prosecution of its business as such is not a right but a mere license of privilege.\"\nHadfield vs. Lundin, 98 Wash 516\n\nIt will be necessary to review early cases and legal authority in order to reach a lawfully correct theory dealing with this Right or \"privilege.\" We will attempt to reach a sound conclusion as to what is a \"Right to use the road\" and what is a \"privilege to use the road\". Once reaching this determination, we shall then apply those positions to modern case decision.\n\n\"Where rights secured by the Constitution are involved, there can be no rule making or legislation which would abrogate them.\"\nMiranda vs. Arizona, 384 US 436, 491\n\nand ...\n\n\"The claim and exercise of a constitutional Right cannot be converted into a crime.\"\nMiller vs. U.S., 230 F. 486, 489\n\nand ...\n\n\"There can be no sanction or penalty imposed upon one because of this exercise of constitutional Rights.\"\nSnerer vs. Cullen, 481 F. 946\n\nStreets and highways are established and maintained for the purpose of travel and transportation by the public. Such travel may be for business or pleasure.\n\n\"The use of the highways for the purpose of travel and transportation is not a mere privilege, but a common and fundamental Right of which the public and the individual cannot be rightfully deprived.\"\nChicago Motor Coach vs. Chicago, 169 NE 22?1; \nLigare vs. Chicago, 28 NE 934; \nBoon vs. Clark, 214 SSW 607; \n25 Am.Jur. (1st) Highways Sect.163\n\nand ...\n\n\"The Right of the Citizen to travel upon the public highways and to transport his property thereon, either by horse drawn carriage or by automobile, is not a mere privilege which a city can prohibit or permit at will, but a common Right which he has under the right to life, liberty, and the pursuit of happiness.\"\nThompson vs. Smith, 154 SE 579\n\nSo we can see that a Citizen has a Right to travel upon the public highways by automobile and the Citizen cannot be rightfully deprived of his Liberty. So where does the misconception that the use of the public road is always and only a privilege come from?\n\n\"... For while a Citizen has the Right to travel upon the public highways and to transport his property thereon, that Right does not extend to the use of the highways, either in whole or in part, as a place for private gain. For the latter purpose, no person has a vested right to use the highways of the state, but is a privilege or a license which the legislature may grant or withhold at its discretion.\"\nState vs. Johnson, 243 P. 1073; \nCummins vs. Homes, 155 P. 171; \nPackard vs. Banton, 44 S.Ct. 256; \nHadfield vs. Lundin, 98 Wash 516\n\nHere the court held that a Citizen has the Right to travel upon the public highways, but that he did not have the right to conduct business upon the highways. On this point of law all authorities are unanimous.\n\n\"Heretofore the court has held, and we think correctly, that while a Citizen has the Right to travel upon the public highways and to transport his property thereon, that Right does not extend to the use of the highways, either in whole or in part, as a place of business for private gain.\"\nWillis vs. Buck, 263 P. l 982; \nBarney vs. Board of Railroad Commissioners, 17 P.2d 82\n\nand ...\n\n\"The right of the citizen to travel upon the highway and to transport his property thereon, in the ordinary course of life and business, differs radically and obviously from that of one who makes the highway his place of business for private gain in the running of a stagecoach or omnibus.\"\nState vs. City of Spokane, 186 P. 864\n\nWhat is this Right of the Citizen which differs so \"radically and obviously\" from one who uses the highway as a place of business? Who better to enlighten us than Justice Tolman of the Supreme Court of Washington State? In State vs. City of Spokane, supra, the Court also noted a very \"radical and obvious\" difference, but went on to explain just what the difference is:\n\n\"The former is the usual and ordinary right of the Citizen, a common right to all, while the latter is special, unusual, and extraordinary.\"\nand ...\n\n\"This distinction, elementary and fundamental in character, is recognized by all the authorities.\"\nState vs. City of Spokane, supra.\n\nThis position does not hang precariously upon only a few cases, but has been proclaimed by an impressive array of cases ranging from the state courts to the federal courts.\n\n\"the right of the Citizen to travel upon the highway and to transport his property thereon in the ordinary course of life and business, differs radically and obviously from that of one who makes the highway his place of business and uses it for private gain in the running of a stagecoach or omnibus. The former is the usual and ordinary right of the Citizen, a right common to all, while the latter is special, unusual, and extraordinary.\"\nEx Parte Dickey, (Dickey vs. Davis), 85 SE 781\n\nand ...\n\n\"The right of the Citizen to travel upon the public highways and to transport his property thereon, in the ordinary course of life and business, is a common right which he has under the right to enjoy life and liberty, to acquire and possess property, and to pursue happiness and safety. It includes the right, in so doing, to use the ordinary and usual conveyances of the day, and under the existing modes of travel, includes the right to drive a horse drawn carriage or wagon thereon or to operate an automobile thereon, for the usual and ordinary purpose of life and business.\"\nThompson vs. Smith, supra.; \nTeche Lines vs. Danforth, Miss., 12 S.2d 784\n\nThere is no dissent among various authorities as to this position. (See Am. Jur. [1st] Const. Law, 329 and corresponding Am. Jur. [2nd].)\n\n\"Personal liberty -- or the right to enjoyment of life and liberty -- is one of the fundamental or natural rights, which has been protected by its inclusion as a guarantee in the various constitutions, which is not derived from nor dependent on the U.S. Constitution. ... It is one of the most sacred and valuable rights [remember the words of Justice Tolman, supra.] as sacred as the right to private property ... and is regarded as inalienable.\"\n16 C.J.S. Const. Law, Sect.202, Pg. 987\n\nAs we can see, the distinction between a \"Right\" to use the public roads and a \"privilege\" to use the public roads is drawn upon the line of \"using the road as a place of business\" and the various state courts have held so. But what have the U.S. Courts held on this point?\n\n\"First, it is well established law that the highways of the state are public property, and their primary and preferred use is for private purposes, and that their use for purposes of gain is special and extraordinary which, generally at least, the legislature may prohibit or condition as it sees fit.\"\nStephenson vs. Rinford, 287 US 251; \nPachard vs Banton, 264 US 140, and cases cited; \nFrost and F. Trucking Co. vs. Railroad Commission, 271 US 592; \nRailroad commission vs. Inter-City Forwarding Co., 57 SW.2d 290; \nParlett Cooperative vs. Tidewater Lines, 164 A. 313\n\nSo what is a privilege to use the roads? By now it should be apparent even to the \"learned\" that an attempt to use the road as a place of business is a privilege. The distinction must be drawn between ...\n\nTravelling upon and transporting one's property upon the public roads, which is our Right; and ...\nUsing the public roads as a place of business or a main instrumentality of business, which is a privilege.\n\"[The roads] ... are constructed and maintained at public expense, and no person therefore, can insist that he has, or may acquire, a vested right to their use in carrying on a commercial business.\"\nEx Parte Sterling, 53 SW.2d 294; \nBarney vs. Railroad Commissioners, 17 P.2d 82; \nStephenson vs. Binford, supra.\n\n\"When the public highways are made the place of business the state has a right to regulate their use in the interest of safety and convenience of the public as well as the preservation of the highways.\"\nThompson vs. Smith, supra.\n\n\"[The state's] right to regulate such use is based upon the nature of the business and the use of the highways in connection therewith.\"\nIbid.\n\n\"We know of no inherent right in one to use the highways for commercial purposes. The highways are primarily for the use of the public, and in the interest of the public, the state may prohibit or regulate ... the use of the highways for gain.\"\nRobertson vs. Dept. of Public Works, supra.\n\nThere should be considerable authority on a subject as important a this deprivation of the liberty of the individual \"using the roads in the ordinary course of life and business.\" However, it should be noted that extensive research has not turned up one case or authority acknowledging the state's power to convert the individual's right to travel upon the public roads into a \"privilege.\"\n\nTherefore, it is concluded that the Citizen does have a \"Right\" to travel and transport his property upon the public highways and roads and the exercise of this Right is not a \"privilege.\"\n\nDEFINITIONS\n\nIn order to understand the correct application of the statute in question, we must first define the terms used in connection with this point of law. As will be shown, many terms used today do not, in their legal context, mean what we assume they mean, thus resulting in the misapplication of statutes in the instant case.\n\nAUTOMOBILE AND MOTOR VEHICLE\n\nThere is a clear distinction between an automobile and a motor vehicle. An automobile has been defined as:\n\n\"The word `automobile' connotes a pleasure vehicle designed for the transportation of persons on highways.\"\nAmerican Mutual Liability Ins. Co., vs. Chaput, 60 A.2d 118, 120; 95 NH 200\n\nWhile the distinction is made clear between the two as the courts have stated:\n\n\"A motor vehicle or automobile for hire is a motor vehicle, other than an automobile stage, used for the transportation of persons for which remuneration is received.\"\nInternational Motor Transit Co. vs. Seattle, 251 P. 120\n\nThe term `motor vehicle' is different and broader than the word `automobile.'\"\nCity of Dayton vs. DeBrosse, 23 NE.2d 647, 650; 62 Ohio App. 232\n\nThe distinction is made very clear in Title 18 USC 31:\n\n\"Motor vehicle\" means every description or other contrivance propelled or drawn by mechanical power and used for commercial purposes on the highways in the transportation of passengers, or passengers and property.\n\"Used for commercial purposes\" means the carriage of persons or property for any fare, fee, rate, charge or other considerations, or directly or indirectly in connection with any business, or other undertaking intended for profit.\nClearly, an automobile is private property in use for private purposes, while a motor vehicle is a machine which may be used upon the highways for trade, commerce, or hire.\n\nTRAVEL\n\nThe term \"travel\" is a significant term and is defined as:\n\"The term `travel' and `traveler' are usually construed in their broad and general sense ... so as to include all those who rightfully use the highways viatically (when being reimbursed for expenses) and who have occasion to pass over them for the purpose of business, convenience, or pleasure.\"\n25 Am.Jur. (1st) Highways, Sect.427, Pg. 717\n\n\"Traveler -- One who passes from place to place, whether for pleasure, instruction, business, or health.\"\nLocket vs. State, 47 Ala. 45; \nBovier's Law Dictionary, 1914 ed., Pg. 3309\n\n\"Travel -- To journey or to pass through or over; as a country district, road, etc. To go from one place to another, whether on foot, or horseback, or in any conveyance as a train, an automobile, carriage, ship, or aircraft; Make a journey.\"\nCentury Dictionary, Pg. 2034\n\nTherefore, the term \"travel\" or \"traveler\" refers to one who uses a conveyance to go from one place to another, and included all those who use the highways as a matter of Right.\n\nNotice that in all these definitions, the phrase \"for hire\" never occurs. This term \"travel\" or \"traveler\" implies, by definition, one who uses the road as a means to move from one place to another.\n\nTherefore, one who uses the road in the ordinary course of life and business for the purpose of travel and transportation is a traveler.\n\nDRIVER\n\nThe term \"driver\" in contradistinction to \"traveler,\" is defined as:\n\n\"Driver -- One employed in conducting a coach, carriage, wagon, or other vehicle ...\"\nBovier's Law Dictionary, 1914 ed., Pg. 940\n\nNotice that this definition includes one who is \"employed\" in conducting a vehicle. It should be self-evident that this individual could not be \"travelling\" on a journey, but is using the road as a place of business.\n\nOPERATOR\n\nToday we assume that a \"traveler\" is a \"driver,\" and a \"driver\" is an \"operator.\" However, this is not the case.\n\n\"It will be observed from the language of the ordinance that a distinction is to be drawn between the terms `operator' and `driver'; the `operator' of the service car being the person who is licensed to have the car on the streets in the business of carrying passengers for hire; while the `driver' is the one who actually drives the car. However, in the actual prosecution of business, it was possible for the same person to be both \"operator\" and \"driver.\"\nNewbill vs. Union Indemnity Co., 60 SE.2d 658\n\nTo further clarify the definition of an \"operator\" the court observed that this was a vehicle \"for hire\" and that it was in the business of carrying passengers.\n\nThis definition would seem to describe a person who is using the road as a place of business, or in other words, a person engaged in the \"privilege\" of using the road for gain.\n\nThis definition, then, is a further clarification of the distinction mentioned earlier, and therefore:\n\nTravelling upon and transporting one's property upon the public roads as a matter of Right meets the definition of a traveler.\nUsing the road as a place of business as a matter of privilege meets the definition of a driver or an operator or both.\nTRAFFIC\n\nHaving defined the terms \"automobile,\" \"motor vehicle,\" \"traveler,\" \"driver,\" and \"operator,\" the next term to define is \"traffic\":\n\n\"... Traffic thereon is to some extent destructive, therefore, the prevention of unnecessary duplication of auto transportation service will lengthen the life of the highways or reduce the cost of maintenance, the revenue derived by the state ... will also tend toward the public welfare by producing at the expense of those operating for private gain, some small part of the cost of repairing the wear ...\"\nNorthern Pacific R.R. Co. vs. Schoenfeldt, 213 P. 26\n\nNote: In the above, Justice Tolman expounded upon the key of raising revenue by taxing the \"privilege\" to use the public roads \"at the expense of those operating for gain.\"\n\nIn this case, the word \"traffic\" is used in conjunction with the unnecessary Auto Transportation Service, or in other words, \"vehicles for hire.\" The word \"traffic\" is another word which is to be strictly construed to the conducting of business.\n\n\"Traffic -- Commerce, trade, sale or exchange of merchandise, bills, money, or the like. The passing of goods and commodities from one person to another for an equivalent in goods or money ...\"\nBovier's Law Dictionary, 1914 ed., Pg. 3307\n\nHere again, notice that this definition refers to one \"conducting business.\" No mention is made of one who is traveling in his automobile. This definition is of one who is engaged in the passing of a commodity or goods in exchange for money, i.e .., vehicles for hire.\n\nFurthermore, the words \"traffic\" and \"travel\" must have different meanings which the courts recognize. The difference is recognized in Ex Parte Dickey, supra:\n\n\"...in addition to this, cabs, hackney coaches, omnibuses, taxicabs, and hacks, when unnecessarily numerous, interfere with the ordinary traffic and travel and obstruct them.\"\nThe court, by using both terms, signified its recognition of a distinction between the two. But, what was the distinction? We have already defined both terms, but to clear up any doubt:\n\n\"The word `traffic' is manifestly used here in secondary sense, and has reference to the business of transportation rather than to its primary meaning of interchange of commodities.\"\nAllen vs. City of Bellingham, 163 P. 18\n\nHere the Supreme Court of the State of Washington has defined the word \"traffic\" (in either its primary or secondary sense) in reference to business, and not to mere travel! So it is clear that the term \"traffic\" is business related and therefore, it is a \"privilege.\" The net result being that \"traffic\" is brought under the (police) power of the legislature. The term has no application to one who is not using the roads as a place of business.\n\nLICENSE\n\nIt seems only proper to define the word \"license,\" as the definition of this word will be extremely important in understanding the statutes as they are properly applied:\n\n\"The permission, by competent authority to do an act which without permission, would be illegal, a trespass, or a tort.\"\nPeople vs. Henderson, 218 NW.2d 2, 4\n\n\"Leave to do a thing which licensor could prevent.\"\nWestern Electric Co. vs. Pacent Reproducer Corp., 42 F.2d 116, 118\n\nIn order for these two definitions to apply in this case, the state would have to take up the position that the exercise of a Constitutional Right to use the public roads in the ordinary course of life and business is illegal, a trespass, or a tort, which the state could then regulate or prevent.\n\nThis position, however, would raise magnitudinous Constitutional questions as this position would be diametrically opposed to fundamental Constitutional Law. (See \"Conversion of a Right to a Crime,\" infra.)\n\nIn the instant case, the proper definition of a \"license\" is:\n\n\"a permit, granted by an appropriate governmental body, generally for consideration, to a person, firm, or corporation, to pursue some occupation or to carry on some business which is subject to regulation under the police power.\"\nRosenblatt vs. California State Board of Pharmacy, 158 P.2d 199, 203\n\nThis definition would fall more in line with the \"privilege\" of carrying on business on the streets.\n\nMost people tend to think that \"licensing\" is imposed by the state for the purpose of raising revenue, yet there may well be more subtle reasons contemplated; for when one seeks permission from someone to do something he invokes the jurisdiction of the licensor which, in this case, is the state. In essence, the licensee may well be seeking to be regulated by the licensor.\n\n\"A license fee is a charge made primarily for regulation, with the fee to cover costs and expenses of supervision or regulation.\"\nState vs. Jackson, 60 Wisc.2d 700; 211 NW.2d 480, 487\n\nThe fee is the price; the regulation or control of the licensee is the real aim of the legislation.\n\nAre these licenses really used to fund legitimate government, or are they nothing more than a subtle introduction of police power into every facet of our lives? Have our \"enforcement agencies\" been diverted from crime prevention, perhaps through no fault of their own, instead now busying themselves as they \"check\" our papers to see that all are properly endorsed by the state?\n\nHow much longer will it be before we are forced to get a license for our lawn mowers, or before our wives will need a license for her blender or mixer? They all have motors on them and the state can always use the revenue.\n\nPOLICE POWER\n\nThe confusion of the police power with the power of taxation usually arises in cases where the police power has affixed a penalty to a certain act, or where it requires licenses to be obtained and a certain sum be paid for certain occupations. The power used in the instant case cannot, however, be the power of taxation since an attempt to levy a tax upon a Right would be open to Constitutional objection. (See \"taxing power,\" infra.)\n\nEach law relating to the use of police power must ask three questions:\n\n\"Is there threatened danger?\nDoes a regulation involve a Constitutional Right?\nIs this regulation reasonable?\"\nPeople vs. Smith, 108 Am.St.Rep. 715; \nBovier's Law Dictionary, 1914 ed., under \"Police Power\"\n\nWhen applying these three questions to the statute in question, some very important issues emerge.\n\nFirst, \"is there a threatened danger\" in the individual using his automobile on the public highways, in the ordinary course of life and business?\n\nThe answer is No! There is nothing inherently dangerous in the use of an automobile when it is carefully managed. Their guidance, speed, and noise are subject to a quick and easy control, under a competent and considerate manager, it is as harmless on the road as a horse and buggy.\n\nIt is the manner of managing the automobile, and that alone, which threatens the safety of the public. The ability to stop quickly and to respond quickly to guidance would seem to make the automobile one of the least dangerous conveyances. (See Yale Law Journal, December, 1905.)\n\n\"The automobile is not inherently dangerous.\"\nCohens vs. Meadow, 89 SE 876; \nBlair vs. Broadmore, 93 SE 532\n\nTo deprive all persons of the Right to use the road in the ordinary course of life and business, because one might, in the future, become dangerous, would be a deprivation not only of the Right to travel, but also the Right to due process. (See \"Due Process,\" infra.)\n\nNext; does the regulation involve a Constitutional Right?\n\nThis question has already been addressed and answered in this brief, and need not be reinforced other than to remind this Court that this Citizen does have the Right to travel upon the public highway by automobile in the ordinary course of life and business. It can therefore be concluded that this regulation does involve a Constitutional Right.\n\nThe third question is the most important in this case. \"Is this regulation reasonable?\"\n\nThe answer is No! It will be shown later in \"Regulation,\" infra., that this licensing statute is oppressive and could be effectively administered by less oppressive means.\n\nAlthough the Fourteenth Amendment does not interfere with the proper exercise of the police power, in accordance with the general principle that the power must be exercised so as not to invade unreasonably the rights guaranteed by the United States Constitution, it is established beyond question that every state power, including the police power, is limited by the Fourteenth Amendment (and others) and by the inhibitions there imposed.\n\nMoreover, the ultimate test of the propriety of police power regulations must be found in the Fourteenth Amendment, since it operates to limit the field of the police power to the extent of preventing the enforcement of statutes in denial of Rights that the Amendment protects. (See Parks vs. State, 64 NE 682.)\n\n\"With regard particularly to the U.S. Constitution, it is elementary that a Right secured or protected by that document cannot be overthrown or impaired by any state police authority.\"\nConnolly vs. Union Sewer Pipe Co., 184 US 540; \nLafarier vs. Grand Trunk R.R. Co., 24 A. 848; \nO'Neil vs. Providence Amusement Co., 108 A. 887\n\n\"The police power of the state must be exercised in subordination to the provisions of the U.S. Constitution.\"\nBacahanan vs. Wanley, 245 US 60; \nPanhandle Eastern Pipeline Co. vs. State Highway Commission, 294 US 613\n\n\"It is well settled that the Constitutional Rights protected from invasion by the police power, include Rights safeguarded both by express and implied prohibitions in the Constitutions.\"\nTiche vs. Osborne, 131 A. 60\n\n\"As a rule, fundamental limitations of regulations under the police power are found in the spirit of the Constitutions, not in the letter, although they are just as efficient as if expressed in the clearest language.\"\nMehlos vs. Milwaukee, 146 NW 882\n\nAs it applies in the instant case, the language of the Fifth Amendment is clear:\n\n\"No person shall be ... deprived of Life, Liberty, or Property without due process of law.\"\nAs has been shown, the courts at all levels have firmly established an absolute Right to travel.\n\nIn the instant case, the state, by applying commercial statutes to all entities, natural and artificial persons alike, has deprived this free and natural person of the Right of Liberty, without cause and without due process of law.\n\nDUE PROCESS\n\n\"The essential elements of due process of law are ... Notice and The Opportunity to defend.\"\nSimon vs. Craft, 182 US 427\n\nYet, not one individual has been given notice of the loss of his\/her Right, let alone before signing the license (contract). Nor was the Citizen given any opportunity to defend against the loss of his\/her right to travel, by automobile, on the highways, in the ordinary course of life and business. This amounts to an arbitrary deprivation of Liberty.\n\n\"There should be no arbitrary deprivation of Life or Liberty ...\"\nBarbour vs. Connolly, 113 US 27, 31; \nYick Wo vs. Hopkins, 118 US 356\n\nand ...\n\n\"The right to travel is part of the Liberty of which a citizen cannot deprived without due process of law under the Fifth Amendment. This Right was emerging as early as the Magna Carta.\"\nKent vs. Dulles, 357 US 116 (1958)\n\nThe focal point of this question of police power and due process must balance upon the point of making the public highways a safe place for the public to travel. If a man travels in a manner that creates actual damage, an action would lie (civilly) for recovery of damages. The state could then also proceed against the individual to deprive him of his Right to use the public highways, for cause. This process would fulfill the due process requirements of the Fifth Amendment while at the same time insuring that Rights guaranteed by the U.S. Constitution and the state constitutions would be protected.\n\nBut unless or until harm or damage (a crime) is committed, there is no cause for interference in the private affairs or actions of a Citizen.\n\nOne of the most famous and perhaps the most quoted definitions of due process of law, is that of Daniel Webster in his Dartmouth College Case (4 Wheat 518), in which he declared that by due process is meant:\n\n\"a law which hears before it condemns, which proceeds upon inquiry, and renders judgment only after trial.\"\nSee also State vs. Strasburg, 110 P. 1020; \nDennis vs. Moses, 52 P. 333\n\nSomewhat similar is the statement that is a rule as old as the law that:\n\n\"no one shall be personally bound (restricted) until he has had his day in court,\"\nby which is meant, until he has been duly cited to appear and has been afforded an opportunity to be heard. Judgment without such citation and opportunity lacks all the attributes of a judicial determination; it is judicial usurpation and it is oppressive and can never be upheld where it is fairly administered. (12 Am.Jur. [1st] Const. Law, Sect. 573, Pg. 269)\n\nNote: This sounds like the process used to deprive one of the \"privilege\" of operating a motor vehicle \"for hire.\" It should be kept in mind, however, that we are discussing the arbitrary deprivation of the Right to use the road that all citizens have \"in common.\"\n\nThe futility of the state's position can be most easily observed in the 1959 Washington Attorney General's opinion on a similar issue:\n\n\"The distinction between the Right of the Citizen to use the public highways for private, rather than commercial purposes is recognized ...\"\nand ...\n\n\"Under its power to regulate private uses of our highways, our legislature has required that motor vehicle operators be licensed (I.C. 49-307). Undoubtedly, the primary purpose of this requirement is to insure, as far as possible, that all motor vehicle operators will be competent and qualified, thereby reducing the potential hazard or risk of harm, to which other users of the highways might otherwise be subject. But once having complied with this regulatory provision, by obtaining the required license, a motorist enjoys the privilege of travelling freely upon the highways ...\"\nWashington A.G.O. 59-60 No. 88, Pg. 11\n\nThis alarming opinion appears to be saying that every person using an automobile as a matter of Right, must give up the Right and convert the Right into a privilege. This is accomplished under the guise of regulation. This statement is indicative of the insensitivity, even the ignorance, of the government to the limits placed upon governments by and through the several constitutions.\n\nThis legal theory may have been able to stand in 1959; however, as of 1966, in the United States Supreme Court decision in Miranda, even this weak defense of the state's actions must fall.\n\n\"Where rights secured by the Constitution are involved, there can be no rule making or legislation which would abrogate them.\"\nMiranda vs. Arizona, 384 US 436, 491\n\nThus the legislature does not have the power to abrogate the Citizen's Right to travel upon the public roads, by passing legislation forcing the citizen to waive his Right and convert that Right into a privilege. Furthermore, we have previously established that this \"privilege\" has been defined as applying only to those who are \"conducting business in the streets\" or \"operating for-hire vehicles.\"\n\nThe legislature has attempted (by legislative fiat) to deprive the Citizen of his Right to use the roads in the ordinary course of life and business, without affording the Citizen the safeguard of due process of law. This has been accomplished under supposed powers of regulation.\n\nREGULATION\n\n\"In addition to the requirement that regulations governing the use of the highways must not be violative of constitutional guarantees, the prime essentials of such regulation are reasonableness, impartiality, and definiteness or certainty.\"\n25 Am.Jur. (1st) Highways, Sect. 260\n\nand ...\n\n\"Moreover, a distinction must be observed between the regulation of an activity which may be engaged in as a matter of right and one carried on by government sufferance of permission.\"\nDavis vs. Massachusetts, 167 US 43; \nPachard vs. Banton, supra.\n\nOne can say for certain that these regulations are impartial since they are being applied to all, even though they are clearly beyond the limits of the legislative powers. However, we must consider whether such regulations are reasonable and non-violative of constitutional guarantees.\n\nFirst, let us consider the reasonableness of this statute requiring all persons to be licensed (presuming that we are applying this statute to all persons using the public roads). In determining the reasonableness of the statute we need only ask two questions:\n\nDoes the statute accomplish its stated goal?\nThe answer is No!\n\nThe attempted explanation for this regulation \"to insure the safety of the public by insuring, as much as possible, that all are competent and qualified.\"\n\nHowever, one can keep his license without retesting, from the time he\/she is first licensed until the day he\/she dies, without regard to the competency of the person, by merely renewing said license before it expires. It is therefore possible to completely skirt the goal of this attempted regulation, thus proving that this regulation does not accomplish its goal.\n\nFurthermore, by testing and licensing, the state gives the appearance of underwriting the competence of the licensees, and could therefore be held liable for failures, accidents, etc. caused by licensees.\n\nIs the statute reasonable?\nThe answer is No!\n\nThis statute cannot be determined to be reasonable since it requires to the Citizen to give up his or her natural Right to travel unrestricted in order to accept the privilege. The purported goal of this statute could be met by much less oppressive regulations, i.e., competency tests and certificates of competency before using an automobile upon the public roads. (This is exactly the situation in the aviation sector.)\n\nBut isn't this what we have now?\n\nThe answer is No! The real purpose of this license is much more insidious. When one signs the license, he\/she gives up his\/her Constitutional Right to travel in order to accept and exercise a privilege. After signing the license, a quasi-contract, the Citizen has to give the state his\/her consent to be prosecuted for constructive crimes and quasi-criminal actions where there is no harm done and no damaged property.\n\nThese prosecutions take place without affording the Citizen of their Constitutional Rights and guarantees such a the Right to a trial by jury of twelve persons and the Right to counsel, as well as the normal safeguards such as proof of intent and a corpus dilecti and a grand jury indictment. These unconstitutional prosecutions take place because the Citizen is exercising a privilege and has given his\/her \"implied consent\" to legislative enactments designed to control interstate commerce, a regulatable enterprise under the police power of the state.\n\nWe must now conclude that the Citizen is forced to give up Constitutional guarantees of \"Right\" in order to exercise his state \"privilege\" to travel upon the public highways in the ordinary course of life and business.\n\nSURRENDER OF RIGHTS\n\nA Citizen cannot be forced to give up his\/her Rights in the name of regulation.\n\n\"... the only limitations found restricting the right of the state to condition the use of the public highways as a means of vehicular transportation for compensation are (1) that the state must not exact of those it permits to use the highways for hauling for gain that they surrender any of their inherent U.S. Constitutional Rights as a condition precedent to obtaining permission for such use ...\"\nRiley vs. Laeson, 142 So. 619; \nStephenson vs. Binford, supra.\n\nIf one cannot be placed in a position of being forced to surrender Rights in order to exercise a privilege, how much more must this maxim of law, then, apply when one is simply exercising (putting into use) a Right?\n\nHoke vs. Henderson, 15 NC 15\n\nand ...\n\n\"We find it intolerable that one Constitutional Right should have to be surrendered in order to assert another.\"\nSimons vs. United States, 390 US 389\n\nSince the state requires that one give up Rights in order to exercise the privilege of driving, the regulation cannot stand under the police power, due process, or regulation, but must be exposed as a statute which is oppressive and one which has been misapplied to deprive the Citizen of Rights guaranteed by the United States Constitution and the state constitutions.\n\nTAXING POWER\n\n\"Any claim that this statute is a taxing statute would be immediately open to severe Constitutional objections. If it could be said that the state had the power to tax a Right, this would enable the state to destroy Rights guaranteed by the constitution through the use of oppressive taxation. The question herein, is one of the state taxing the Right to travel by the ordinary modes of the day, and whether this is a legislative object of the state taxation.\nThe views advanced herein are neither novel nor unsupported by authority. The question of taxing power of the states has been repeatedly considered by the Supreme Court. The Right of the state to impede or embarrass the Constitutional operation of the U.S. Government or the Rights which the Citizen holds under it, has been uniformly denied.\"\n\nMcCulloch vs. Maryland, 4 Wheat 316\n\nThe power to tax is the power to destroy, and if the state is given the power to destroy Rights through taxation, the framers of the Constitution wrote that document in vain.\n\n\"... It may be said that a tax of one dollar for passing through the state cannot sensibly affect any function of government or deprive a Citizen of any valuable Right. But if a state can tax ... a passenger of one dollar, it can tax him a thousand dollars.\"\nCrandall vs. Nevada, 6 Wall 35, 46\n\nand ...\n\n\"If the Right of passing through a state by a Citizen of the United States is one guaranteed by the Constitution, it must be sacred from state taxation.\"\nIbid., Pg. 47\n\nTherefore, the Right of travel must be kept sacred from all forms of state taxation and if this argument is used by the state as a defense of the enforcement of this statute, then this argument also must fail.\n\nCONVERSION OF A RIGHT TO A CRIME\n\nAs previously demonstrated, the Citizen has the Right to travel and to transport his property upon the public highways in the ordinary course of life and business. However, if one exercises this Right to travel (without first giving up the Right and converting that Right into a privilege) the Citizen is by statute, guilty of a crime. This amounts to converting the exercise of a Constitutional Right into a crime.\n\nRecall the Miller vs. U.S. and Snerer vs. Cullen quotes from Pg. 5, and:\n\n\"The state cannot diminish Rights of the people.\"\nHurtado vs. California, 110 US 516\n\nand ...\n\n\"Where rights secured by the Constitution are involved, there can be no rule making or legislation which would abrogate them.\"\nMiranda, supra.\n\nIndeed, the very purpose for creating the state under the limitations of the constitution was to protect the rights of the people from intrusion, particularly by the forces of government.\n\nSo we can see that any attempt by the legislature to make the act of using the public highways as a matter of Right into a crime, is void upon its face.\n\nAny person who claims his Right to travel upon the highways, and so exercises that Right, cannot be tried for a crime of doing so. And yet, this Freeman stands before this court today to answer charges for the \"crime\" of exercising his Right to Liberty. As we have already shown, the term \"drive\" can only apply to those who are employed in the business of transportation for hire. It has been shown that freedom includes the Citizen's Right to use the public highways in the ordinary course of life and business without license or regulation by the police powers of the state.\n\nCONCLUSION\n\nIt is the duty of the court to recognize the substance of things and not the mere form.\n\n\"The courts are not bound by mere form, nor are they to be misled by mere pretenses. They are at liberty -- indeed they are under a solemn duty -- to look at the substance of things, whenever they enter upon the inquiry whether the legislature has transcended the limits of its authority. If, therefore, a statute purported to have been enacted to protect ... the public safety, has no real or substantial relation to those objects or is a palpable invasion of Rights secured by the fundamental law, it is the duty of the courts to so adjudge, and thereby give effect to the Constitution.\"\nMulger vs. Kansas, 123 US 623, 661\n\nand ...\n\n\"It is the duty of the courts to be watchful for the Constitutional rights of the citizen and against any stealthy encroachments thereon.\"\nBoyd vs. United States, 116 US 616\n\nThe courts are duty bound to recognize and stop the stealthy encroachments which have been made upon the Citizen's Right to travel and to use the roads to transport his property in the \"ordinary course of life and business.\" (Hadfield, supra.)\n\nFurther, the court must recognize that the Right to travel is part of the Liberty of which a Citizen cannot be deprived without specific cause and without the due process of law guaranteed in the Fifth Amendment. (Kent, supra.)\n\nThe history of this invasion of the Citizen's Right to use the public highways shows clearly that the legislature simply found a heretofore untapped source of revenue, got greedy, and attempted to enforce a statute in an unconstitutional manner upon those free and natural individuals who have a Right to travel upon the highways. This was not attempted in an outright action, but in a slow, meticulous, calculated encroachment upon the Citizen's Right to travel.\n\nThis position must be accepted unless the prosecutor can show his authority for the position that the \"use of the road in the ordinary course of life and business\" is a privilege.\n\nTo rule in any other manner, without clear authority for an adverse ruling, will infringe upon fundamental and basic concepts of Constitutional law. This position, that a Right cannot be regulated under any guise, must be accepted without concern for the monetary loss of the state.\n\n\"Disobedience or evasion of a Constitutional Mandate cannot be tolerated, even though such disobedience may, at least temporarily, promote in some respects the best interests of the public.\"\nSlote vs. Examination, 112 ALR 660\n\nand ...\n\n\"Economic necessity cannot justify a disregard of Constitutional guarantee.\"\nRiley vs. Carter, 79 ALR 1018; \n16 Am.Jur. (2nd), Const. Law, Sect. 81\n\nand ...\n\n\"Constitutional Rights cannot be denied simply because of hostility to their assertions and exercise; vindication of conceded Constitutional Rights cannot be made dependent upon any theory that it is less expensive to deny them than to afford them.\"\nWatson vs. Memphis, 375 US 526\n\nTherefore, the Court's decision in the instant case must be made without the issue of cost to the state being taken into consideration, as that issue is irrelevant. The state cannot lose money that it never had a right to demand from the Sovereign People.\n\nFinally, we come to the issue of public policy. It could be argued that the licensing scheme of all persons is a matter of public policy. However, if this argument is used, it too must fail, as:\n\n\"No public policy of a state can be allowed to override the positive guarantees of the U.S. Constitution.\"\n16 Am.Jur. (2nd), Const. Law, Sect. 70\n\nSo even public policy cannot abrogate this Citizen's Right to travel and to use the public highways in the ordinary course of life and business. Therefore, it must be concluded that:\n\n\"We have repeatedly held that the legislature may regulate the use of the highways for carrying on business for private gain and that such regulation is a valid exercise of the police power.\"\nNorthern Pacific R.R. Co., supra.\n\nand ...\n\n\"The act in question is a valid regulation, and as such is binding upon all who use the highway for the purpose of private gain.\"\nIbid.\n\nAny other construction of this statute would render it unconstitutional as applied to this Citizen or any Citizen. The Accused therefore moves this court to dismiss the charge against him, with prejudice.\n\nJune 10, 1986. \nThis ends the legal brief. \n\nIn addition:\n\nSince no notice is given to people applying for driver's (or other) licenses that they have a perfect right to use the roads without any permission, and that they surrender valuable rights by taking on the regulation system of licensure, the state has committed a massive construction fraud. This occurs when any person is told that they must have a license in order to use the public roads and highways.\n\nThe license, being a legal contract under which the state is empowered with policing powers, is only valid when the licensee takes on the burdens of the contract and bargains away his or her rights knowingly, intentionally, and voluntarily.\n\nFew know that the driver's license is a contract without which the police are powerless to regulate the people's actions or activities.\n\nFew (if any) licensees intentionally surrender valuable rights. They are told that they must have the license. As we have seen, this is not the case.\n\nNo one in their right mind voluntarily surrenders complete liberty and accepts in its place a set of regulations.\n\n\"The people never give up their liberties but under some delusion.\"\nEdmund Burke, (1784)","updated_time":"2016-04-05T23:05:24+0000","id":"394462630661212_954794394628030"},{"message":"A Key Similarity Between Snowden Leak and Panama Papers: Scandal Is What’s Been Legalized ~ see article here: http:\/\/wp.me\/p2X3AR-fVM","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-05T16:06:53+0000","id":"394462630661212_954606394646830"},{"message":"http:\/\/www.washingtonstarnews.com\/watch-donald-j-trump-calls-the-process-of-a-contested-convention-crooked-as-hell\/ |","updated_time":"2016-04-05T13:44:23+0000","id":"394462630661212_954258864681583"},{"story":"Larry Hilt shared Americans Defending The 2nd's photo to the group: Constitutional Patriots.","updated_time":"2016-04-05T13:19:59+0000","id":"394462630661212_954531347987668"},{"updated_time":"2016-04-05T13:13:27+0000","id":"394462630661212_954528377987965"},{"story":"Larry Hilt shared Allen West Republic's photo to the group: Constitutional Patriots.","updated_time":"2016-04-05T12:35:17+0000","id":"394462630661212_954515151322621"},{"message":"Convention of States usurps the Sovereignty and Deliberative Status of your State Legislatures by allowing unelected \"Commissioners\" to write the Amendments, which is your State Legislators job. Let that sink in...","updated_time":"2016-04-05T06:06:03+0000","id":"394462630661212_952413578199445"},{"updated_time":"2016-04-05T05:32:36+0000","id":"394462630661212_954345024672967"},{"message":"You always hear about Trump not quoting the Constitution? He does..Just not in their fancy way,! With fancy words!\nTrump's #Constitution\n#DonaldTrumpRepublic2016","updated_time":"2016-04-05T03:02:43+0000","id":"394462630661212_954303081343828"},{"message":"Boycott Of Wisconsin Cheese If TRUMP IS SCAMMED OUT OF HIS WISCONSIN NOMINATION & Cruz Nominated Because Of Governor Walker's crooked politics.\nMILLIONS OF TRUMP SUPPORTERS LAUNCH WORLDWIDE PLEDGE TO  LIFETIME BOYCOTT OF WISCONSIN CHEESE.   IF GOVERNOR STOLE NOMINATION FROM DONALD TRUMP, BOYCOTT BEGINS IMMEDIATELY.... Enough Said.  Who Cut The Cheese?  Governor Scott Walker + Rafael & Heidi Cruz  Cut the Cheese.  Trump Supporters Are Life-Long Loyalists.  WE WILL NO LONGER CUT THE CHEESE IN OR FOR  WISCONSIN IF GOVERNOR THINKS HE IS BETTER THAN THE MOST POPULAR CANDIDATE, DONALD TRUMP!  WE CALL ON ALL NYC PIZZARIAS, FOOD CHAINS & RESTURANTS WORLDWIDE TO CUT THE WISCONSIN CHEESE OFF THEIR MENUS FOREVER IF GOVERNOR WALKER STOLE OUR MAN, DONALD TRUMPS NOMINATION.  BOYCOTT BEGINS AFTER FINAL VOTE!  The time for action is now.  Donald Trump has not received his just due support as the front-runner and it is time to hit the politicians in their pocket-books of their special interests groups.  Say Good-Bye To Cutting The Wisconsin Cheese if Governor Scott Walker Caused Trump to Take a Bad Rap Because of His Corrupt Backroom Politics!","story":"Bob Sallese shared his post to the group: Constitutional Patriots.","updated_time":"2016-04-05T02:29:03+0000","id":"394462630661212_954291251345011"},{"story":"Tina Lane shared Tina Lane's event to the group: Constitutional Patriots.","updated_time":"2016-04-05T00:13:40+0000","id":"394462630661212_954235594683910"},{"message":"According to Pew Research both retirees and the number of laid-off workers who have grown discouraged about re-employment contribute to today’s 94 million people out of the workforce.\n\nBut Pew says that another key factor is “…teens and young adults aren’t as interested in entering the work force as they used to be, a trend that predates the Great Recession.” “The share of 16- to 24-year-olds saying they didn’t want a job rose from an average 29.5\u0025 in 2000 to an average 39.4\u0025 over the first 10 months of this year.”\n\nIs there a trend growing that government will tax those who work and give to those who choose to not work, is a sluggish economy and recovery driving this, or is something else at play?\n\n","updated_time":"2016-04-04T23:40:30+0000","id":"394462630661212_954220351352101"},{"updated_time":"2016-04-04T23:37:40+0000","id":"394462630661212_954219341352202"},{"updated_time":"2016-04-04T21:38:41+0000","id":"394462630661212_953781654729304"},{"updated_time":"2016-04-04T21:31:33+0000","id":"394462630661212_954164488024354"},{"message":"The Biggest Scam In United States History! G. Edward Griffin Speaks With Stefan Molyneux ~ see article: http:\/\/wp.me\/p2X3AR-fUJ","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-04T21:23:13+0000","id":"394462630661212_954017771372359"},{"message":"People who hate Trump are trying to attack him for \"back tracking\" when he initially said women who have abortions would need to be punished. Trump is not a \"polished politician\" and he has not always been pro-life. He answered it the way the average pro-life person would answer if they have not been \"coached\". \n\nIf something is made illegal, of course there needs to be some punishment for breaking that law!\n\nNow, most pro-life politicians won't come out and say that because the left wing media will spin that negatively. So they will say something like \"the women are the victims too...\" And deflect and obfuscate.\n\nBut if you could pin them down, deposition style and ask them this:\n\n\"Suppose we have made abortion illegal, yet a woman gets pregnant and then decides to take combinations of drugs to abort the baby, she does this whenever she has an unwanted pregnancy. She tells people about this and even how to do it if they want to also abort at home. Should she face punishment?\"\n\nWhat would they say?\n\nThe only possible pro-life answer is YES!\n\nShe needs to be punished.\n\nI say at a minimum first offenders would need psychiatric treatment in a supervised, inpatient setting.\n\nRepeat offenders?\n\nTie their tubes.\n\nSo they attack Trump for \"backtracking\"?\n\nAnd then issuing a statement saying the same answer all these pro-life politicians give?\n\nWhy? If anything this is evidence that he is really pro life now and that his change of postition is true.","updated_time":"2016-04-04T21:15:40+0000","id":"394462630661212_954153954692074"},{"updated_time":"2016-04-04T19:51:07+0000","id":"394462630661212_954118401362296"},{"message":"Note:  Heidi and \"Ted\" call their marriage the \"first Bush marriage\" since they met while campaigning for him. She did not dissent on her North American Union task force for the CFR, rather she said explicitly said she supported the report *and* their globalist recommendations. It is not just her, it is his advisors and donors too.\n\n","updated_time":"2016-04-04T18:20:19+0000","id":"394462630661212_954082984699171"},{"message":"How quickly people forget. True many of us were all about the war effort, and probably don't realize what Bush was up to with Canada and Mexico. Same crap that Heidi said she supported on her CFR task force. Same stuff Cruz's donors like. Same stuff all his neocon\/cfr advisors want.\n\n","updated_time":"2016-04-04T18:03:18+0000","id":"394462630661212_954077404699729"},{"message":"FOLKS THIS IS INSANE!!! ","updated_time":"2016-04-04T17:32:30+0000","id":"394462630661212_954060751368061"},{"updated_time":"2016-04-04T17:29:34+0000","id":"394462630661212_954059478034855"},{"message":"http:\/\/host.madison.com\/ct\/news\/local\/govt-and-politics\/election-matters\/donald-trump-mocks-scott-walker-in-wisconsin\/article_eb92c652-2d69-551f-ac77-52d5165c206c.html","updated_time":"2016-04-04T15:01:00+0000","id":"394462630661212_953991704708299"},{"updated_time":"2016-04-04T14:38:27+0000","id":"394462630661212_953981371375999"},{"updated_time":"2016-04-04T14:23:36+0000","id":"394462630661212_953975698043233"},{"updated_time":"2016-04-04T14:00:07+0000","id":"394462630661212_953965361377600"},{"updated_time":"2016-04-04T13:34:19+0000","id":"394462630661212_953951464712323"},{"updated_time":"2016-04-04T08:59:58+0000","id":"394462630661212_953845474722922"},{"story":"David McGarvey shared his post to the group: Constitutional Patriots.","updated_time":"2016-04-04T03:35:19+0000","id":"394462630661212_953746624732807"},{"message":"I am a quadriplegic, paralyzed from the neck down and cannot speak, but I have a voice. With the help of my Family, I made a video to show my support for Donald Trump: https:\/\/www.facebook.com\/100006568457367\/videos\/1752007905028141\/?pnref=story","updated_time":"2016-04-03T22:09:00+0000","id":"394462630661212_953605508080252"},{"message":"Military Turns On Obama, U.S. Generals To Force Obama Out Of The White House?!\n","updated_time":"2016-04-03T21:35:30+0000","id":"394462630661212_953594314748038"},{"updated_time":"2016-04-03T20:47:55+0000","id":"394462630661212_953505608090242"},{"message":"'Strong Cities Network': Trilateral, CFR, Rothschild Connections ~ see article here: http:\/\/wp.me\/p2X3AR-fTQ","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-03T16:42:20+0000","id":"394462630661212_953465798094223"},{"message":"****TRUMP HAS CLEARLY SEPARATED HIMSELF AND CRUZ ON TRADE AND FOREIGN POLICY. HE HAS CHOSEN PALEOCON NON-INTERVENTIONISM AND ECONOMIC NATIONALISM AND CRUZ IS IN DEEP WITH THE BUSHPUBLICAN NEOCON INTERVENTIONIST CABAL THAT BROUGHT US NAFTA AND \"NATION BUILDING\" FOR THE BARGAIN PRICE OF 2+ TRILLION****\n\nTake a read through this when you have time. People read a lot of anti-Trump pieces, this may paint him in a different light. I believe that this is exactly the reason why the oppose him so fiercely, not his wife, or his past positions from a decade or two ago, etc. They don't want America to be able to tell the UN and dhimmi-Euro countries to piss off.\n\n******************************************\nThe Trump Doctrine: Peace Through Strength:\n\nThose who insist Donald Trump has no foreign policy are simply not listening. The “Trump Doctrine” is a page right out of Ronald Reagan’s playbook: peace through economic and military strength.\n\nTrump knows the key to keeping America safe in an increasingly dangerous world is to “make America great again” through economic renewal. America must have the fiscal firepower to end Pentagon’s budget sequestration in order to fund the military the U.S. needs for adequate defense. Cutting the corporate tax rate and cracking down on unfair trade practices to increase America’s GDP growth rate are just as demonstrative of national might as the F-35. Here is how President Trump would use a newly empowered economy and military confront our rivals abroad:\n\nDefeating Daesh\n\nThe best way to kill ISIS is to cut off its own financial head in two ways: first, target any oil fields that it may be using as a cash register and “follow the money” through the Internet and expropriate it. Trump is probably aware of Nietzsche’s admonition to beware that “when fighting monsters, you yourself do not become a monster.” Trump also knows that when you are facing an enemy willing to bomb your sons and daughters and behead prisoners, you must strike equal fear into the heart of that enemy. Under a Trump Administration, no ISIS member will be safe, the cells of Guantanamo will be fuller, and America will be safer.\n\nOverturning the Iran Nuclear Deal\n\nTrump believes, as the strange bedfellows of Saudi Arabia and Israel are wont to do, that the Obama administration has made a terrible deal with Iran. Removing sanctions will allow this fascist, terrorist state to restore it economy and continue to develop capabilities to deliver nuclear warheads as near as Riyadh and Tel Aviv and as far away as Brussels and New York. President Trump will abrogate that deal the day he takes office. As commander in chief, he will exert both economic and military pressure on Saudi Arabia, our quasi-enemy that has pledged to destroy Israel and dreams of ruling a new Middle Eastern caliphate. As far as Israel is concerned, however, Trump appears to regards this democratic state as America’s most important ally in the Middle East. But Trump, along with most Americans, disagrees with hardliners who insist there can be no deal brokered between Israel and the Palestinians. A deal is possible, but you cannot have peace unless you are willing to negotiate.\n\nFrom Russia, With Revanchism\n\nTrump recognizes Vladimir Putin for the clever, ruthless, charismatic leader that he is. Putin has run strategic circles around both America and its NATO allies when it comes to Russia’s military intervention in Crimea, Ukraine, Syria, and former Socialist Republics like Georgia and Latvia.\n\nPutin recognizes Trump as a strong and fearless leader who will draw clear red lines in Europe and the Middle East that Putin dare not cross. This is a far better and safer situation for America than a status quo Russia policy that leads from behind and inspires far more contempt from Putin than respect.\n\nChina’s Rising Phoenix\n\nTrump will no longer tolerate a mercantilist China having its way with America’s factories and jobs. He will firmly crack down on unfair trade practices like illegal export subsidies, currency manipulation, and intellectual property theft and bring American jobs and factories home.\n\nThat’s not just good trade policy—it’s good foreign policy, too. China’s rapidly advancing military strength has been its ability to economically grow much faster than its strategic rivals. In other words, by rebalancing trade between the US and China, Trump will also rebalance the military equation in America’s favor.\n\nSharing the Burden of Defense\n\nTrump has made headlines about revamping America’s alliances—from NATO to our allies in Asia. Trump knows the problem here is not that these alliances are not useful to the defense of the American homeland. Rather, Trump is tired of the U.S. having to pay the lion’s share of the bill to protect wealthier nations unwilling to spend the requisite funds to defend their own homelands. Consider that while the U.S. spends fully 3.5 percent of its GDP on defense, Japan is at a measly 1.0 percent, Germany is at 1.1 percent, and even South Korea, with an absolute madman on its border contributes a measly 2.6 percent. As president, Trump will demand a better deal for American taxpayers.\n\nTrump’s “Distributed Network” of Advisors\n\nIn laying out his Trump Doctrine, Trump has assiduously avoided surrounding himself with a large circle of advisors. He has done so because he has “off the record” access to a broad distributed network of experts around the world—as well as an inner circle that stays out of the limelight. From his own detailed foreign policy research over many years—required due diligence to conduct business globally—Trump has developed a strong aversion to the kind of “nation building” that dragged America into wasted and protracted wars in God-forsaken killing fields like Iraq and Afghanistan. Accordingly, Trump has promised the American people – he will not be shedding the blood of any American soldier either in vain or under the vanity banner of American Exceptionalism. This is how Trump is in tune with the American public that is both tired of war and ready for the new era of prosperity that will usher in peace founded on true American power.\n\n","updated_time":"2016-04-03T15:38:45+0000","id":"394462630661212_953426241431512"},{"message":"Cruz supporters are out in force bragging about his foreign policy team. Gaffney is often mentioned as an \"all star\".  Yes, an all star neocon interventionist scumbag.\n\nNo more bushpublican bullsh*t!\n\nNo more interventionism!\n\nNo more \"nation building\"!\n\nNo more bs \"conflicts\"!\n\nPEACE THROUGH STRENGTH.\n\nIf we go to war we go to kick ass and break things and we don't have to \"build democracy\" after, we can leave it broken.\n\nDo you see Putin trying to rebuild the crap Russia just bombed in Syria?\n\nAMERICA FIRST.\n\nVOTE TRUMP!!!!\n\n(And yes Gaffney was right to expose the port deal, no one says these neocons are always wrong)\n\n","updated_time":"2016-04-03T15:22:42+0000","id":"394462630661212_953415938099209"},{"updated_time":"2016-04-03T15:21:15+0000","id":"394462630661212_953417654765704"},{"message":"Cruz supporters LIE about Heidi. Some probably don't realize it, having never bother to actually download and read the report of the CFR Task Force she was on. \n\nI have, and I have noticed that all the memes and articles they pass around defending Heidi, leave off the first two and a half or so sentences, of what she wrote. \n\nSome go as far as to capitalize a word in the middle of one of her sentences to make it appear that is the start. That is LYING.\n\nSo why do they not want you to know that Heidi, in her own words said she supported that report AND the recommendations?\n\nHere are some of those recommendations, that Heidi Cruz *supported*, with the page numbers noted, so you can verify on the linked CFR document. (Her section is on page 33-34, where she says she supports)\n\nhttp:\/\/i.cfr.org\/content\/publications\/attachments\/NorthAmerica_TF_final.pdf\n\n########################\n\nLay the ground work for the freer flow of people within North America. (p10):\n\nThe three governments should commit themselves to the long-term goal of dramatically diminishing the need for the current intensity of the governments’ physical control of cross-border traffic, travel, and trade within North America. A long-term goal for a North American border action plan should be joint screening of travelers from third countries at their first point of entry into North America and the elimination of most controls over the temporary movement of these travelers within North America.\n ########################\n\nOpen skies and open roads (p25):\n\nThe efficiency of the transportation network is critical to making North America a more competitive place to invest and to produce, and in spreading the benefits of economic growth to all corners of the continent. Among other regulatory reforms, governments should consider the benefits of allowing North American transportation firms unlimited access to each others’ territory, including provision for full cabotage (trade between two points within a country; for example, a Canadian trucker hauling freight from Chicago to Los Angeles or an American airline carrying passengers between Mexico City and Monterrey) for airlines and surface carriers.\n ########################\n\nExpand temporary migrant worker programs (p27):\n\nCanada and the United States should expand programs for temporary labor migration from Mexico. For instance, Canada’s successful model for managing seasonal migration in the agricultural sector should be expanded to other sectors where Canadian producers face a shortage of workers and Mexico may have a surplus of workers with appropriate skills. Canadian and U.S. retirees living in Mexico should be granted working permits in certain fields, for instance as English teachers.\n ########################\n\nMove to full labor mobility between Canada and the United States (p27-28):\n\nTo make companies based in North America as competitive as possible in the global economy, Canada and the United States should consider eliminating all remaining barriers to the ability of their citizens to live and work in the other country. This free flow of people would offer an important advantage to employers in both countries by giving them rapid access to a larger pool of skilled labor, and would enhance the well-being of individuals in both countries by enabling them to move quickly to where their skills are needed. In the long term, the two countries should work to extend this policy to Mexico as well, though doing so will not be practical until wage differentials between Mexico and its two North American neighbors have diminished considerably.\n ########################\n\nA North American Advisory Council (p31):\n\nTo ensure a regular injection of creative energy into the various efforts related to North American integration, the three governments should appoint an independent body of advisers. This body should be composed of eminent persons from outside government, appointed to staggered multiyear terms to ensure their independence. Their mandate would be to engage in creative exploration of new ideas from a North American perspective and to provide a public voice for North America. A complementary approach would be to establish private bodies that would meet regularly or annually to buttress North American relationships, along the lines of the Bilderberg or Wehr-kunde conferences, organized to support transatlantic relations.\n ########################\n \nAll the report recommendations that Heidi Cruz said, in her own words, she supports, are from pages 7 through 32 in the pdf document","updated_time":"2016-04-03T14:28:33+0000","id":"394462630661212_953393298101473"},{"story":"Niki Hannevig shared Fox News Sunday's video to the group: Constitutional Patriots.","updated_time":"2016-04-03T13:58:06+0000","id":"394462630661212_953373674770102"},{"updated_time":"2016-04-03T13:34:12+0000","id":"394462630661212_951405811633555"},{"message":"http:\/\/www.sfchronicle.com\/news\/politics\/article\/Kasich-tells-Wisconsin-GOP-I-don-t-even-like-7223733.php","updated_time":"2016-04-03T13:18:55+0000","id":"394462630661212_953358494771620"},{"message":"Gingrich On Trump - Wisconsin, Unforced Errors And The Very Green Grass Ahead  \n\n","updated_time":"2016-04-03T13:00:23+0000","id":"394462630661212_953351014772368"},{"updated_time":"2016-04-03T10:26:54+0000","id":"394462630661212_953292838111519"},{"message":"Anyone who chooses A is a domestic enemy.","updated_time":"2016-04-03T08:26:23+0000","id":"394462630661212_953256288115174"},{"story":"Seamus Hall McManus shared Patriots Global Alliánce's photo to the group: Constitutional Patriots.","updated_time":"2016-04-03T07:35:06+0000","id":"394462630661212_951133521660784"},{"message":"The vets are the backbone of our nation.","updated_time":"2016-04-03T07:29:19+0000","id":"394462630661212_952996524807817"},{"message":"Pew Research, using Federal Reserve data AFTER the Great Recession (exclusively Obama’s watch; 2010 - 2013) found that: “the median wealth of non-Hispanic black households FELL 33.7\u0025, from $16,600 in 2010 to $11,000 in 2013. Similarly, among Hispanics, median wealth FELL 14.3\u0025, from $16,000 to $13,700.\n\nOther data show that the black job participation rate is the lowest in 40 years.\n\nWhy would those hurt most by policies that implement a government-managed economy support Hillary or Bernie, the candidates who promise more of the same?\n\n","updated_time":"2016-04-03T02:22:52+0000","id":"394462630661212_953113818129421"},{"message":"Fox News Channel is airing a documentary this weekend: “Rising Threats \/ Shrinking Military”\n\nIf you have not watched it, please do so.","updated_time":"2016-04-03T01:25:55+0000","id":"394462630661212_953086361465500"},{"updated_time":"2016-04-03T00:40:56+0000","id":"394462630661212_953054801468656"},{"updated_time":"2016-04-02T23:21:11+0000","id":"394462630661212_953004838140319"},{"message":"They are trying to shut her up..\n","updated_time":"2016-04-02T21:27:58+0000","id":"394462630661212_952963028144500"},{"updated_time":"2016-04-02T17:36:40+0000","id":"394462630661212_952842138156589"},{"message":"What we need to learn from this week’s massive demonstration in France ~ see article: http:\/\/wp.me\/p2X3AR-fSh","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-02T16:24:24+0000","id":"394462630661212_952789898161813"},{"updated_time":"2016-04-02T14:07:50+0000","id":"394462630661212_952477531526383"},{"message":"http:\/\/www.nbcnews.com\/politics\/2016-election\/cruz-walker-embrace-wisconsin-crowd-goes-silent-palin-n549611","updated_time":"2016-04-02T13:30:08+0000","id":"394462630661212_952693491504787"},{"message":"It’s wonderful that some state legislatures are using backbone and making progress with successful bills setting the foundation to reject various gun control measures.  Would you be surprised to learn that Convention of States Project doesn’t seem to think so? They are more concerned about whether or not something qualifies as “nullification” under their definition of it.\n\nWhat many don’t realize is that COSP has to reject nullification because their marketing schema requires that an Art V convention to change the US Constitution is the only way to save America.\n\nThis report includes two educational videos totaling 5 mins that everyone should watch.  They debunk COSP’s definition.  \n\nIndiana’s 2016 super majority of Republicans failed to move our constitutional carry bill but they passed a COSP application. The majority of our legislators would rather change the US Constitution then enforce the one we have and the COSP supporters cheered it. People better wake up.\n\n","updated_time":"2016-04-01T23:30:23+0000","id":"394462630661212_952360228204780"},{"message":"The liberals’ false pretense that they, unlike conservatives, care for the poor and minorities (they say demonstrated by the lowest unemployment in eight years) is belied by these easy-to-understand figures: 1) The number of Americans receiving food stamps today is at an all time high, 2) 94 million Americans have left the labor force (the last time unemployment was under 5\u0025 only 28 million Americans were out of the labor force), 3) Black job participation rate is the lowest in 40 years and black household wealth is DOWN 33.7\u0025 just since 2010 (dropped from $16,600 to $11,000), 4) Median income is at a 20-year low (back down to the 1995 figure in 2013 dollars).\n\nConsider how you vote.\n\nSee, for example, these USDA figures on food stamp dependence:\n","updated_time":"2016-04-01T22:56:24+0000","id":"394462630661212_952351581538978"},{"updated_time":"2016-04-01T21:55:51+0000","id":"394462630661212_951371131637023"},{"updated_time":"2016-04-01T21:54:00+0000","id":"394462630661212_952331778207625"},{"message":"Trump is right..#TRUMP2016 #MAKEAMERICAGREATAGAIN\n","updated_time":"2016-04-01T21:45:46+0000","id":"394462630661212_952328418207961"},{"message":"................................Our Vets need our help.................................\nJoin us...Washington DC...June 25...Area 2....Capitol building grounds....\nRaising awareness of the 22+ Veterans who commit suicide every day.\nRally pg- https:\/\/www.facebook.com\/groups\/828975500569323\/\nEvent pg https:\/\/www.facebook.com\/events\/1606622089576835\/","story":"Tina Lane shared Defenders of Liberty MC's photo to the group: Constitutional Patriots.","updated_time":"2016-04-01T18:36:41+0000","id":"394462630661212_952259744881495"},{"message":"Can you believe this??? ","updated_time":"2016-04-01T17:30:11+0000","id":"394462630661212_951112221662914"},{"message":"Obama Admin’s New Rules Will Create Spying Partnership Between Local Police, NSA ~ article here: http:\/\/wp.me\/p2X3AR-fQ9","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-04-01T17:08:26+0000","id":"394462630661212_952180124889457"},{"message":"Secretary of Disasters Kerry Explains How His Recklessness Made The World Safer \n","updated_time":"2016-04-01T12:56:56+0000","id":"394462630661212_951987478242055"},{"story":"Seamus Hall McManus shared Patriots Global Alliánce's photo to the group: Constitutional Patriots.","updated_time":"2016-04-01T12:50:55+0000","id":"394462630661212_951982288242574"},{"message":"Cultures are not equal.","story":"Jeremy Morgan shared XYZ's post to the group: Constitutional Patriots.","updated_time":"2016-04-01T12:03:53+0000","id":"394462630661212_951953958245407"},{"message":"EVERYONE CALL WRITE EMAIL FAX  GO SEE RIENCE PROEBUS AND THE RNC COMMITTEE AND DEMAND ONLY TRUMP   NO CRUZ NO KAISCH NO LITT NO RYAN NO ONE  BUT TRUMP WE HAVE CHOSEN TRUMP  AND WE DO NOT NOR WILL WE TOLRTE ANYONE ELSE WHERE TRUMP GOES WE GO!! WE WILL COLLAPSE THE RNC FOREVER IF  YOU DARE TRY TO TAKE THE NOMINATION  AND VOTE AWAY FROM HIM!!!!!!","updated_time":"2016-04-01T09:04:21+0000","id":"394462630661212_951411991632937"},{"message":"Globalist Shill Sen Cornyn Attacks Border Fence - Defends, Protects Invaders \n","updated_time":"2016-04-01T03:16:54+0000","id":"394462630661212_951652811608855"},{"updated_time":"2016-04-01T01:50:48+0000","id":"394462630661212_951604664947003"},{"message":"Help STATE Power by stopping Federal overreach that silences dissenting opinion\n\nSign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-04-01T01:49:30+0000","id":"394462630661212_951603854947084"},{"updated_time":"2016-04-01T01:46:24+0000","id":"394462630661212_951602748280528"},{"message":"Heidi Cruz - Globalist New World Order Puppet Exposed \n","updated_time":"2016-04-01T01:25:30+0000","id":"394462630661212_951589028281900"},{"message":"BE AN INFORMED VOTER!\n\nThe newly released political opinion book, “Some People Are Like The Old Prospector’s Mule…You Have To Hit ‘Em Between The Eyes With A Two-By-Four To Get Their Attention,” from author Joe Calitri and Page Publishing, is an illuminating and question-provoking read about the American electorate and the compelling need for citizens to become informed voters!\n\nConservative-minded folks will enjoy and appreciate “The Old Prospector’s Mule,” self-described moderates will avail themselves of valuable information, and leftists will learn why their ideology doesn’t work!\n\nNow available at retail bookstores, Amazon.com, Barnes & Noble, Apple iTunes, GooglePlay, and directly from the author through Facebook and beaninformedvoter.com.","updated_time":"2016-04-01T01:06:40+0000","id":"394462630661212_951567674950702"},{"message":"The united 50 States of America\n\nSecured Party Declaration And Notice\n\nUnder Uniform Commercial Code and Constitutional Law\n\nName of Sovereign: ___________________________________________________\n\nCity: ___________________________ Sovereign Nation\/State:_______________ Zip: [________]\n\nDate of Birth: ___________ Male: _____ Female: ______ Eyes: __________ Hair: ____________\n\nI Declare Myself a legal Sovereign, Operating Under Common Law, Title 4, U.S.C, 1, Flag of Peace and secure all my rights under U.C.C 1-207. I am NOT a corporate being dealing in commerce requiring a license of any kind. I travel by RIGHT, not by Privilege. Anything you say or do in violation of my Rights, can and will be used against you in a court of law.\n\nSignature of Sovereign: ________________________________________________________\n\n*************************************************************************************\n\nSovereign Right to Operate a Private Vehicle\n\n\"NOTICE\" TO PUBLIC SERVANTS intending to violate my free rights under law:\n\nThe Bearer, being an un-enfranchised Sovereign, is authorized under statute at large, First Congress 1789, Session 1, Chapters, page 52; Articles of Confederation, Article 4-3-1-1781; MC 38: Title 18, Section 241, USC Title 42, Section 1983, 1985, 1986, of the unhampered use of all navigable waters and all common law highways, roadways, and byways which are used for transport either private, public, or commerce anywhere in these United 50 States of America. Said driver\/operator is affirmed in obedience for the protection of the Constitution for the United States of America and may be detained only upon sworn complaint of an injured party as per the Bill of Rights, Article IV, and common law. The undersigned claims his rights at law as a Sovereign citizen (NOT a resident) of Colorado state, and rejects, and is not subject to, the contract obligations in equity known as the Motor Vehicle Codes of the respective states, via U.C.C. 1.\n\nNotice: The \"driverâ€™s license\" demanded, and provided under duress, which is issued by the state of Colorado, is NOT legally issued to me as a secured party with respect to the named party on the license, JEFFREY T. MAEHR, in all caps.\n\nCase Law: (Emphasis mine throughout)\n\nAmericans' \"freedom to travel throughout the United States has long been recognized as a basic right under the Constitution,\" according to multiple cases including Williams v Fears, 179 US 270, 274; 21 S Ct 128; 45 L Ed 186 (1900); Twining v New Jersey, 211 US 78, 97; 29 S Ct 14; 53 L Ed 97 (1908), as listed in the case of United States v Guest, 383 US 745; 86 S Ct 1170; 16 L Ed 2d 239 (1968), a case involving criminally prosecuting people for obstructing the right (obstruction is a federal crime pursuant to federal criminal law 18 USC 241).\n\nCase law shows that the \"liberty\" protected by the Fourteenth Amendment extends beyond freedom from bodily restraint and includes a much wider range of human activity, including but not limited to the opportunity to make a wide range of personal decisions concerning one's life, family, and private pursuits. See Meyer v, 262 US 390, 399; 43 SCt 625, 626; 67 L Ed 1043 (1923), and Roe v Wade, 410 US 113, 152-153; 93 S Ct 705, 726-727; 35 L Ed 2d 147 (1973). One of these life, family, private pursuits is obviously driving.\n\nIn effect, as per the Supreme Court decision in the case of Crandall v Nevada, 73 US 35; 18 L Ed (1867), speed limits and other traffic control devices, being non-fact-based, are simply an unlawful tax or impost on travel, and thus unconstitutional for the reason cited in Crandall. (Crandall involved a tax on travelers! which is what in essence speed limits, unscientific stop signs, etc., simply are, stripped of all the phony fraudulent politician folderol pretending them to relate somehow to safety, not to mention that are extortion violating the federal anti-racketeering act (RICO), 18 USC 1961 and the law against obstructing federal rights, 18 USC 241).\n\n42-2-101. Licenses for drivers required.\n\n(1) Except as otherwise provided in part 4 of this article for commercial drivers...\n\nColorado Article 42-2-101 clearly states, licensing is for commercial drivers, not private citizens..\n\n\"...For while a citizen has the right to travel upon the public highways and to transport his property thereon, that right does not extend to the use of the highways...as a place for private gain. For the latter purpose, no person has a vested right to use the highways of this state, but it is a privilege...which the (state) may grant or withhold at its discretion...\" State v. Johnson, 245 P 1073.\n\n\"The right to travel is a part of the liberty of which a citizen cannot be deprived without due process of law under the Fifth Amendment.\"\n\n\"Undoubtedly the right of locomotion, the right to remove from one place to another according to inclination, is an attribute of personal liberty, and the right, ordinarily, of free transit from or through the territory of any State is a right secured by the l4th Amendment and by other provisions of the Constitution.\" - Schactman v Dulles, 96 App D.C. 287, 293.\n\n\"The right to travel is part of the Liberty of which the citizen cannot be deprived without due process of law under the Fifth Amendment.\" Kent v. Dulles 357 U.S. 116, 125. Reaffirmed in Zemel v. Rusk 33 US 1.\n\n\"Where activities or enjoyment, natural and often necessary to the well being of an American citizen, such as travel, are involved, we will construe narrowly all delegated powers that curtail or dilute them... to repeat, we deal here with a constitutional right of the citizen...\" Edwards v. California 314 US 160 (1941).\n\n\"Even the legislature has no power to deny to a citizen the right to travel upon the highway and transport his property in the ordinary course of his business or pleasure, though this right may be regulated in accordance with the public interest and convenience. - Chicago Motor Coach v Chicago, 169 NE 22 (\"Regulated\" here means stop lights, signs, etc. NOT a privilege that requires permission or unconstitutional taxation; i.e. - licensing, mandatory insurance, vehicle registration, etc., requiring financial consideration, which are more illegal taxes.)\n\n\"The right of the citizen to travel upon the public highways and to transport his property thereon, either by carriage or by automobile, is not a mere privilege which a city may prohibit or permit at will, but a common right which he has under the right to life, liberty, and the pursuit of happiness.\"- Thompson v Smith, 154 SE 579.\n\n\"The right to travel is protected by the Equal Protection Clause of the 14th Amendment.\"\n\n\"Right to travel is constitutionally protected against private as well as public encroachment.\"\n\nVolunteer Medical Clinic, Inc. V. Operation Rescue, 948 F2d 218; International Org. Of Masters, Etc. V. Andrews, 831, F2d 843; Zobel v. Williams, 457 US 55, 102 Sct. 2309.\n\n\"The right to make use of an automobile as a vehicle of travel along the highways of the state, is no longer an open question. The owners thereof have the same rights in the roads and streets as the drivers of horses or those riding a bicycle or traveling in some vehicle.\" House v. Cramer, 1 12 N. W. 3; 134 Iowa 374 (1907).\n\n\"License: In the law of contracts, is a permission, accorded by a competent authority, conferring the right to do some act which without such authorization would be illegal, or would be a trespass or tort.\" Blacks Law Dictionary, 2nd Ed. (1910).\n\n\"The license means to confer on a person the right to do something which otherwise he would not have the right to do.\" City of Louisville v. Sebree, 214 S.W. 2D 248; 308 Ky. 420.\n\n\"The object of a license is to confer a right or power which does not exist without it.\" Pavne v. Massev, 196 S.W. 2D 493; 145 Tex. 273; Shuman v. City of Ft. Wayne, 127 Indiana 109; 26 NE 560, 561 (1891); 194 So 569 (1940).\n\n\"A license is a mere permit to do something that without it would be unlawful.\" Littleton v. Buress, 82 P. 864, 866; 14 Wyo.173.\n\n\"A license, pure and simple, is a mere personal privilege...River Development Corp. V. Liberty Corp., 133 A. 2d 373, 385; 45 N.J. Super. 445.\n\n\"A license is merely a permit or privilege to do what otherwise would be unlawful, and is not a contract between the authority, federal, state or municipal granting it and the person to whom it is granted...\"American States Water Services Co. Of Calif. V. Johnson, 88 P.2d 770, 774; 31 Cal. App.2d 606.\n\n\"A license when granting a privilege, may not, as the terms to its possession, impose conditions which require the abandonment of constitutional rights.\" Frost Trucking Co. V. Railroad Commission, 271 US 583, 589 (1924); Terral v. Burke Construction Company, 257 US 529, 532 (1922).\n\nPublic roads belong to the people, since we pay for them, therefore exercising oneâ€™s liberty upon them is a natural right. The right to travel, or to locomotion, is upheld in the constitution, and actually predate the constitution;\n\n\"These are rights which existed long before our constitution, and we have taken pride in their maintenance, making them a part of the fundamental law of the land.\"\n\n\"Personal liberty, which is guaranteed to every citizen under our constitution and laws, consists of the right to locomotion,â€”to go where one pleases, and when, and to do that which may lead to one's business or pleasure, only so far restrained as the rights of others may make it necessary for the welfare of all other citizens. . . .\n\n\"Any law which would place the keeping and safe conduct of another in the hands of even a conservator of the peace, unless for some breach of the peace committed in his presence, or upon suspicion of felony, would be most oppressive and unjust, and destroy all the rights which our Constitution guarantees.\" Pinkerton v Verberg, 78 Mich 573, 584; 44 NW 579, 582-583 (1889).\n\nThe general rule is that an unconstitutional statute, though having the form and name of law, is in reality no law, but is wholly void and ineffective for any purpose, since its unconstitutionality dates from the time of its enactment... In legal contemplation, it is as inoperative as if it had never been passed... Since an unconstitutional law is void, the general principles follow that it imposes no duties, confers no right, creates no office, bestows no power or authority on anyone, affords no protection and justifies no acts performed under it... A void act cannot be legally consistent with a valid one. An unconstitutional law cannot operate to supersede any existing law. Indeed insofar as a statute runs counter to the fundamental law of the land, (the Constitution JTM) it is superseded thereby. No one is bound to obey an unconstitutional law and no courts are bound to enforce it.\" Bonnett v. Vallier, 116 N.W. 885, 136 Wis. 193 (1908); NORTON v. SHELBY COUNTY, 118 U.S. 425 (1886)\n\n\"The word privilege is defined as a particular benefit, favor, or advantage, a right or immunity not enjoyed by all, or it may be enjoyed only under special conditions.\" Knoll Gold Club v. U.S., 179 Fed Supp. 377, 380.\n\n\"...those things which are considered as inalienable rights which all citizens possess cannot be licensed since those acts are not held to be a privilege.\" City of Chicago v. Collins, 51 N.E. 907, 910\n\n\"Illegitimate and unconstitutional practices get their first footing in that way, by silent approaches and slight deviations from legal modes of procedure. This can only be obviated by adhering to the rule that constitutional provisions for the security of persons and property should be liberally construed.\" Boyd v. United States, 116 U.S. 616, 635 (1884); Exparte Rhodes, 202Ala. 68 71.\n\n\"The State cannot diminish rights of the people.\" Hertado v. California, 110 U.S. 516\n\n\"Statutes that violate the plain and obvious principles of common right and common reason are null and void.\" Bennett v. Boggs, 1 Baldw 60.\n\n\"This Constitution, and the Laws of the United States which shall be made in Pursuance thereof;...shall be the supreme Law of the Land; and the Judges in every State shall be bound thereby, any Thing in the Constitution or laws of any State to the Contrary notwithstanding. The Senators and Representatives before mentioned, and the Members of the several State Legislatures, and all executive and judicial Officers, both of the United States and of the several States, shall be bound by Oath or Affirmation, to support this Constitution...\" Article VI of the U.S. Constitution:\n\n\"Under our system of government upon the individuality and intelligence of the citizen, the state does not claim to control him\/her, except as his\/her conduct to others, leaving him\/her the sole judge as to all that affects himself\/herself.\" Mugler v. Kansas 123 U.S. 623, 659-60.\n\n\"The assertion of federal rights, when plainly and reasonably made, is not to be defeated under the name of local practice.\"- Davis v. Wechsler, 263 U.S. 22, 24.\n\n\"Where rights secured by the constitution are involved, there can be no rule making or legislation which would abrogate them.\" - Miranda v. Arizona, 384 U.S. 436, 491.\n\n\"The claim and exercise of a constitutional right cannot be converted into a crime.\" - Miller v. U.S., 230 F 2d 486, 489.\n\n\"For a crime to exist, there must be an injured party. There can be no sanction or penalty imposed upon one because of this exercise of Constitutional rights.\"- Sherar v. Cullen, 481 F. 945.\n\nThere is no question that there is NO injured party involved here, and a citation\/ticket issued by a police officer, or jail\/incarceration for any cause including no valid driverâ€™s license, registration or insurance, and save for criminal activities involving an injured party, is a penalty or sanction, and is indeed \"converting a Right into a crime.\"\n\n\"The use of the highway for the purpose of travel and transportation is not a mere privilege, but a common and fundamental right which the public and individuals cannot be rightfully deprived.\" Chicago Motor Coach v. Chicago, 337 IIL200,169 NE 22, 66 ALR 834. Ligare v. Chicago 139 III. 46, 28 NE 934. Booney v. dark, 214 SW 607; 25 A M JUR (I'1) Highways, Sec. 163.\n\nSovereignty itself is, of course, not subject to law. Yick Wo vs. Hopkins, U.S. 356 (1886)\n\n\"Our system of government, based upon the individuality and intelligence of the citizen, the state does not claim to control him, except as his conduct to others, leaving him the sole judge as to all that only affects himself.\" Mugler v. Kansas 123 U.S. 623, 659-6O.\n\n\"A State may not impose a charge for the enjoyment of a right granted by the Federal Constitution.\" Murdock v. Pennsylvania, 319 U.S. 105, at 113.\n\nCompelling me, a sovereign individual, into a contract with Colorado by securing, for money, a \"driver's\" license or vehicle registration, or face fines or imprisonment for non-crimes, is a direct violation of my rights under law. My rights have been secured via my Uniform Commercial Code 1 filing with the Secretary of State of Colorado, and accepted.\n\nThe Claims will produce forensic evidence showing how the UNITED STATES OF AMERICA CORPORATION issues LETTERS OF MARQUE via Colorable de facto Laws, Statutes, Public Policies, Codes, Rules Administrative Procedures etc., to Agencies and the Agents in turn function as the Insurgents committing hostile and warlike acts of blatantly, directly, forcible, employing intimidation, fear, threats, actions such as coercion, terrorism, racketeering, privateering under the Color of Law and Color of Right, conspiring against, abridging and depriving the Defendants, and access to the Rights and Constitutional Exemptions of the Defendants and that are Secured and Protected by Law from such actions.\n\n1. Belligerency - the status of de facto statehood attributed to a body of insurgents, by which their hostilities are legalized. The international status assumed by a state (i.e. nation) which wages war against another.\n2. Belligerent - One who is hostile or combative which as a state is hostile, combative and wages war hostilities and aggression against its own citizens by a body of insurgents by which their war hostilities are presumed legalized.\n3. Privateer - A vessel owned, equipped, and armed by one or more individuals, and duly commissioned by a belligerent power to make war upon the enemy, usually by preying on his commerce. A vessel is commissioned by a state or a nation by the issue of a letter of marque to its owner to carry on all hostilities, presumably according to the laws of war. Formerly a state issued letters of marque to its own subjects, and to those of neutral states as well, but a privateersman who accepted letters of marque from both belligerents was regarded as a pirate. Piracy and Privateering are Federal offences 18 USCA 1692 et seq. See Blackâ€™s Law Dictionary 6th Edition page 1195\n4. Letter of Marque - An authorization formerly granted in time of war by a government to the owner of a vessel to capture enemy vessels and goods. See Article I 8 US Constitution.\n5. War - For there to be a war a sovereign or a quasi-sovereign must engage in hostilities. Pan American World Airways, Inc. v. Aetna Cas. & Sur. Co., C.A.N.Y., 505 F.2d 989,1005.\n6. Piracy - Those acts of robbery and depredation upon the high seas, which if committed on land, would have amounted to a felony. Whoever, on the high seas, commits the crime of piracy as defined by the law of nations, and is afterwards brought into or found in the United States, shall be imprisoned for life. 18 USCA 1651. Piracy and Privateering are Federal offences 18 USCA 1692 et seq. Blacks Law Dictionary\n\nFurther potential crimes:\n\n-Title 28- Judiciary and Judicial Procedure, Chapter 13 Civil Rights, 241 Conspiracy against private property rights.\n\n-Title 28- Judiciary and Judicial Procedure, Chapter 13 Civil Rights, 242 Deprivation of rights under color of law.\n-The 4th Constitutional Amendment; Deprivation of security of the Private Property Right from government invasion.\n-The 5th Constitutional Amendment Deprivation of Liberty and Private Property without Just Compensation.\n-The Theft of the Personal Private Property by Taking without Just Compensation.\n-The United States Code Title 42 Chapter 21 Subchapter I 1985-Conspiracy interfering with Private Property Rights.\n-The United States Code Annotated Title 18 1651 et seq Piracy and Privateering activities conducted on vessels at dry dock under commercial law by a body of insurgent Privateers.\n-The United States Code Title 18 152 and 3571 provides fine up to $500,000.00 or imprisonment for up to 5 years for the presenting of fraudulent claims, fraudulent indictment, fraudulent evidence.\n-The United States Code Title 42 Chapter 21 Subchapter II obstructing the evidence in the witnesses through the modification of language creating Federal Racketeering; Influenced and Corrupt Organizations activities extorting financial means creating economical damage point beyond recovery.\n-The United States Code Title 42 Chapter 21 Subchapter III deprivation of the evidence in the witnesses through modification of language creating acts of Federal Racketeering; Influenced and Corrupt Organizations; Terrorism; Privateering.\n-The United States Code Title 42 1986 For knowledge and the right to stop and correct a wrong,\n-The United States Code Title 28 USC 1746 and Title 18 1621 Perjury and conspiring to commit perjury.\n-The United States Code Title 18 1001 and the Federal Rules of Civil Procedure 9(b). Extorting private property through the modification of language.\n-The United States Code Title 18 Part I Chapter 95 1651 Interference with commerce by threats or violence.\n-Acting without establishing as a matter of record, Proper Jurisdiction over me.\n-Breach of Fiduciary Duty of Upholding the \"Oath of Office\" and Upholding the Office of Public Trust.\n-Acts of War against the United States Government Treaties and Organic Constitution Constituting Treason.\n-Violation of Substantive Rights and Private Property Rights Secured and Protection by Constitutional Law.\n-Employing Intimidation to affect Identity, Nationality, Birthright. Thief Using a Fiction, Artificial Person Name to Impersonate and Steal the Sovereign De Jure Identity.\n\nFederal law 18 USC 1961 bans engaging in a pattern of crime. When state and local officials in essence extort money, they are committing federal felonies and are in essence \"racketeers\" as per the law.\n\nUnder penalty of perjury, I affirm that the information contained in this document is true and correct to the best of my knowledge. All Specific Rights are explicitly reserved, without prejudice, U.C.C. 1-207, Common Law, Law of Nations.\n\nSigned:_______________________________________________ Date: ________________\n\nI declare under penalty of perjury that the identified Sovereign named above appeared before me with picture identification, and acknowledged this document before me as his personal testimony on;\n\nDate: __________________ \/s\/ ____________________________________________\n\n(NOTARY PUBLIC'S JURAT","updated_time":"2016-04-01T00:44:00+0000","id":"394462630661212_951556608285142"},{"updated_time":"2016-03-31T23:55:44+0000","id":"394462630661212_951501558290647"},{"story":"Seamus Hall McManus shared Patriots Global Alliánce's photo to the group: Constitutional Patriots.","updated_time":"2016-03-31T22:39:32+0000","id":"394462630661212_951445304962939"},{"updated_time":"2016-03-31T18:50:12+0000","id":"394462630661212_951135088327294"},{"updated_time":"2016-03-31T18:21:33+0000","id":"394462630661212_951250208315782"},{"story":"June Pitts shared Brian Musgrave's post to the group: Constitutional Patriots.","updated_time":"2016-03-31T17:42:28+0000","id":"394462630661212_951205318320271"},{"updated_time":"2016-03-31T17:35:36+0000","id":"394462630661212_950352291738907"},{"message":"Lincoln Hills’ Abuse Scandal - Who Knew What, When. Lack of Confidence in Gov. Scott Walker ~ see article here: http:\/\/wp.me\/p2X3AR-fP3","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-31T16:04:09+0000","id":"394462630661212_951120411662095"},{"updated_time":"2016-03-31T14:49:57+0000","id":"394462630661212_950893808351422"},{"story":"Seamus Hall McManus shared Patriots Global Alliánce's photo to the group: Constitutional Patriots.","updated_time":"2016-03-31T07:26:17+0000","id":"394462630661212_950729888367814"},{"updated_time":"2016-03-31T06:23:39+0000","id":"394462630661212_950699915037478"},{"updated_time":"2016-03-31T05:35:21+0000","id":"394462630661212_950657531708383"},{"message":"https:\/\/www.facebook.com\/washingtonstarnews\/posts\/1573676306294093\/ |","updated_time":"2016-03-31T02:10:21+0000","id":"394462630661212_950490758391727"},{"updated_time":"2016-03-31T02:06:58+0000","id":"394462630661212_950489581725178"},{"updated_time":"2016-03-30T22:33:42+0000","id":"394462630661212_950351028405700"},{"story":"Robert Kilpatrick shared Keeper's Mind Pool's photo to the group: Constitutional Patriots.","updated_time":"2016-03-30T22:25:09+0000","id":"394462630661212_950347985072671"},{"message":"WATCH THIS..Video from a mall in Dallas Fort Worth is going viral, and the footage is pretty disturbing. Mall Cop Tries To Kick Navy Seal Out Of Store.\n","updated_time":"2016-03-30T22:09:21+0000","id":"394462630661212_950340551740081"},{"message":"Is Bernie Sanders really the Democrat front-runner?\n\nThis would be the real political news of the moment (the disintegration of the leading Democrat candidate and fracturing of the Democrat Party) …. if it were not for the preoccupation of the media with Donald Trump’s & Ted Cruz’s silly Tweets about their wives.\n\n","updated_time":"2016-03-30T20:13:01+0000","id":"394462630661212_950268505080619"},{"message":"New Study Shows Mass Government Surveillance Silences Unpopular Opinions ~ article here: http:\/\/wp.me\/p2X3AR-fO5","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-30T18:07:13+0000","id":"394462630661212_950173441756792"},{"story":"Seamus Hall McManus shared Patriots Global Alliánce's photo to the group: Constitutional Patriots.","updated_time":"2016-03-30T15:47:05+0000","id":"394462630661212_950061788434624"},{"message":"Republicans wonder why they don't have women's vote","story":"David McGarvey shared The Witty Liberal's post to the group: Constitutional Patriots.","updated_time":"2016-03-30T15:32:44+0000","id":"394462630661212_950039611770175"},{"message":"If Donald J. Trump expects to win the Republican nomination, he must stop the stupid stuff. He must stop getting into the mud such as getting sucked into Tweet battles over candidate wives, etc.\n\nIt’s time for him to realize that there are important issues that the American people want solved and they may be willing to give him the opportunity to “Make America Great Again” if he stays out of the silly mudslinging. If he can’t do that, then “Bye, Bye #DonaldTrump”.\n\n","updated_time":"2016-03-30T15:01:57+0000","id":"394462630661212_950020328438770"},{"message":"In their Articles of Resolution, the Pacific Patriot Network, make the following claim:\nTwo witness have come forward and provided recorded eye witness accounts of the Bureau of Land Management (BLM), using drip torches, lighting fire along the boundary of the Hammond Ranch. One BLM crew started at the south end of the ranch and the second BLM crew started on the east side of the ranch creating a horseshoe of fire around the Hammond ranch. The Hammond’s responded with lighting back burns to prevent fire spread onto their ranch, protecting their private property. The witness was interview by Assistant United States Attorney (AUSA) Frank Papagni, Jr.. AUSA Papagni never called on this witness, nor in pre-trial discovery reported to the defense the existence of these witnesses.\nTherefore;\nCitizens for Constitutional Freedom request the Federal Bureau of Investigation (FBI) conduct a criminal investigation into prosecutorial misconduct for unlawfully withholding eyewitness testimony which would have aided in the Hammond’s defense. The withholding of evidence and actions by US Attorney Amanda Marshal has further led to the violation of the Hammond’s 5th Amendment and 8th Amendment Constitutional Rights.\nIf this is true, Assistant US Attorney Frank Papagni, Jr. is guilty of criminal misconduct. He knew of these witnesses, (it is alleged), yet refused to divulge their existence to defense attorneys, as he is required by law to do. Had the Hammonds’ lawyers known of their existence, the outcome of the trial might have been different. US Attorney, as head of the US Attorney’s office in Oregon is equally culpable. The Hammonds were tried as terrorists, for God knows what reason, for setting backfires on their property on one instance, to protect their property, and for burning their fields, in another, the fire getting out of control and spreading onto the BLM land. Yet, the BLM has lost control of its controlled burns, burning private land, yet they shrug it off as collateral damage, with the private landowners receiving no compensation. Meanwhile, the BLM received a judgement of $400,000 from the Hammonds. To put it mildly, it is insane.\nUS Attorney Amanda Marshall, an Obama appointee, is a piece of work. She resigned because of allegations by one of her Assistant Attorneys, that she was stalking him. You can find out her story here, here and here.\nDid the BLM and the Oregon US Attorney’s office conspire to railroad the Hammond family? It is time for a thorough investigation by the FBI. If the claims of criminal misconduct against Assistant US Attorney Papagni, Jr. are valid, he should be removed from his office and tried in court. If the claims are found to be valid, the convictions of Dwight and Steven Hammond should be overturned","updated_time":"2016-03-30T14:39:51+0000","id":"394462630661212_949959328444870"},{"message":"RUBIO ALSO ALL 3 THE EXACT SAME  DUPICATE OF EACH OTHER AND CRUZ AND  OBAMAS MOTHERS BOTH GAVE UP THEIR AMERICAN CTIZENSHIPS TO BECOME FOREIGN CITIZENS    2 YEARS BEFORE THEIR   BIRTHS!  BOTH ARE FOREIGN BORN CITIZENS  BORN IN FOREIGN LANDS--  HARVARD HAS A MANCHIRIAN CANDIDATE SCHOOL IN PROCESSING THEM OUT!!","story":"June Pitts shared Americans for Donald Trump's photo to the group: Constitutional Patriots.","updated_time":"2016-03-30T06:39:39+0000","id":"394462630661212_949659088474894"},{"message":"so we have the ones being like well less government is better because of this or that, then on the other side we got the ones like we need an army on the streets to protect us. then there is me. i agree with both sides.less government and more protection. i want to reform all federal agencies and put the power of each state in its own hands. the federal government sets limits on things, fine, when they step on the people its a problem. they should be focused on protecting the people and our states sovereignty. they should not be controlling the people taking land busting in doors. they dont need to be eliminated just redirected. states need more police less laws. they make up laws to control the people because its the only way they know how to keep people safe. i want more officers this way they can be heavy in high crime areas. however we also need less laws. any law that infringes on your right, needs be abolished. any law that restricts your pursuit to happiness, liberty or freedom needs to be removed. if you bring no harm then you should not be bothered. its not smaller government we need its proper government. all i wanna do is make America better than ever and make sure it cant be corrupted again. change things so we can all be happy.","updated_time":"2016-03-30T04:47:44+0000","id":"394462630661212_949551911818945"},{"story":"Tony DeTitta shared Informed Owners's photo to the group: Constitutional Patriots.","updated_time":"2016-03-30T02:47:48+0000","id":"394462630661212_949440635163406"},{"updated_time":"2016-03-30T01:39:48+0000","id":"394462630661212_949390661835070"},{"message":"GOOGLE Solar Project to Cost Taxpayers 1.6 Billion...\n\nStop Government crony capitalism now! Sign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-03-30T01:38:32+0000","id":"394462630661212_949390391835097"},{"message":"WHo here is in the North Eastern PA area. I would like to have a get together and educate others with ideas and knowledge.  We should always have contact and a plan for the old In Case Shit HAppens","updated_time":"2016-03-30T00:39:52+0000","id":"394462630661212_947928338647969"},{"message":"Honoring Our Vietnam Veterans ","updated_time":"2016-03-29T23:55:22+0000","id":"394462630661212_949307848510018"},{"message":"THIS IS INSANE!! ","updated_time":"2016-03-29T22:20:24+0000","id":"394462630661212_949188961855240"},{"message":"It seems that if government policy can impact wages, then the emphasis should be less on setting minimum wages and more on creating higher-paying private sector jobs.\n\nFor example, in the 1980’s when 25 quarters produced economic growth of 35\u0025 (compared to 14.3\u0025 in the most recent 25 quarters) the normalized per capita GDP grew 18.8\u0025 (vs 9.0\u0025 in this recovery). This means that if the current recovery had been only average, then after-tax per person income would be $3,339 per year higher. That puts a lot of additional folks above minimum wage without government intervention that some argue loses jobs.\n\nToday there are 94 million people over age 16 not working. If job growth had been just average, then at least 5 million more would be working. If the recovery had been as robust as the 1980’s, then there would be 12 million more working, again moving many above minimum wage.\n\n","updated_time":"2016-03-29T22:18:56+0000","id":"394462630661212_949244698516333"},{"story":"Seamus Hall McManus shared Patriots Global Nétwork's photo to the group: Constitutional Patriots.","updated_time":"2016-03-29T21:10:24+0000","id":"394462630661212_949199218520881"},{"updated_time":"2016-03-29T20:26:02+0000","id":"394462630661212_949168755190594"},{"message":"Bringing undocumented, Muslim refugees into this country \"Plays Into ISIS Hands\". Think you should care about the refugee stories NOT reported by the mainstream media?\n\nDo you think refugees on this boat have been vetted or are carrying documents? Think they may just be primarily young men of fighting age? Think some just might have hearts and minds aligned with radical Islamic terror? Think some just might get on Obama's list destined for refugee status in your community? \n\n","updated_time":"2016-03-29T20:00:15+0000","id":"394462630661212_949153118525491"},{"message":"Here is more trouble for seriously compromised presidential candidate Hillary Clinton. \n\nJudicial Watch has been granted access to records of communications between Hillary and her top State Department staff. \n\nThis is “exceedingly rare” in FOIA cases, but granted “where there is evidence of government wrong-doing and bad faith.”\n\nIs this the kind of experience you want in a candidate for POTUS?\n\n","updated_time":"2016-03-29T19:23:18+0000","id":"394462630661212_949132995194170"},{"message":"The best available information on what is going on in government and how we can influence governance consistent with our conservative values comes through Heritage Action and The Heritage Foundation.\n Check them out!!","updated_time":"2016-03-29T18:59:12+0000","id":"394462630661212_949110078529795"},{"message":"Chilling!!\n","updated_time":"2016-03-29T17:42:29+0000","id":"394462630661212_949022641871872"},{"updated_time":"2016-03-29T17:10:14+0000","id":"394462630661212_948984205209049"},{"updated_time":"2016-03-29T14:54:04+0000","id":"394462630661212_948868588553944"},{"message":"Be sure your Senator knows you oppose Obama’s nomination of Judge Merrick Garland to the Supreme Court. If you Tweet your message, use #NoHearingsNoVotes.\n\nAmong other progressive views, Judge Garland has a track record of opposing the Second Amendment and has signaled strong hostility to gun owner rights. \n\n","updated_time":"2016-03-29T13:35:08+0000","id":"394462630661212_948793595228110"},{"message":"Is anybody getting that Obama meant to promise:  “If you like high healthcare costs, you can keep your high healthcare costs.”\n\n“In the median cost state, the three most costly regulations collectively INCREASED PREMIUMS for younger adults by 44 percent, and for pre-retirement-age adults by 7 percent, relative to the previously available least expensive plans.”\n\nHere is why ObamaCare mandates (not freedom of choice) are driving up healthcare premiums:\n\nhttp:\/\/dailysignal.com\/2016\/03\/28\/3-ways-obamacares-insurance-regulations-could-cost-you\/?utm_source=heritagefoundation&utm_medium=email&utm_campaign=morningbell&mkt_tok=3RkMMJWWfF9wsRonu6vJdO\u00252FhmjTEU5z16uUoUK6xhIkz2EFye\u00252BLIHETpodcMTcRhMbHYDBceEJhqyQJxPr3NLtQN191pRhLiDA\u00253D\u00253D","updated_time":"2016-03-29T13:05:00+0000","id":"394462630661212_948772511896885"},{"message":"California may be the first state to pass a $15 minimum wage law although data from the Bureau of Labor Statistics indicates that low-wage workers are likely to be hurt the most.\n\nIn areas with median wages below $15\/hour “more than half the workers in these areas would have to receive a raise or lose their jobs. In relatively weak economies … the latter option seems more likely” according to this California Policy Center report. \n\n","updated_time":"2016-03-29T12:45:23+0000","id":"394462630661212_948756418565161"},{"updated_time":"2016-03-29T11:38:55+0000","id":"394462630661212_948721378568665"},{"updated_time":"2016-03-29T05:30:11+0000","id":"394462630661212_948476725259797"},{"updated_time":"2016-03-29T04:46:06+0000","id":"394462630661212_948441445263325"},{"updated_time":"2016-03-29T03:28:30+0000","id":"394462630661212_948374475270022"},{"updated_time":"2016-03-29T02:13:41+0000","id":"394462630661212_948323325275137"},{"message":"WE WILL ELECT PRESIDENT DONALD J. TRUMP!\n\nWe will BOYCOTT \"Meet The Press\". CNN and the other Soviet-Style Propaganda Networks to do so!\n\nPlease copy, paste and spread this message and save and attach to the photo to whatever groups you are within reach of.\n\nWe can longer support the sponsors of \"Meet The Press\" and all of CNN any longer after the blatant Soviet-Union Style Propaganda they used to try and destroy the candidacy of Donald J. Trump. This includes unfairly quoting him with words he never even uttered and trying to paint him as a racist while he was drawing away the Black American votes from the Clinton campaign in droves. It includes the plot to pump Rafael \"Ted\" Cruz, who is sponsored by Goldman Sachs like the Clintons along with their substitute alternative insurance candidates. This is while their mathematicians and experts in demography have determined that Rafael Cruz could never win an election nationwide against Clinton and that Donald Trump is the only candidate that can. \n\nfacebook.com\/proudtobeguilty\n\nNOW WE LAUNCH A FULL OUT BOYCOTT OF ALL SPONSORS OF CNN AND ALL SPONSORS OF \"MEET THE PRESS\" THAT BEGINS TODAY! \n\nFeel free to throw in the other networks early, if you wish, who are equally guilty. It is not hard to do. Keep a pen and pad next your television and jot down those products and candidates that sponsor these programs or begin a list of incumbents who do not endorse Trump so we can vote them out at the appropriate time. Money is the only language the criminals understand.\n\nI can not sit back and watch the Propaganda reminiscent of the Communist Soviet Union continue any longer. Chuck \"Clodd\" of \"Meet The Press\" made it no secret that Donald Trump was fair game before he ever even announced his candidacy and the facts are all over the internet. CNN has turned their network into a 24 hour infomercial in attacking Trump, pumping Hitlerly and boosting all of Trump's opponents who can not mathematically or demographically beat Hitlerly Clinton in a national election made up of a unified Democratic and Republican populous alike who overwhelmingly support the Trump Revolution!\n\nUnity is what this is all about and only has it been President Donald J. Trump's agenda since day one while all the rest continue to divide the nation through partisan bickering which makes little sense 99\u0025 of the time.\n\nCruz and Kasich have not been hit with any hard questions on foreign policy and while Trump gives specific answers as he did in concerning nuclear attacks, Isis and so many other foreign policy questions, he is completely demonstrative of his broad field of knowledge in much the way he makes sense of the country's even bigger economic problems. \n\nMeanwhile, the press turned around with questions to Trump's opponents that not only made no sense whatsoever but suggested they were all having the same flashbacks from the 60s while they were dropping acid with the Clintons in the mud at Woodstock and painting flowers on their body parts. I was just waiting for Cruz to respond to the ever so important question posed to him concerning Isis as \"you bet your sweet bippy\" but in his usual style of Soviet-type propaganda, he completely switched the topic around in that interview while switching the focus on his wife Heidi's intimate and financial arrangements of the past with Goldman Sachs. LOL, I don't think he thought that one through much since in sharp contrast, the public is still outraged that he hid his Goldman Sachs' financing and covered up that Heidi, his wife, served as their VP. I guess he had to take the focus of the most revolting fotos of Heidi which Cruz himself was the cause of them going around since he started some tit for tat game with his own wife as bait. Seriously folks, was their ever any competition as to who's wife is sexier but this is the game of mudslinging Cruz chose to fight. Botttom line...Trump and Melania win and Heidi and Cruz...LOOOSE!. I mean seriously folks, this Rafael Cruz is mentally unstable to be such a lowlife and drag his whole family into this but it certainly backfired on him!. What kind of moron would begin a war of the wives like that when Heidi can't hold a candle to Trump's wife Melania? Duh? Onlu a moron named Rafael \"Ted\" Cruz in is Elmer Fudd Halloween Costume.\n\nAnd with all due respect, Trump, has never once tried to use his wife's beautiful and stunning appearance to win votes while keeping her out of the spotlight. Cruz is a very sick individual but in the end, all he has done is focused on his wife's very shady ties to Goldman Sachs which has already been killing Hitlerly and Slick Willie in the polls as a conflict of interest in their run for the Presidency. Then again, Rafael Cruz might have been wearing his Elmer Fudd costome that day and thinking he was meeting with the tea party folk he has folked and forgot to stick on the Armani suit while actually going to Goldman Sachs' fundraiser. It must get confusing for him to wear so many different hats while Donald Trump is who he says he is and never tries to back away from hi strong viewpoints as any good leader should do. . , all other candidates seem to be clueless on foreign policy which is especially embarrassing to Hitlerly Clinton who has seemed more clueless than all of them put together. Her solution to defeating terrorism seems to be picking daises and citing 'she loves me, she loses me not\", when she was hit up with the hard questions. Was this woman really ever Secretary of State or were the front men who handle her lies about the servers the ones who were calling the shots while she was off on shopping sprees with Chelsea?. Meanwhile Rafael \"Ted\" Cruz, Kasich , Clinton and Sanders are handled with kit gloves on questions on foreign policy while Hitlerly, the disaster of all disasters as the Secretary of State; who negligently murdered Americans in Benghazi is hailed in some la-la land world of \"Meet the Press\" as some kind of foreign policy wizard. This, we are talking about,is the same beast that assassinated Qaddafi, a world leader of Libya, laughed about it on national television and gave rise to one of the worst terrorist groups threatening harm here a home against our own people as a result of her such poorly thought out actions. Need I say more?\n\nTo add insult to injury, concerning the Rafael \"Ted\" Cruz sleazy campaign attack against Donald Trump's very beautiful and classy wife while Cruz could only dream of having her in his own bedroom and then the networks along with his own Soviet Style propaganda machine try to blame his vicious attack on Trump.\n\nHow sleazy can one man like Rafael Cruz possibly get. If you want to talk about sleaze, let's talk about the whores at the bunny ranch where Heidi is party to that includes the Clintons themselves who have billed out for $675K per speech (oral sex is what some may call it) to their pimps at Goldman Sachs and also share membership with Rafael himself who had a million bucks left on the night stand that he failed ti file with the government ( tin his defense(I am told most whores don't file with the government plus, his defense was that he was f'ing over the American people so they should foot the bill).) And if you dig down deep long enough, you will easily find a whole orgy of Ted Trump's other opponents sacking up with Goldman Sachs or some of the other \"special interests\" groups who I am told get really kinky! Anyway, as usual, we can't blame Kasich, Cruz, Hitlerly or Sanders that much because from what I am told, it's their \"pimps\" that get the big percentages and that is why they have been giving away free XXX-rated programming on CNN, \"Meet the Press\" and the other networks, soon to be added to the list, that have been willing to air just about anything the FCC will allow them in order to keep the ole boys club goin'. They seem to think Donald may clean house and that has them all worried that the Donald may air his on his own infomercial...you know , the one where it outlines how the the 2008 worldwide crash, as portrayed in the latest DVD and movie \"The Big Short\" was allowed to happen by Slick Willie Clinton signing CFMA in the early 2000s under the engineering of Alan Greenspan. You know, where Greenspan was specifically mentioned as one of the chief pimps in the movie who acted under both the Clinton and Bush Dynasty. Dynasties that ended up becoming one in the same and where all those crooks in both the Republican and Democratic parties , serving in Congress and now dissing Donald, had their hand in it and in the piggy bank.. Now isn't tht special that neither party wants the Donald running against Hitlerly because none of them wants all those dirty beans spilled all over the Congressional floors and after all, what else is Donald's bets line of attack in a Trump vs. Hillary campaign while all Hillary has to work with is lies and sharp-shooters.\n\nSo please, begin your boycotting of the networks now so that after we get Trump elected, we can return to regular programming where CNN teaches your young and impressionable children that Caitlin Jenner, formerly their hero on the Wheaties Boxes known as Bruce Jenner, no longer has a penis but us an American hero for slicing it off. I know how anxious you are all are waiting to get back t that brand of entertainment that the FCC adores! \n\nIf you missed the episode, Mittler Romney plays it every night with his venture vulture buddies. It is their favorite CNN segment and he is still trying to get Rafael to endorse Caitlin as VP since she endorses Rafael. \n\nTHE TIME FOR ACTION IS NOW. FIRST WE MUST BOYCOTT ALL NBC and CNN SPONSORS AND PUT FOX, CBS AND ABC ON NOTICE THAT THEY SHALL BE NEXT.\n\nBOYCOTT, BOYCOTT, BOYCOTT, BOYCOTT! \n\n DON'T BE A CHUMP, VOTE FOR TRUMP... by the way, the best bet at this point is to lock in your votes for Trump now and completely delete these channels from your set.","story":"Bob Sallese shared Proud To Be Guilty  with Bob Sallese's photo to the group: Constitutional Patriots.","updated_time":"2016-03-29T00:41:45+0000","id":"394462630661212_948279785279491"},{"message":"Help us bypass Congress to restore States Rights and power as intended by the Constitution.\nSign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-03-28T22:37:47+0000","id":"394462630661212_948180621956074"},{"message":"This video really sums up the Syrian refugee problem, to me.  \n     \n   ","updated_time":"2016-03-28T18:22:33+0000","id":"394462630661212_948010418639761"},{"message":"What happens to the world?!\n","updated_time":"2016-03-28T18:22:22+0000","id":"394462630661212_948010365306433"},{"message":"Does The United States Still Exist? Paul Craig Roberts ~ read the article here: http:\/\/wp.me\/p2X3AR-fMQ","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-28T16:38:53+0000","id":"394462630661212_947916081982528"},{"message":"Criminal Counter Suit May Expose Criminal Conspiracy in LaVoy Finicum Murder, Including Oregon Governor","updated_time":"2016-03-28T14:24:03+0000","id":"394462630661212_947789938661809"},{"updated_time":"2016-03-28T05:11:26+0000","id":"394462630661212_947203802053756"},{"updated_time":"2016-03-28T02:52:44+0000","id":"394462630661212_947352528705550"},{"updated_time":"2016-03-28T01:42:53+0000","id":"394462630661212_947311342043002"},{"message":"Arizona's Primary Voting Fiasco Foretells Further Disenfranchisement in General Election ~ read article here: http:\/\/wp.me\/p2X3AR-fKG","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-27T21:30:03+0000","id":"394462630661212_947183705389099"},{"message":"Sure hope that this true.","updated_time":"2016-03-27T14:54:05+0000","id":"394462630661212_945361135571356"},{"updated_time":"2016-03-27T14:27:55+0000","id":"394462630661212_946839772090159"},{"message":"Live Free or Die. Help Bring Back National strength and security to America\n\nSign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-03-27T13:30:00+0000","id":"394462630661212_946795675427902"},{"updated_time":"2016-03-27T12:00:31+0000","id":"394462630661212_946742868766516"},{"updated_time":"2016-03-27T01:59:36+0000","id":"394462630661212_946345025472967"},{"message":"Post from Josh Bernstein: 'The war between Trump and Cruz supporters will only give the White House to George Soros. Read this to learn how and what we can do to prevent it. And don't comment unless you've read it. http:\/\/conservativefiringline.com\/note-to-conservatives-kno…\"","updated_time":"2016-03-27T00:48:00+0000","id":"394462630661212_946299595477510"},{"message":"They’re the cowards, not us. ","updated_time":"2016-03-27T00:25:34+0000","id":"394462630661212_946288598811943"},{"updated_time":"2016-03-26T20:39:16+0000","id":"394462630661212_946134652160671"},{"message":"Great talk by Admiral Lyons. Right in every respect!﻿","updated_time":"2016-03-26T19:14:30+0000","id":"394462630661212_946054865501983"},{"updated_time":"2016-03-26T18:15:27+0000","id":"394462630661212_945998182174318"},{"story":"Pam Barker shared The Liberty Beacon's post to the group: Constitutional Patriots.","updated_time":"2016-03-26T16:40:16+0000","id":"394462630661212_945896102184526"},{"message":"will Islam self-destruct and destroy itself first before it gets the chance to destroy the rest of the world?'","story":"Jeremy Morgan shared XYZ's post to the group: Constitutional Patriots.","updated_time":"2016-03-26T13:13:01+0000","id":"394462630661212_945708322203304"},{"message":"https:\/\/www.facebook.com\/168312490206503\/videos\/202561133448305\/","story":"Chuck Sidrum shared Accountability WE Demand it's video to the group: Constitutional Patriots.","updated_time":"2016-03-26T11:04:17+0000","id":"394462630661212_945643545543115"},{"message":"So I just had another \"debate\" with a Cruz supporter that ended with him making physical threats of violence. Not scared, in the least I have even offered to give some my address, but to go to that level seems to have happened with these people now at least 4 times for me.\n\nThe \"debate\" went like this:\n\n\"I won't do memes, you drumpf supporters rely on memes because you are too stupid to debate...\"\n\nI said \"fine, no memes, pick a topic and let's compare our candidates and see who is better...\"\n\nHe posts a rambling, 8 paragraph post, with just about every anti-Trump smear I can think of.\n\nI say \"hey, I said let's discuss, that means we converse, so pick one thing at a time and go with that\"\n\n(BTW he is cussing like a Sailor at me, all through this...which does not impress me since I am an actual retired USN Sailor and have heard it all and worse)\n\nI note to him that the first topic in his post was \"Trump attempted to abuse eminent domain..\" So I asked him to prove Trump was trying to *abuse* eminent domain. He provided no proof of alleged abuse. I then asked him if eminent domain use is so bad, why did Ted Cruz support, campaign and work for George W Bush, who used eminent domain to build a parking lot for a baseball stadium?\n\nMore cussing, switched topics to guns.\n\nHis argument: \"Did Trump once support banning assault weapons, YES or NO. Answer me!!!\"\n\nMy answer: \"Trump has admitted he changed his positions on guns, but since Cruz claims he is \"consistent\" and a \"staunch constitutionalist\" he could never change his positions on something as fundamental as guns. So Cruz must still believe that state assault weapons bans like NY, CA, CT are \"reasonable regulations\", right\"\n\nMore cussing, a few minutes of him telling me how stupid I am to say something like that since Cruz \"saved the second amendment\" when he \"won\" the Heller decision at the Supreme Court.\n\nI explained that Cruz actually did not argue before the SCOTUS for Heller and the brief he submitted for that is where he called the NY, CA, and CT assault weapons bans (as well as federal infringements) \"reasonable regulations\" .\n\nMore calling me a liar, and idiot, stupid, refuse to see the truth...etc.\n\nWhen I posted this meme? With Cruz's own actual words and the link to his own website to verify?\n\nThe threats of violence.\n\nI blocked him, sorry but idiots need to be blocked.","updated_time":"2016-03-26T07:38:11+0000","id":"394462630661212_945553798885423"},{"message":"Hey, Throw Me That Lifeline!\n>http:\/\/www.conservativepushcoalition.com\/CP\/?p=735\n\nSign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-03-26T04:49:30+0000","id":"394462630661212_945443362229800"},{"updated_time":"2016-03-26T04:05:14+0000","id":"394462630661212_945394582234678"},{"updated_time":"2016-03-26T03:42:37+0000","id":"394462630661212_945378038902999"},{"updated_time":"2016-03-26T03:03:03+0000","id":"394462630661212_945345015572968"},{"updated_time":"2016-03-26T02:32:20+0000","id":"394462630661212_945302642243872"},{"updated_time":"2016-03-26T01:07:32+0000","id":"394462630661212_945259675581502"},{"message":"This Cannot be True!!! HORIBLE! ","updated_time":"2016-03-26T00:41:35+0000","id":"394462630661212_945246982249438"},{"updated_time":"2016-03-25T22:37:02+0000","id":"394462630661212_945183385589131"},{"message":"***THE IMPORTANCE OF THIS SHOULD NOT BE OVERLOOKED*** True, she is not on the ballot, but neither was hillary when she tried to give us obamacare long before anyone had heard of obama. This is really bad news:\n\nHere are some of those recommendations, that Heidi Cruz *agreed with*, with the page numbers noted, so you can verify on the linked CFR document. (Her section is on page 33-34, where she says she agrees)\n\nhttp:\/\/i.cfr.org\/content\/publications\/attachments\/NorthAmerica_TF_final.pdf\n\n########################\n\nLay the ground work for the freer flow of people within North America. (p10):\n\nThe three governments should commit themselves to the long-term goal of dramatically diminishing the need for the current intensity of the governments’ physical control of cross-border traffic, travel, and trade within North America. A long-term goal for a North American border action plan should be joint screening of travelers from third countries at their first point of entry into North America and the elimination of most controls over the temporary movement of these travelers within North America.\n ########################\n\nOpen skies and open roads (p25):\n\nThe efficiency of the transportation network is critical to making North America a more competitive place to invest and to produce, and in spreading the benefits of economic growth to all corners of the continent. Among other regulatory reforms, governments should consider the benefits of allowing North American transportation firms unlimited access to each others’ territory, including provision for full cabotage (trade between two points within a country; for example, a Canadian trucker hauling freight from Chicago to Los Angeles or an American airline carrying passengers between Mexico City and Monterrey) for airlines and surface carriers.\n ########################\n\nExpand temporary migrant worker programs (p27):\n\nCanada and the United States should expand programs for temporary labor migration from Mexico. For instance, Canada’s successful model for managing seasonal migration in the agricultural sector should be expanded to other sectors where Canadian producers face a shortage of workers and Mexico may have a surplus of workers with appropriate skills. Canadian and U.S. retirees living in Mexico should be granted working permits in certain fields, for instance as English teachers.\n ########################\n\nMove to full labor mobility between Canada and the United States (p27-28):\n\nTo make companies based in North America as competitive as possible in the global economy, Canada and the United States should consider eliminating all remaining barriers to the ability of their citizens to live and work in the other country. This free flow of people would offer an important advantage to employers in both countries by giving them rapid access to a larger pool of skilled labor, and would enhance the well-being of individuals in both countries by enabling them to move quickly to where their skills are needed. In the long term, the two countries should work to extend this policy to Mexico as well, though doing so will not be practical until wage differentials between Mexico and its two North American neighbors have diminished considerably.\n ########################\n\nA North American Advisory Council (p31):\n\nTo ensure a regular injection of creative energy into the various efforts related to North American integration, the three governments should appoint an independent body of advisers. This body should be composed of eminent persons from outside government, appointed to staggered multiyear terms to ensure their independence. Their mandate would be to engage in creative exploration of new ideas from a North American perspective and to provide a public voice for North America. A complementary approach would be to establish private bodies that would meet regularly or annually to buttress North American relationships, along the lines of the Bilderberg or Wehr-kunde conferences, organized to support transatlantic relations.\n ########################\n \nAll the report recommendations that Heidi Cruz said, in her own words, she supports, are from pages 7 through 32 in the pdf document","updated_time":"2016-03-25T21:27:34+0000","id":"394462630661212_945140152260121"},{"message":"http:\/\/www.usatoday.com\/story\/news\/world\/2016\/03\/25\/easter-eggs-united-kingdom\/82251482\/","updated_time":"2016-03-25T18:09:32+0000","id":"394462630661212_944999142274222"},{"message":"OK so i wanted opinion on something. i look at pages and have decided not to add cretin request to this group. now i only go buy certain things i dont refuse any one for who they are. i use to try not to let in the wore accounts, or the spam ones either. you know they join every group to post that crap. and i am sorry but this group has nothing to do with that. however i have decided not to allow accounts that are not American. maybe they are trying to learn idk. however we need to work on our nation. so  was wondering your opinion on it that is OK. trying not to be to controlling this is an constitutional group, but in order to stay with that topic i feel its proper. or should i just let them in and wait to see if report there post. then remove them. hate spam post. only ones that are directed to our survival as a free nation are even permitted. so opinions, should i keep doing this or not.","updated_time":"2016-03-25T17:49:03+0000","id":"394462630661212_944110185696451"},{"message":"I was just told \"It's okay, everything will be fine, just wait. After Obama is out of office, our Vets will be taken care of.\"\nCurrent statistics say 34 Veterans a day commit suicide. But, not all states release their suicide rates to the VA, so those numbers could be double.\nObama leaves office in 302 days. Using current 'estimates', that means over 10,268 Veterans will commit suicide before then. In 2012, the statistics from only 21 states were used by the VA. If that is true now as well, it could easily be over 20,000 deaths.\nSorry..... but our Vets can't wait that long! ~TL~\nEvent - https:\/\/www.facebook.com\/events\/1606622089576835\/\nGroup - https:\/\/www.facebook.com\/groups\/828975500569323\/","story":"Tina Lane shared Tina Lane's event to the group: Constitutional Patriots.","updated_time":"2016-03-25T15:25:28+0000","id":"394462630661212_944867358954067"},{"message":"A must read highly informative book \"ISLAM VERSUS THE REST: THE THIRD WORLD WAR\" the content of this book is unique and exclusive, unprejudiced assessment of ground realities, read extraordinary information about region and religion something most people have never heard before, and provides broader perspective of global terrorism and of other social problems,\n\nEbook: http:\/\/www.amazon.com\/Islam-versus-Rest-Third-World-ebook\/dp\/B00WAF03VO\/ref=sr_1_1_twi_kin_2?ie=UTF8&qid=1451040141&sr=8-1&keywords=islam+versus+rest+the+third+world+war\n\nPrint book:http:\/\/www.amazon.com\/Islam-versus-Rest-Third-World\/dp\/1511880244\/ref=sr_1_1_twi_pap_1?ie=UTF8&qid=1452507879&sr=8-1&keywords=Islam+versus+the+rest+the+third+world+war","updated_time":"2016-03-25T13:26:15+0000","id":"394462630661212_944746482299488"},{"updated_time":"2016-03-25T02:16:24+0000","id":"394462630661212_944337832340353"},{"updated_time":"2016-03-25T01:18:15+0000","id":"394462630661212_944290952345041"},{"message":"https:\/\/www.facebook.com\/events\/490089987859309\/","story":"Doug Whitlatch shared Anthony Whitehead's event to the group: Constitutional Patriots.","updated_time":"2016-03-24T23:15:46+0000","id":"394462630661212_944225319018271"},{"updated_time":"2016-03-24T22:47:46+0000","id":"394462630661212_944209822353154"},{"message":"Merrick Garland has been described as: \n“A reliable fifth vote for a laundry list of extreme liberal priorities.”\n“The most anti-gun nominee in recent history.”\n“Having a long record of deference to unaccountable government bureaucrats.”\n“Of a voting bloc on the court that consistently upholds abortion on demand.”\n\nhttps:\/\/www.facebook.com\/heritageforamerica\/photos\/a.218307661516440.66540.116546288359245\/1324328804247648\/?type=3&theater","story":"Don Kirchoff shared Heritage Action for America's photo to the group: Constitutional Patriots.","updated_time":"2016-03-24T21:58:23+0000","id":"394462630661212_944180049022798"},{"message":"Law enforcement used phony names and refused to identify themselves!","updated_time":"2016-03-24T21:44:40+0000","id":"394462630661212_944173849023418"},{"message":"U.S. Representative Will Hurd responds to the incredibly misguided PC concerns for “unduly targeting” Muslims in efforts to combat ISIS recruiting. While apparently ISIS initiates four social media campaigns per day reaching 10’s of millions of people in 49 languages, our State Department counters with a roaring couple tweets per day.\n\nAnd a Democrat Congressman on this committee follows the delusion of the failed Obama\/Clinton policy of political correctness. I’ll bet Muslims who have assimilated successfully in the US would agree with Mr. Hurd, not the PC Democrat.\n\nHow much longer can this country afford to continue electing incompetent Democrat politicians who are more concerned about Muslim sensitivities than they are about the victims of radical Islamic terror and civilized society?\n\nhttps:\/\/www.facebook.com\/HurdOnTheHill\/videos\/823136571146874\/?pnref=story","story":"Don Kirchoff shared U.S. Representative Will Hurd's video to the group: Constitutional Patriots.","updated_time":"2016-03-24T21:02:04+0000","id":"394462630661212_944140159026787"},{"message":"PLEASE SHARE THIS IF YOU AGREE!!! YOU ALL HAVE MY PERMISSION TO COPY AND SHARE THIS!!!!! ITS OK TO LIKE THIS STATEMENT, BUT ITS NEEDS TO BE COPIED AND SHARED TO MAKE A DIFFERENCE SO PASS THIS ON. IF HILLARY WINS THE ELECTION, THEN YOU ALL KNOW IT WAS FIXED! NOW IS THE TIME FOR ALL OF US LAW ABIDING AMERICAN'S TO STAND TOGETHER AND SAY \"ENOUGH IS ENOUGH!\". HILLARY THINKS WE ARE ALL JUST FOLLOWERS AND ALL TALK, SO LETS SHOW HER WE HAVE A VOICE!!!!!!!!!\nWE WILL NO LONGER BE BLIND SHEEP LEAD TO SLAUGHTER BY A JUDAS GOAT LIKE THE KLINTON'S. NOW! I HEARD WOMEN SAY THEY WERE VOTING FOR BILL KLINTON NOT FOR HIS POLICIES BUT BECAUSE HE WAS SO GOOD LOOKING. PEOPLE SEEM TO BE COMPLACENT IN THEIR FREEDOMS NOW! FREEDOM IS AND WILL NEVER BE FREE TO ANYONE WHO WANTS TO KEEP THEM.\nFREEDOM MUST BE MAINTAINED EACH AND EVERY DAY BY ALL AMERICAN'S LIKE YOU AND ME, FROM THE GUY WHO CLEANS OUR TOILETS TO THE CEO'S OF VERY BIG COMPANIES!\nI SEE HILLARY AND BILL KLINTON SO ARROGANT THAT BOTH THINK WE ARE JUST FOOLS AND WILL BELIEVE ANYTHING AND EVERYTHING THEY WILL SAY TO BENEFIT THEIR OWN AGENDAS.\nYOU SEE, SOME WHERE ALONG THE WAY WE STOPPED THINKING FOR OUR SELVES AND ALLOWED THEM TO THINK FOR US, THEREFORE CAUSING US TO BE SHEEP. IT IS TIME TO STOP VOTING FOR HILLARY AND CRUZ AND ANY OTHER CROOKED POLITICIANS WHO COME ALONG TRYING TO SELL US (THE AMERICAN PEOPLE) SNAKE OIL PROMISING THIS WILL MAKE THINGS BETTER FOR US.\nHILLARY TALKED ABOUT KEEPING AMERICA SAFE, BUT IN REALITY, SHE ALLOWED THE MEN FROM BENGHAZI TO DIE A HORRIBLE DEATH. DO YOU WANT THAT FOR A COMMANDER IN CHIEF? I DO NOT. THIS COULD BE YOUR CHILDREN WHO GO TO A MALL HERE IN AMERICA TO HAND OUT WITH FRIENDS AND HAVE A SUICIDE BOMBER KILL AS MANY AS THEY CAN IN THAT MALL.\nHILLARY STAND WITH OBAMA IN BRINGING SYRIA REFUGEES HERE TO THE UNITED STATES AND ALLOWING TERRORISTS TO LIVE AMONG US TO TERRORIZE US.\nQUESTION:IS THAT KEEPING US SAFE FROM HARM? DO YOU WANT YOUR KIDS CHILDREN AND GRAND CHILDREN SAFE?\nSO AS MY FELLOW AMERICAN'S, PLEASE DO NOT VOTE FOR HILLARY. LETS MAKE AMERICA GREAT AND SAFE AGAIN FROM THOSE WHO WOULD LOOK TO PROFIT AND TAKE ADVANTAGE OF WE AMERICAN'S.","updated_time":"2016-03-24T19:40:49+0000","id":"394462630661212_944103029030500"},{"updated_time":"2016-03-24T19:39:36+0000","id":"394462630661212_944102739030529"},{"message":"I was just told \"It's okay, everything will be fine, just wait. After Obama is out of office, our Vets will be taken care of.\"\nCurrent statistics say 34 Veterans a day commit suicide. But, not all states release their suicide rates to the VA, so those numbers could be double.\nObama leaves office in 302 days. Using current 'estimates', that means over 10,268 Veterans will commit suicide before then. In 2012, the statistics from only 21 states were used. If that is true now as well, it could easily be over 20,000 deaths.\nSorry..... but our Vets can't wait that long! ~TL~\nEvent - https:\/\/www.facebook.com\/events\/1606622089576835\/\nGroup - https:\/\/www.facebook.com\/groups\/828975500569323\/","story":"Tina Lane shared Tina Lane's event to the group: Constitutional Patriots.","updated_time":"2016-03-24T18:56:45+0000","id":"394462630661212_943837059057097"},{"story":"Pam Barker shared The Liberty Beacon's post to the group: Constitutional Patriots.","updated_time":"2016-03-24T14:41:10+0000","id":"394462630661212_943835999057203"},{"updated_time":"2016-03-24T13:01:57+0000","id":"394462630661212_943740839066719"},{"updated_time":"2016-03-24T04:50:27+0000","id":"394462630661212_943429902431146"},{"story":"David McGarvey shared his photo to the group: Constitutional Patriots.","updated_time":"2016-03-24T03:53:16+0000","id":"394462630661212_943294682444668"},{"message":"It is time to expose Obama for his dangerous Iran deal, before it’s too late! Share it everywhere ","updated_time":"2016-03-24T01:29:40+0000","id":"394462630661212_943246322449504"},{"message":"NO they don't.","updated_time":"2016-03-24T00:00:22+0000","id":"394462630661212_943158255791644"},{"updated_time":"2016-03-23T22:20:29+0000","id":"394462630661212_943149655792504"},{"message":"http:\/\/www.rightwingwatch.org\/content\/we-read-rafael-cruzs-book-so-you-dont-have","updated_time":"2016-03-23T21:50:11+0000","id":"394462630661212_943133122460824"},{"message":"Romans 1:21-22\n21 Because that, when they knew God, they glorified him not as God, neither were thankful; but became vain in their imaginations, and their foolish heart was darkened. 22 Professing themselves to be wise, they became fools,","updated_time":"2016-03-23T20:19:03+0000","id":"394462630661212_943080289132774"},{"updated_time":"2016-03-23T17:45:10+0000","id":"394462630661212_942966469144156"},{"story":"Kevin Gibson shared Michigan Conservative Think Tank's photo to the group: Constitutional Patriots.","updated_time":"2016-03-23T17:32:22+0000","id":"394462630661212_942956652478471"},{"message":"America’s Gestapo: The FBI’s Reign of Terror\n\nPreface by Pam Barker | TLB Staff Writer\n\nJohn Whitehead’s choice of title for this article is neither accident nor exaggeration:  Hoover sent one of his men to investigate the operations of the Nazi secret police in 1938, this 5 years into Hitler’s regime, and subsequently employed at least a thousand former Nazis in the FBI as undercover spies and informants in the decades after WWII.  \n\nThe Nazis, it seemed, created the benchmark for subsequent operations.\n\nYes, the FBI has long been monitoring citizens for participating in lawful first amendment activities such as belonging to activist, dissent groups.  Its impressive hacking capabilities basically permit it access to any computer anywhere in the world despite the complaints we hear about companies like Apple.  It routinely entraps vulnerable people into fake terror plots, providing them with the means and logistics to do so, then arresting them for it.  It spies on us using the most sophisticated technology including Stingrays while demanding customer information from banks, phone and other companies under a provision of The Patriot Act.  Meanwhile, it tolerates a whole host of illegal activities from its range of criminal informants.\n\nWhitehead reminds us of the recent FBI advisory to teachers, inviting them and other students to snitch on fellow schoolmates looking for signs of domestic terrorism, as reported by The Liberty Beacon earlier.  The types of things taken as indicators of domestic terrorism could include the interests of many of us reading this online news site, including the NWO, constitutional liberties, 2nd amendment oriented views, fears of an economic collapse and survivalism.  Are we under especial surveillance?\n\nA monolithic agency, the FBI boasted a huge (minimum) budget of $8.3 billion in 2015 alone, a vast array of cutting edge technology, liaisons with many other government agencies, 35,000 employees working in 456 agencies around the US, and the largest biometric database in the world.  Much information is contained on people who haven’t even yet committed any crime but may have come to the attention of the agency for apparently innocuous things.\n\nObserves Whitehead, ‘[o]wing largely to the influence and power of the FBI, the United States—once a nation that abided by the rule of law and held the government accountable for its actions—has steadily devolved into a police state where justice is one-sided, a corporate elite runs the show, representative government is a mockery, police are extensions of the military, surveillance is rampant, privacy is extinct, and the law is little more than a tool for the government to browbeat the people into compliance.’\n\nEnjoy Whitehead’s incisive article. \n\nhttp:\/\/www.rutherford.org\/publications_resources\/john_whiteheads_commentary\/americas_gestapo_the_fbis_reign_of_terror","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-23T17:15:54+0000","id":"394462630661212_942938499146953"},{"message":"Gun rights, religious liberties, private property rights, and personal freedoms will all be in grave jeopardy if the Senate schedules hearings and votes to confirm Obama’s nomination of Merrick Garland to the Supreme Court.\n\nAccording to the New York Times, Mr. Garland would “make the justice at the center of the court more liberal than at any point in nearly 50 years”.\n\nPlease join me in contacting our Senators and demand #NoHearingsNoVotes on Garland.\n\n","updated_time":"2016-03-23T14:09:09+0000","id":"394462630661212_942769692497167"},{"message":"Whether you would or would not vote for either Trump or Cruz, this is a post you must read and ponder (think hard and deeply) about.","updated_time":"2016-03-23T07:10:13+0000","id":"394462630661212_942492069191596"},{"message":"Yesterday Donald Trump met with the President of The Heritage Foundation, the most influential conservative Think Tank in Washington.\n\nIn a separate news conference yesterday Mr. Trump disclosed that he has asked The Heritage Foundation for a list of possible candidates for his review for SCOTUS justice, should he be elected President.\n\nBoth are clear indications that Mr. Trump is committed to conservative values and principles.\n\n","updated_time":"2016-03-23T03:17:05+0000","id":"394462630661212_942053769235426"},{"updated_time":"2016-03-23T02:11:14+0000","id":"394462630661212_942304359210367"},{"updated_time":"2016-03-22T23:41:22+0000","id":"394462630661212_942202089220594"},{"message":"Sad😭😭😨😱😪😱😨😱😪","updated_time":"2016-03-22T21:06:13+0000","id":"394462630661212_942096442564492"},{"message":"The Republican establishment’s path to the Presidency has been closed and two lanes have opened in the primaries:\n1) Traditional Constitutional Lane for those eager to make life better for all Americans based on free enterprise, not crony capitalism, and based on healthy families, friendships, church groups, and other civic involvements that advance a free society\n2) Populist Lane for those fed up with a corrupt political system that caters to the well-connected at the expense of ordinary Americans. These folks seek political leaders who will fight for them and their important and valid grievances.\n\nA successful Republican Presidency will unite those in these two lanes by channeling populism toward conservative ends with a commitment of opportunity for all and favoritism to none.\n\n","updated_time":"2016-03-22T19:44:44+0000","id":"394462630661212_940377626069707"},{"message":"One Minute Sermon! \nThis lady says more in one minute than some preachers say in an hour. I love this!!!!!!!!!!!\nhttps:\/\/www.facebook.com\/201756150179\/videos\/146291758731031\/","story":"Carol Armentrout-Morrison shared Diasporamessenger.com's video to the group: Constitutional Patriots.","updated_time":"2016-03-22T18:03:45+0000","id":"394462630661212_941967589244044"},{"updated_time":"2016-03-22T05:15:58+0000","id":"394462630661212_940537372720399"},{"message":"This must be stopped!!!\n","updated_time":"2016-03-22T01:08:52+0000","id":"394462630661212_940216562752480"},{"message":"Thanks and congratulations to everyone who wrote their US Representatives to oppose Republican leadership’s plan to approve a 2017 federal budget that would have increased spending levels by an additional $30 billion.\n\nSpeaker Ryan is unable to bring the 2017 Budget Bill to a floor vote, clear evidence that a drumbeat of steady opposition from the grass roots has stalled this bill that would have approved the Obama-Boehner budget deal opposed by conservatives.\n\nThis is a huge WIN for the conservative movement and for hard working tax payers burdened by tax and spend elitist politicians in Washington.","updated_time":"2016-03-22T00:57:28+0000","id":"394462630661212_940258672748269"},{"message":"Obama: ‘Hopefully, We Can Learn From’ Cuba About Improving Human Rights In America [VIDEO]\nSpeaking to reporters in Havana Monday, President Barack Obama said that, “hopefully,” the United States can learn a thing or two from Cuba’s record on improving basic, human rights.\n“Our starting point is that we have two different systems,” Obama explained. “What I have said to President Castro, is that we are moving forward and not looking backwards.”\n“President Castro, I think, has pointed out that it, in his view making sure that everybody is getting a decent education or health care, has basic security in old age, that those things are human rights as well.”\n\n“The goal of the human rights dialogue is not for the United States to dictate to Cuba how to govern themselves,” the president continued. “Hopefully, we can learn from each other.”\n\nRead more: ","updated_time":"2016-03-22T00:20:03+0000","id":"394462630661212_940215929419210"},{"updated_time":"2016-03-22T00:01:26+0000","id":"394462630661212_940208366086633"},{"story":"Larry Hilt shared The Other 98\u0025's photo to the group: Constitutional Patriots.","updated_time":"2016-03-21T23:45:41+0000","id":"394462630661212_940196569421146"},{"updated_time":"2016-03-21T22:19:43+0000","id":"394462630661212_940149016092568"},{"message":"Spells it out for you . . . Now TAKE ACTION against it!!!!  NOW is the time!!!","updated_time":"2016-03-21T22:15:41+0000","id":"394462630661212_939903672783769"},{"message":"Here is more confirmation that the tax and spend philosophy of Democrats cares little about the hard-working middle class, the poor, declining income and household values for minorities, etc.\n\nBut their support remains strong for the rich and politically connected at the expense of US taxpayers. The Democrats love wealth distribution as long as it benefits their cronies and the politically connnected.\n\n","updated_time":"2016-03-21T22:06:09+0000","id":"394462630661212_939765696130900"},{"message":"Bear Grylls: OBAMA GONE WILD...\n","updated_time":"2016-03-21T21:07:20+0000","id":"394462630661212_940116032762533"},{"message":"Kay Farrell\nAugust 25, 2013 · \nMedical Excise Tax on Retail Receipt. This is an image of a sales receipt from Cabela's, a popular sporting goods store.The 2.3\u0025 Medical Excise Tax that began on January 1st is supposed to be \"hidden\" from the consumer,but it's been brought to the public's attention by hunting and fishing store Cabela's who have refused to hide it and are showing it as a separate line item tax on their receipts, the email states. I did some research and found directly from the IRS's website information that PROVES this to be true and an accurate portrayal of something hidden in \"Obamacare\" that I was not aware of! Now being skeptical of this I went to the IRS website and found this! Q1.\nWhat is the medical device excise tax? A1. Section 4191 of the Internal Revenue Code\nimposes an excise tax on the sale of certain medical devices by the manufacturer or importer of the device.\nQ2. When does the tax go into effect? A2. The tax applies to sales of taxable medical devices after Dec. 31, 2012.\nQ3. How much is the tax? A3. The tax is 2.3 percent of the sale price of the taxable medical device. See Chapter 5 of IRS Publication 510, Excise Taxes, and Notice 2012-77 for additional information on the determination of sale price.\nIRS.gov \nSo being more curious I clicked on \"Chapter 5 of IRS Publication 510.\" And what do I find under \"MEDICAL DEVICES\" under \"MANUFACTURERS TAXES\"? The following discussion of manufacturers taxes applies to the tax on: Guns and amo; Sport fishing equipment; Fishing rods and fishing poles; Electric outboard motors; Fishing tackle boxes; Bows, quivers, broadheads, and points; Arrow shafts; Coal; Taxable tires; Gas guzzler automobiles; and Vaccines. IRS.gov I think we have definitely been fooled, if we believe that the Affordable Care Act is all about health care. It truly does appear to be nothing more than a bill laden with a whole lot of taxes that we the people have yet to be aware of.\nPlease pass this on . I am still incredulous that this can go on .Where is our press ? I guess it’s just like Nancy Pelosi said…….We have to pass it to see what is in it . What is next? What else is there we do not know about? I am sick to death about our government\nChapter Five http:\/\/www.irs.gov\/publications\/p510\/ch05.html\nKay Farrell's photo.\nShare","updated_time":"2016-03-21T19:12:46+0000","id":"394462630661212_940046246102845"},{"updated_time":"2016-03-21T18:18:58+0000","id":"394462630661212_940012302772906"},{"message":"LAND OF THE FREE BECAUSE OF THE BRAVE!!!\n....................Yet millions of them suffer....................\nJoin us in Washington DC on June 25, supporting our Veterans, and raising awareness of the critical issues they face.\nThey fought for us ~ Now we fight for them!!\nEvent - https:\/\/www.facebook.com\/events\/1606622089576835\/\nGroup - https:\/\/www.facebook.com\/groups\/828975500569323\/","story":"Tina Lane shared Defenders of Liberty MC's photo to the group: Constitutional Patriots.","updated_time":"2016-03-21T18:00:43+0000","id":"394462630661212_940000009440802"},{"message":"http:\/\/uscode.house.gov\/view.xhtml?req=(title:18\u002520section:611\u002520edition:prelim)\u002520OR\u002520(granuleid:USC-prelim-title18-section611)&f=treesort&edition=prelim&num=0&jumpTo=true","updated_time":"2016-03-21T17:39:36+0000","id":"394462630661212_939453349495468"},{"updated_time":"2016-03-21T15:25:08+0000","id":"394462630661212_939873142786822"},{"message":"I think it is time to get serious about this religion of hate or Sharia will be the way for all of us.﻿","updated_time":"2016-03-21T07:59:01+0000","id":"394462630661212_939436566163813"},{"story":"June Pitts shared Tennessee for Trump's photo to the group: Constitutional Patriots.","updated_time":"2016-03-21T05:27:33+0000","id":"394462630661212_939541579486645"},{"updated_time":"2016-03-21T04:22:31+0000","id":"394462630661212_939514852822651"},{"message":"AIDING A ILEGAL TO VOTE IS A  FEDERAL FELONY.ILLEGAL ENTRY INTO THIS COUNTRY IS A FEDERAL FELONY. EVERY ILLEGAL IN THIS COUNTRY IS A FEDERAL FELON!       THIS ALSO MEANS TED CRUZ FOLKS!","updated_time":"2016-03-21T02:15:01+0000","id":"394462630661212_939438626163607"},{"message":"--->California Allows Illegal Aliens to Vote: So Each POTUS Ballot Should Be Disqualified ","updated_time":"2016-03-21T01:34:54+0000","id":"394462630661212_939418962832240"},{"updated_time":"2016-03-21T01:07:04+0000","id":"394462630661212_939405412833595"},{"message":"No matter who or what you are, or who you are for, pay attention to what this smart and very wise Judge has to say. She is spot on!!! ...as usual....","updated_time":"2016-03-20T22:50:49+0000","id":"394462630661212_939334729507330"},{"message":"Trying (and Trying) to Get Records From the ‘Most Transparent Administration’ Ever\n\nPreface by Pam Barker | TLB Staff Writer\n\n‘Documents are the lifeblood of investigative journalism, but these problems aren’t of interest only to reporters. The Freedom of Information Act is supposed to deliver on the idea of a government “for and by the people,” whose documents are our documents. The ability to get information from the government is essential to holding the people in power accountable.’\n\nIndeed. When Obama came to power, as Justin Elliott of ProPublica reminds us, he promised the ‘most transparent administration in history’. But the very opposite has proved to be the case.\n\nElliott uses this piece to detail his own experience making a FOI request in February of 2014 to FEMA into the mishandling of the response to Hurricane Sandy. Although the Freedom of Information Act requires that a response be given within 20 business days, one never transpired and Elliott had to pursue his request again.\n\nThe response he got, in addition to replies received in many other cases he details in this article, suggests neglect and incompetence, or as veteran FOIA lawyer Simon Hodes remarks, ‘it’s not treated as an important thing within the administration’.\n\nIn fact, in one case where a NBC4 Washington reporter requested files into the 2013 Navy Yard shooting, an e-mail sent in error revealed how Navy officials were actively working to block the request.\n‘The backlog of requests at FEMA has ballooned to 1,500. That’s more than double what it was less than two years ago.’\n\nEnjoy Elliott’s article by clicking here: https:\/\/www.propublica.org\/…\/trying-to-get-records-from-mos…","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-20T22:16:36+0000","id":"394462630661212_939317479509055"},{"message":"How Anonymous Just Fooled Donald Trump, the Secret Service, and the FBI...WAKE UP AMERICA...THIS MUST GO VIRAL...\n","updated_time":"2016-03-20T20:13:14+0000","id":"394462630661212_939268242847312"},{"message":"Disenchantment and mistrust of the political class has created a movement that extends beyond both political parties.\n\nThe dull, tired, re-tread nature and failed policies of the Democrat candidates for POTUS have left many Independents and Democrats disenchanted and looking elsewhere for leadership.\n\nThe betrayal of the electorate by GOP career politicians on key issues that swept them into power has resulted in the rejection of all GOP establishment candidates for President. \n\nA consensus is developing that neither group will allow career politicians to double down on the failed policies of their last seven years.\n\n","updated_time":"2016-03-20T18:57:46+0000","id":"394462630661212_938796062894530"},{"message":"A must listen to if you are concerned about our country. Constitution Party Presidential Debate 2016.\n","updated_time":"2016-03-20T18:54:37+0000","id":"394462630661212_939226959518107"},{"message":"OMG OMG OMG","updated_time":"2016-03-20T15:12:38+0000","id":"394462630661212_939085829532220"},{"updated_time":"2016-03-20T10:40:15+0000","id":"394462630661212_938951022879034"},{"message":"Here are issue areas that could make life better for Americans.\n\nEstablishment GOP leaders continue to fail to deliver on them as all GOP establishment candidates for POTUS are rejected by voters in primaries in spite of many tens of millions of dollars spent on their campaigns.\n\nAt the same time millions of Independents and disenchanted Democrats have abandoned the failed policies of the Democrat candidates to support fresh, conservative Republican POTUS candidates committed to delivering on these same issue areas: \n\n","updated_time":"2016-03-20T04:06:50+0000","id":"394462630661212_938779746229495"},{"updated_time":"2016-03-20T03:33:18+0000","id":"394462630661212_938757502898386"},{"updated_time":"2016-03-20T03:22:22+0000","id":"394462630661212_938750616232408"},{"message":"Could you imagine if this happened to the children of President Barack Obama?","updated_time":"2016-03-20T01:36:19+0000","id":"394462630661212_938689419571861"},{"updated_time":"2016-03-20T01:31:11+0000","id":"394462630661212_938681552905981"},{"message":"Just Who The Heck Really Runs Congress?\n\nPreface by Pam Barker | TLB Staff Writer\n\nThis isn’t just about running Congress behind the scenes, but essentially about a foreign power exerting influence over it and getting us, the taxpayer, to shell out large sums of money in the process. ‘Large sums’ as in an estimated $6 billion a year, or virtually $16.7 million per day.\n\nWhich power? AIPAC, the American Israel lobby, aka the American Zionist Committee.\n\nAnthony Bellchambers reminds us of some salient points: while Congress holds ultimate US political authority, AIPAC exerts an undue influence over them by making sure only those who support the Likud Political Zionist agenda get elected or re-elected. Which puts a wing of the Israeli government ultimately in charge, whose supporters finance the group.\n\nJust why isn’t AIPAC and the entire Israel lobby designated a ‘Foreign Agent’ representing a foreign state as the law makes provision for, especially since ‘AIPAC was not established and is not in existence to support, or for the benefit of, the government or people of the United States’?\n\nEnjoy Anthony Bellchambers’ incisive, to-the-point article here:\nhttp:\/\/www.globalresearch.ca\/does-congress-represen…\/5514297","story":"Pam Barker shared The Liberty Beacon's photo to the group: Constitutional Patriots.","updated_time":"2016-03-19T22:13:33+0000","id":"394462630661212_938534576254012"},{"message":"I totally agree with Rand Paul \nRand Paul On The Federal Government: ‘Shut The Damn Thing Down’\n“Everything in Washington is broken, nothing works here,” Rand Paul  said. “We can’t run the post office, we are not to be trusted with money. Congress is not good with money, we shouldn’t be trusted with almost any responsibility up here. Most of government should be shut down and devolved and sent back to the states.”\n","updated_time":"2016-03-19T21:03:45+0000","id":"394462630661212_938506406256829"},{"message":"18\u0025 pay raise ??","updated_time":"2016-03-19T19:14:05+0000","id":"394462630661212_938393932934743"},{"message":"Anonymous, the hacktivist group, has surfaced again and is now taking aim at Republican presidential hopeful Ted Cruz.\nTHIS MUST GO VIRAL\n\n","updated_time":"2016-03-19T19:13:39+0000","id":"394462630661212_938447799596023"},{"message":"Is he crazy?  MAYBE. Is he asking for money? NO! I have talked to him myself and he seems to have a good plan. If you are a page Admin you will want to know what he plans to do so you can take part in it. It is not a  D.C. Protest  If anything go to the page and PM him your email address so he can send you more details over the next few weeks.\n\nhttps:\/\/www.facebook.com\/168312490206503\/videos\/199088567128895\/","story":"Chuck Sidrum shared Accountability WE Demand it's video to the group: Constitutional Patriots.","updated_time":"2016-03-19T11:28:25+0000","id":"394462630661212_938181006289369"},{"message":"This is what happened the last time we elected a doer\/business man.\nPrepare for Trump's Great Depression II.","updated_time":"2016-03-19T11:10:30+0000","id":"394462630661212_938171896290280"},{"updated_time":"2016-03-19T04:27:57+0000","id":"394462630661212_937986229642180"},{"message":"Sessions Recommends Generational Strategy For Middle East \n","updated_time":"2016-03-19T02:35:49+0000","id":"394462630661212_937932726314197"},{"updated_time":"2016-03-19T02:25:03+0000","id":"394462630661212_937928859647917"},{"updated_time":"2016-03-19T00:11:02+0000","id":"394462630661212_937856252988511"},{"story":"Larry Hilt shared Laurie William's video to the group: Constitutional Patriots.","updated_time":"2016-03-18T22:10:11+0000","id":"394462630661212_937795259661277"},{"message":"this man was spent 14 years in prison for a crime when the maximum was for 2 years, cruz fought to make sure he was not release. how dose he stand with the people and for the justice of the people when he clearly was against what was right and for this poor man. https:\/\/www.oyez.org\/cases\/2003\/02-1824","updated_time":"2016-03-18T22:00:15+0000","id":"394462630661212_936823049758498"},{"story":"Larry Hilt shared his post to the group: Constitutional Patriots.","updated_time":"2016-03-18T21:36:37+0000","id":"394462630661212_937778846329585"},{"message":"NAVY SEAL ARE OUR HEROES..THIS MUST GO VIRAL...She is An Ignorant Liar’\n","updated_time":"2016-03-18T20:27:37+0000","id":"394462630661212_937749712999165"},{"updated_time":"2016-03-18T20:12:15+0000","id":"394462630661212_937741166333353"},{"story":"Olivia Beaulieu shared Freedom's Final Stand's post to the group: Constitutional Patriots.","updated_time":"2016-03-18T20:02:53+0000","id":"394462630661212_937736299667173"},{"message":"Share before lost she (Hillary) is trying to hide this, 400 anti aircraft missiles stole from Benghazi on top of four dead men!","updated_time":"2016-03-18T19:19:52+0000","id":"394462630661212_937716653002471"},{"message":"Send this man to ISIS I can not believe that he said this.  No wonder America is crumbing down. \nTENNESSEE LAWMAKER SAYS THAT ISIS SHOULD BE ABLE TO RECRUIT ON COLLEGE CAMPUSES.\nIn what surely will be the most insane story you’ve heard all day, one lawmaker’s call to open campus dialogue to more points of view turned into a thumbs-up for the terror group ISIS to recruit at the University of Tennessee!\nThe bill was put forth by Representative Martin Daniel (R-18th District); House Bill 2063, called “The Tennessee Student Free Speech Protection Act.” In theory, the bill is a good one, requiring college campuses to adopt policies that allow students to exercise their First Amendment rights.\nIn the era of “safe spaces” and speakers getting run off campus for disagreeing with the liberal majority, this bill seemed like it may just be passed.\nRep. Daniel spoke on his bill during a House Education Administration & Planning Subcommittee meeting in which he cited a rule at Middle Tennessee State University that requires a permit be given 5 days in advance of any literature being handed out on campus. He also said the school encourages bias reporting, stating:\n","updated_time":"2016-03-18T18:38:19+0000","id":"394462630661212_937067356400734"},{"message":"Forget privacy, the 4th, 5th, 6th, 7th and 8th Amendments – they will all fall.","updated_time":"2016-03-18T18:37:52+0000","id":"394462630661212_937693539671449"},{"updated_time":"2016-03-18T17:53:37+0000","id":"394462630661212_937670426340427"},{"story":"Larry Hilt shared Nation In Distress's video to the group: Constitutional Patriots.","updated_time":"2016-03-18T17:41:11+0000","id":"394462630661212_936950486412421"},{"message":"Obama travel is a waste of our taxpayers money and he has wasted trillions of it.\n","updated_time":"2016-03-18T17:04:14+0000","id":"394462630661212_937646809676122"},{"updated_time":"2016-03-18T16:24:17+0000","id":"394462630661212_937621163012020"},{"updated_time":"2016-03-18T14:53:46+0000","id":"394462630661212_937566546350815"},{"message":"https:\/\/www.facebook.com\/washingtonstarnews\/posts\/1560311227630601\/ |","updated_time":"2016-03-18T04:17:27+0000","id":"394462630661212_937204296387040"},{"updated_time":"2016-03-18T04:10:03+0000","id":"394462630661212_937194383054698"},{"updated_time":"2016-03-18T03:30:09+0000","id":"394462630661212_937160333058103"},{"message":"I have several degrees, including a masters, but I would have supported Trump long before I earned my first degree. Actually while I was doing just that, I supported Pat Buchanan, another populist who just happens to say Trump is the future of the GOP. https:\/\/www.washingtonpost.com\/news\/the-fix\/wp\/2016\/01\/12\/pat-buchanan-believes-donald-trump-is-the-future-of-the-republican-party\/","updated_time":"2016-03-18T03:00:50+0000","id":"394462630661212_937165596390910"},{"updated_time":"2016-03-18T02:13:44+0000","id":"394462630661212_937145096392960"},{"message":"Global Government Debt Is Actually Triple What We Thought, Thanks to Pensions\nhttp:\/\/blogs.wsj.com\/moneybeat\/2016\/03\/17\/global-government-debt-is-actually-triple-what-we-thought-thanks-to-pensions\/\n\nOur Solution Is Big Enough to Solve the Problem\nhttp:\/\/wiki.conventionofstates.com\/doku.php?id=documents:cosproject:cos_handbook#our_solution_is_big_enough_to_solve_the_problem\n\nSign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-03-18T01:46:23+0000","id":"394462630661212_937117456395724"},{"updated_time":"2016-03-18T01:44:23+0000","id":"394462630661212_937114643062672"},{"updated_time":"2016-03-18T01:41:43+0000","id":"394462630661212_937110639729739"},{"updated_time":"2016-03-18T01:32:10+0000","id":"394462630661212_937105729730230"},{"message":"Great explanation for why Democrats, Independents, and folks who have never voted before are flocking in droves to vote for Donald Trump, much to the consternation of establishment Republicans, political pundits, analysts, and elected officials.\n\n","updated_time":"2016-03-18T01:15:55+0000","id":"394462630661212_937098186397651"},{"message":"Underperformance of the government-managed US economy under Democrat leadership is a serious concern that is driving depressed family incomes, rising minority employment rates, loss of jobs to foreign countries, etc.\n\nWe can learn from Ireland, a country that turned around a similar situation with an economy that grew 8\u0025 in 2015. Their policy choices that turned around a deteriorating economy included:  1) downsizing a bloated public sector, 2) reducing the budget deficit, 3) regaining fiscal health, and 4) firmly adhering to polices to promote economic freedom and entrepreneurial competitiveness.\n\nhttp:\/\/dailysignal.com\/2016\/03\/16\/why-irelands-economy-grew-by-almost-8-in-2015\/?utm_source=heritagefoundation&utm_medium=email&utm_campaign=morningbell&mkt_tok=3RkMMJWWfF9wsRonu6jBce\u00252FhmjTEU5z16uUoUK6xhIkz2EFye\u00252BLIHETpodcMTcdlPb\u00252FYDBceEJhqyQJxPr3NLtQN191pRhLiDA\u00253D\u00253D","updated_time":"2016-03-18T00:38:56+0000","id":"394462630661212_937080816399388"},{"updated_time":"2016-03-18T00:11:50+0000","id":"394462630661212_937066399734163"},{"updated_time":"2016-03-17T23:56:15+0000","id":"394462630661212_937057906401679"},{"updated_time":"2016-03-17T21:58:42+0000","id":"394462630661212_937001249740678"},{"story":"Larry Hilt shared his post to the group: Constitutional Patriots.","updated_time":"2016-03-17T20:37:25+0000","id":"394462630661212_936955699745233"},{"story":"Olivia Beaulieu shared Freedom's Final Stand's post to the group: Constitutional Patriots.","updated_time":"2016-03-17T19:49:02+0000","id":"394462630661212_936932666414203"},{"story":"Larry Hilt shared Silence is Consent's video to the group: Constitutional Patriots.","updated_time":"2016-03-17T19:47:47+0000","id":"394462630661212_936932336414236"},{"message":"Trump is using emotion to get the republican nomination.  No real plans but using your emotions, to get your vote.  Is to bad that Christians are falling for this agenda here. \nChristians Beware!! There is a hidden agenda at work against conservative Christians through the publicity stunt, that is, potential presidential candidate Trump, as explained in the video.\n","updated_time":"2016-03-17T19:24:31+0000","id":"394462630661212_936773566430113"},{"message":"Yep he advocates violence such a cussing, bully.  Would never vote for this kind of a man. \nTrump: Expect 'riots' if I don't win GOP nomination.\nRepublican presidential candidate Donald Trump warned Wednesday that his supporters might riot if the GOP tried to steal the nomination away from him at the Republican National Convention in July.\nTrump, who won at least three states on Tuesday, told CNN that if he falls just short of the delegates he needs to clinch the nomination, he should be seen as the winner anyway, and that any other decision could lead to violence.\n\"I think we'll win before getting to the convention, but I can tell you, if we didn't and if we're 20 votes short or if we're, you know, 100 short and we're at 1,100 and somebody else is at 500 or 400, because we're way ahead of everybody, I don't think you can say that we don't get it automatically. I think you would have riots,\" Trump said. \"I think you would have riots.\"\nTrump pointed out that he has brought out \"millions\" of voters to the polls, many of whom haven't voted in the past, including Democrats and independents. He added that most of his supporters have \"never believed in the system,\" and warned again that \"bad things would happen\" if he lost the nod at the convention.\n","updated_time":"2016-03-17T18:42:40+0000","id":"394462630661212_935979506509519"},{"message":"Mr. cruz knew that texas had not done there obligation. texas refused to do it and cruz argued that the federal government cant make them or do anything about the fact that they did not do what they where obligated to do. i dont hate cruz but he is not a for the people person he pretends to be. if he was why did he pull every trick to stand against them. it was his job to fight for the state, it was his oath to fight for the people. he went for state over people. that is fact. this is a matter of healthcare. he didn't care about the health of the people. its not like this was just some stupid thing. so when he talks about fighting for the people, remember he did not do that as he was oathed to do. ","updated_time":"2016-03-17T16:22:57+0000","id":"394462630661212_936822136425256"},{"updated_time":"2016-03-17T15:39:37+0000","id":"394462630661212_936796523094484"},{"updated_time":"2016-03-17T15:32:44+0000","id":"394462630661212_936791753094961"},{"message":"See how you State's Legislators stack up!\n\n","updated_time":"2016-03-17T14:40:09+0000","id":"394462630661212_936759053098231"},{"message":"It is estimated that this condition affects one percent of the population, with rates greater for men. First formulated in 1968, NPD was historically called megalomania, and is a form of severe egocentrism.","updated_time":"2016-03-17T13:11:18+0000","id":"394462630661212_936629896444480"},{"message":"https:\/\/www.facebook.com\/josh.bernstein.104\/videos\/533200736849617\/","updated_time":"2016-03-17T11:45:31+0000","id":"394462630661212_936657483108388"},{"message":"Here is my opinion about this debate. Let's say Cruz's supporters are correct and Trump does not want to debate him one on one. What does that prove?\n\nDebating is a skill. You can be better at debating and defeat someone, even though their position(s) is\/are better than yours. \n\nTrue.\n\nI know this is true, because in the type of academic debating I participated in, you had to be prepared to debate BOTH sides of a given topic. Then we flipped a coin at the meet to see what side we would argue.\n\nSometimes we *beat* other teams arguing the position I was personally against. Sometimes we beat teams arguing the position I was for.\n\nCruz  is a *Harvard* trained lawyer. Lawyers are experts at manipulating language to achieve a result.\n\nFor example, if the debate was over who is more pro-gun, I don't doubt that Cruz would leave many with the idea that he is to the right of Trump. \n\nThe *truth* is Trump's idea of 50 state concealed carry is to the right of what WE KNOW Cruz believes.\n\nThe text in this meme are Cruz's own words and you can verify on numbered page 36 of his amicus brief that was submitted to the SCOTUS for Heller v DC.\n\nwww.tedcruz.org\/wp-content\/uploads\/pdf\/Heller_Amicus_Brief.pdf\n\nThen check out the Appendix, page 8A for example, lists the Connecticut \"assault weapons\" ban as among these \"reasonable regulations\".\n\nThere has already been 12 debates, and this one would not be just Cruz v Trump anyway. Kasich is still there. Cruz can go destroy Kasich who should not be in the race anyway. \n\nIf Trump's motive is as they claim, I don't blame him.\n\nKennedy \"beat\" Nixon and many say it is because he looked more poised at the televised debate.\n\nWere Nixon's positions better?\n\nAbsolutely.","updated_time":"2016-03-17T06:41:55+0000","id":"394462630661212_936493146458155"},{"updated_time":"2016-03-17T03:45:13+0000","id":"394462630661212_936416263132510"},{"message":"Why Washington’s Political Class Is Losing Control\n\nFight back! Sign the Convention of States Petition http:\/\/www.cosaction.com\/?recruiter_id=2750","updated_time":"2016-03-16T21:19:27+0000","id":"394462630661212_936221263152010"},{"message":"This is the truth about Donald Trump, been saying it all along, he is there to destroy the republican party and has divided it and he is a liberal progressive with no answers to our problems, but trump is no better than Obama, what are we doing, this is crazy, this right here is proof.","updated_time":"2016-03-16T20:25:29+0000","id":"394462630661212_936166146490855"},{"message":"Here is my opinion about this debate. Let's say Crud’s supporters are correct and Trump does not want to debate him one on one. What does that prove?\n\nDebating is a skill. You can be better at debating and defeat someone, even though their position(s) is\/are better than yours. \n\nTrue.\n\nI know this is true, because in the type of academic debating I participated in, you had to be prepared to debate BOTH sides of a given topic. Sometimes we *beat* other teams arguing the position I was personally against.\n\nCrud is a *Harvard* trained lawyer. Lawyers are experts at manipulating language to achieve a result.\n\nFor example, if the debate was over who is more pro-gun, I don't doubt that Crud would leave many with the idea that he is to the right of Trump. \n\nThe *truth* is Trump's idea of 50 state concealed carry is to the right of what WE KNOW Crud believes.\n\nThe text in this meme are Crud's own words and you can verify on numbered page 36 of his amicus brief that was submitted to the SCOTUS for Heller v DC.\n\nwww.tedcruz.org\/wp-content\/uploads\/pdf\/Heller_Amicus_Brief.pdf\n\nThen check out the Appendix, page 8A for example, lists the Connecticut \"assault weapons\" ban as among these \"reasonable regulations\".\n\nThere has already been 12 debates, and this one would not be just Cruz v Trump anyway. Kasich is still there. Cruz can go destroy Kasich who should not be in the race anyway. \n\nIf Trump's motive is as they claim, I don't blame him.\n\nKennedy beat Nixon and many say it is because he looked more poised at the televised debate.\n\nWere Nixon's positions better?\n\nAbsolutely.","updated_time":"2016-03-16T20:15:49+0000","id":"394462630661212_936188073155329"},{"message":"here it is we are being taken over they intend to take the nomination away from donald trump and give it to cruz (he was ced in to  mcconeels d c office today)  we mst stop this before it haens  jim heard on the raido this morning they are engaging the national guard  for the convention=this  states they intend to take over our  constitutional rights of choosing our own candidate sread this far & wide!!!!everyone call and keep calling untilt hey back down before the convention!!!!","updated_time":"2016-03-16T19:18:02+0000","id":"394462630661212_936157789825024"},{"updated_time":"2016-03-16T19:17:52+0000","id":"394462630661212_936157743158362"},{"story":"Kurt M. Whitlow shared Liberty & Justice's photo to the group: Constitutional Patriots.","updated_time":"2016-03-16T18:36:05+0000","id":"394462630661212_936130333161103"},{"updated_time":"2016-03-16T17:50:51+0000","id":"394462630661212_936106859830117"},{"message":"I sent this message to my #SenatorJohnCornyn. We need to pressure Senators to follow through on their commitment. You are welcome to use the text:\n\nStand firm on your commitment to oppose Obama’s SCOTUS nominee – #NoHearingsNoVotes on Merrick Garland as you promised.\n\nA replacement for Antonin Scalia should not be considered by the Senate until the American people have spoken and elected a new President.\n\nThere is no constitutional crisis and no urgency to act. Very few SCOTUS decisions are 4\/4 and need the tie-breaking ninth justice. If any do, they can revert to the lower court decision. \n\nObama’s nominee is an attempt to tilt the court to a liberal majority. The Senate must perform its constitutional hearings AFTER the people have spoken. We must elect a President who will nominate a candidate who is a constitutional scholar of the caliber of Scalia.\n\nPlease don’t demonstrate again your preference to appease the establishment and mainstream media rather than represent the conservative values of Texans.","updated_time":"2016-03-16T17:50:47+0000","id":"394462630661212_936106669830136"},{"story":"Lynwood Winford shared Freedom's Final Stand's post to the group: Constitutional Patriots.","updated_time":"2016-03-16T17:29:49+0000","id":"394462630661212_936098399830963"},{"message":"#NoHearingsNoVotes. A replacement for Antonin Scalia should not be considered by the Senate until the American people have spoken and elected a new President.\n\nThere is no constitutional crisis and no urgency to act. Very few SCOTUS decisions are 4\/4 and need the tie-breaking ninth justice. If any do, they can revert back to the lower court decision. \n\nObama’s nominee is an attempt to tilt the court to a liberal majority. The Senate must perform its constitutional hearings AFTER the people have spoken. We must elect a President who will nominate a candidate who is a constitutional scholar of the caliber of Scalia.","updated_time":"2016-03-16T16:48:03+0000","id":"394462630661212_936077923166344"},{"updated_time":"2016-03-16T15:53:36+0000","id":"394462630661212_936051523168984"},{"message":"Newt Gingrich tells : You’ll just tear the party apart","updated_time":"2016-03-16T15:42:55+0000","id":"394462630661212_936045729836230"},{"message":"He gets it. \nPaul: Trump is an insider pretending to be an outsider\n","updated_time":"2016-03-16T14:27:32+0000","id":"394462630661212_936004113173725"},{"story":"June Pitts shared Drudge Report's post to the group: Constitutional Patriots.","updated_time":"2016-03-16T14:12:45+0000","id":"394462630661212_935445216562948"},{"updated_time":"2016-03-16T14:04:19+0000","id":"394462630661212_935993846508085"},{"updated_time":"2016-03-16T10:58:21+0000","id":"394462630661212_935877363186400"},{"updated_time":"2016-03-16T08:57:19+0000","id":"394462630661212_935787079862095"},{"message":"There is a trend I have noticed. They keep describing Trump supporters as \"non-college republicans\". That is a way to marginalize us. I have several degrees including a masters degree, but I would have supported Trump long before I had these degrees. A degree is meaningless if the person who holds it does not have common sense or has evil in their heart. \n\nThose who were rioting and disrupting our democracy in Chicago the other night? Many of the agitators, including William Ayers, have degrees. If you survey people with traditional college education, and ask them if \"wealth redistribution\" is good or bad, how many would say that it is \"right\" for government to take wealth from some and give it to others who did not earn it? So what is a degree really worth?","updated_time":"2016-03-16T07:27:36+0000","id":"394462630661212_935748523199284"},{"updated_time":"2016-03-16T04:20:51+0000","id":"394462630661212_935685616538908"},{"message":"Don't let them steal the election!!\n","updated_time":"2016-03-16T02:43:52+0000","id":"394462630661212_935619819878821"},{"updated_time":"2016-03-16T01:40:42+0000","id":"394462630661212_935589876548482"},{"message":"Matt Walsh nails it.","updated_time":"2016-03-15T23:48:09+0000","id":"394462630661212_935540083220128"},{"message":"IT IS ALL OVER THE NEWS ALL OVER THE INTERNET THAT TRUMP SAID HE WANTS UNIVERSAL HEALTHCARE. HIS BOTS DENY IT BECAUSE THEY DON'T CARE ABOUT TRUTH.\nNOW HE DENIES HE SAID HE WOULD PAY COURT COSTS FOR HIS FANS IF THEY KNOCK OUT A PROTESTER. ANOTHER LIE PROVEN BY VIDEO ALL OVER THE NEWS AND NET.\nHE GETS AWAY WITH IT BECAUSE HE IS A BUSINESS MAN.\nHOW THE HELL DOES THAT MAKE ANY SENSE ?","updated_time":"2016-03-15T23:36:39+0000","id":"394462630661212_935468836560586"},{"story":"Lynwood Winford shared Freedom's Final Stand's post to the group: Constitutional Patriots.","updated_time":"2016-03-15T22:17:20+0000","id":"394462630661212_935495766557893"},{"story":"June Pitts shared Drudge Report's post to the group: Constitutional Patriots.","updated_time":"2016-03-15T20:32:16+0000","id":"394462630661212_935443246563145"},{"updated_time":"2016-03-15T18:48:15+0000","id":"394462630661212_935386359902167"},{"message":"I have held off on this for a while but I AM DISGUSTED. If you think that there is *any* judgement seat for us believers over \"who is or isn't a *real* Christian\" for such trivialities, I have to say you do not understand LOGIC or fundamental Christian teaching. \n\nBy saying that you *know* Trump is “not really” a Christian, you are saying you know his heart. You do not. God does, not you. \n\nTrump says he is a Christian and unless you have a much, much better argument than the few I have countered in this post and meme, I say that you need to get down on your knees and talk to God in prayer. \n\nWho are you to say that John Calvin was not a Christian? Who are you to say that everyone who believes that way is not Christian? \n\nWho are you to say that Trump can't say \"Two Corinthians\"?\n\nWho are you to say that because space was rented to a strip club, years after Trump only owned a 10\u0025 stake in that casino, that he is not \"saved\"?\n\nAnd don't give me this \"he's been divorced two times and his current wife did xyz\". Sorry, millions of Christians have been divorced\/remarried and are accepted in fellowship. Many who were guilty of extra-marital affairs. Including some clergy!\n\nMelania is not a \"whore\" or anything remotely close to that. She was a model in Europe, where regular non-model, women go topless on the beach. She never made a XXX movie and she certainly is not a \"prostitute\" for marrying a wealthy and older businessman. Unless Jackie Kennedy was also one when she married Aristotle Onassis.\n\nThe fact is EVEN IF she had been an actual prostitute, what does the bible say about that?\n\nPerhaps you should look up the story of Hosea and Gomer. \n\nTry also Tamar and Judah.\n\nWhat does the bible say about Rahab?\n\nThose were *real* incidences of *real* prostitution, not someone who posed for a photograph.\n\nI am ashamed of how much hate I have seen thrown on our possible future first lady, because she was a model in Europe and took some racy photos.\n\nGuess what? If Megyn Kelly was from Europe those spreads of her might have shown her baby feeding equipment also!\n\nFirst take the log out of your own eye before trying to take the speck out of the eye of anyone else.\n\n(BTW, Trump has publicly admitted that his past marital indiscretions, are fair game. He was asked this when he brought up Slick Willie after hillary accused him of being a sexist.  That means he ADMITS he did do some wrong. He has publicly confessed that, which is *exactly* what Christians are to do when we sin)\n\nSo why am I disgusted?\n\nBecause the people waging this attack on Trump are engaged in a form of BIGOTRY.\n\nReligious bigotry, particularly doctrinal bigotry.\n\nThe ironic thing is that who gets accused of being a bigot?\n\nTrump! \n\nTrump with his converted Jewish daughter and who says he loves Israel?\n\nWho wants to negotiate a Camp David Accord style peace deal as an honest, neutral broker to bring some peace to the Holy Land?\n\nThey twist his words to make it seem like he meant \"military neutrality\" so you go away thinking if Israel was being attacked a Trump administration would allow that. \n\nHe never said anything like that.\n\nHe says it repeatedly, \"I love Israel, I love the Jewish people\".\n\nSo people launch these extremely hateful bigoted attacks against the man and then some of the same ones turn around and call him a bigot because they took his words out of context on Israel.\n\nThe bible tells us to train up a child in the way to go and when they grow up they will in no wise depart from it.\n\nTrump was raised in the Presbyterian church. They don't believe exactly the same things many other people believe. For example on salvation (becoming \"saved\")\n\n*****\n\"What do Presbyterians mean when they speak of predestination?\"\n\n\"Calvin defines predestination as \"God's eternal decree, by which he compacted with himself what he willed to become of each [person]. \n\nFor ... eternal life is foreordained for some, eternal damnation for others.\n\nSo predestination is an act of God's will through which God elects or chooses those whom God calls to faith and thus to eternal life, and through which God chooses those who will not receive faith.\"\n\nhttps:\/\/www.presbyterianmission.org\/ministries\/today\/predestination\/\n*****\n\nI am no Calvinist, but why would someone need to seek salvation if they believe that?\n\nWhat about confession, do they go to confession like Catholics do? Not according to this. They believe in the \"confessions of faith\":\n\n*****\n\n\"Every Sunday, in many of our Presbyterian congregations, we reaffirm our faith using all or part of one of our confessions--often the Apostles' Creed or the Nicene Creed, or A Brief Statement of Faith. \n\nThe first part of the constitution of the Presbyterian Church (U.S.A.) is the Book of Confessions, which contains 11 formal statements of faith structured as creeds, confessions and catechisms. \n\nElders throughout the denomination, training for leadership, study each of the confessions, its historical origins, and its theological emphases. Our candidates for ministry must demonstrate knowledge and understanding of the confessions on ordination exams and before their presbyteries.\"\n\nhttp:\/\/www.presbyterianmission.org\/ministries\/today\/confessions\/\n*****\n\nSo, what did Trump say that is out of line with what he was taught to believe growing up?\n\nNothing I can see.\n\nWho are you to expect his Christian doctrinal beliefs about asking for forgiveness to be the same as yours?\n\nWhat's next Catholics are not Christian enough?\n\nSeems like I remember a Mormon was the nominee in 2012.\n\nWhy was there no huge outcry about doctrinal issues then?\n\nBecause the people attacking Trump, the money funding these campaigns really could care less about Christian doctrine.\n\nRomney was establishment. Trump is NOT.\n\nThat is the only \"religion\" those people care about, it is called the Church of the Status Quo.\n\nLet's be serious, is he going to be teaching our kids sunday school or carrying out national policy and executing the laws of the nation?\n\nI purposely never talked about all the GOOD things (besides giving a lot of people JOBS) that Trump has done for DECADES before he was running. \n\nHere is one link (Over $100m donated): http:\/\/www.cnn.com\/2016\/03\/03\/politics\/donald-trump-charity\/ \n\nHow can he be evil incarnate doing that kind of charity?\n\nFinally are we electing a POTUS or a POPE?","updated_time":"2016-03-15T17:46:36+0000","id":"394462630661212_935348046572665"},{"updated_time":"2016-03-15T17:12:10+0000","id":"394462630661212_935329749907828"},{"updated_time":"2016-03-15T16:38:45+0000","id":"394462630661212_935296779911125"},{"updated_time":"2016-03-15T15:52:44+0000","id":"394462630661212_935292229911580"},{"message":"Lying Clinton Claims Nobody Died In Libya, Chaos Of Today Better Than Gaddafi \n","updated_time":"2016-03-15T14:25:18+0000","id":"394462630661212_935197333254403"},{"message":"Why Obama shouldn't meet with them...﻿","updated_time":"2016-03-15T13:46:25+0000","id":"394462630661212_934790716628398"},{"message":"Sheriff Clarke – Marxists Disrupting Trump A Stealth Totalitarian Movement \n","updated_time":"2016-03-15T07:20:43+0000","id":"394462630661212_934996769941126"},{"story":"Tina Lane shared Defenders of Liberty MC's post to the group: Constitutional Patriots.","updated_time":"2016-03-15T05:00:06+0000","id":"394462630661212_934863459954457"},{"updated_time":"2016-03-15T04:34:30+0000","id":"394462630661212_934939496613520"},{"updated_time":"2016-03-15T03:45:40+0000","id":"394462630661212_934916539949149"},{"message":"Once again #SenatorJohnCornyn turned his back on the concerns and priorities of his Texas constituents. \n\nToday he was one of only 7 Republicans who voted FOR John King, Obama’s far left nominee for Secretary of Education.\n\nThe US spends more money per student than other nations and US students rank near the bottom of industrialized nations. It is time to abolish the Dept of Education and not name a pro-Common Core leftist to head up the failed bureaucracy.\n\nApparently the only way we can get Mr. Cornyn’s attention is to assure that we send him into retirement when he comes up for re-election.","updated_time":"2016-03-15T03:39:02+0000","id":"394462630661212_934914526616017"},{"updated_time":"2016-03-15T02:31:17+0000","id":"394462630661212_934873853286751"},{"updated_time":"2016-03-15T01:42:03+0000","id":"394462630661212_934745606632909"},{"story":"Lynwood Winford shared Freedom's Final Stand's post to the group: Constitutional Patriots.","updated_time":"2016-03-15T01:41:43+0000","id":"394462630661212_934761923297944"}],"paging":{"previous":"https:\/\/graph.facebook.com\/v2.5\/394462630661212\/feed?limit=500&since=1461205298&access_token=CAACEdEose0cBADcNP15dZCo4PZBPQj0nRAIvNtIZBRxUBq6XrLW4APTaRBOfvbKliEBwIjHGkhkhYDM94X35CwZCojtXJGvAl938KF4cG2SioZC2VpOUNtba2ytwWFibhnlcWzp3kQRYHo1y1GXfFBkHszwHKP1u4o33EZBjgfZBIul3a47jQLdDVw8RbKscWh5Q1irFELEprexjQoDkGsN&__paging_token=enc_AdACSBN2pOkfJJsP8i2BYXE8rZBupPaEpU6YI4AwgZBhFNna7e4CCmF6yk7ADCyGmiEJjxoHvAU4n2TqwMwXAZAvfQtgmbwZCc9bCh1MzmJ9MZAPhiwZDZD&__previous=1","next":"https:\/\/graph.facebook.com\/v2.5\/394462630661212\/feed?limit=500&access_token=CAACEdEose0cBADcNP15dZCo4PZBPQj0nRAIvNtIZBRxUBq6XrLW4APTaRBOfvbKliEBwIjHGkhkhYDM94X35CwZCojtXJGvAl938KF4cG2SioZC2VpOUNtba2ytwWFibhnlcWzp3kQRYHo1y1GXfFBkHszwHKP1u4o33EZBjgfZBIul3a47jQLdDVw8RbKscWh5Q1irFELEprexjQoDkGsN&until=1458006103&__paging_token=enc_AdB9ZAEVIS6ibAyhlZB64JCodBtvuswi7et6drLZB79vxhPYQZAwFIYHmRpL5MgFIzUQRTILQrGEGwtD5CSuLLdjRhAOLzKTi4F2v1YcXEuvn0OWaAZDZD"}},"id":"394462630661212"}